Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Run SQL commands stored in *.sql file
fr: Exécuter des commandes 'SQL' stockées dans un fichier '*.sql'

source: Export database to file
fr: Exporter la base de données vers un fichier

source: Export database CREATE SQL statements into *.sql file
fr: Exporter les instructions 'CREATE SQL' de la base de données dans un fichier '*.sql'

source: Dump data to file
fr: Vider les données dans un fichier

source: Dump data from database into .sql file
fr: Vider les données de la base de données dans un fichier '.sql'

source: Open SQL command panel for the table
fr: Ouvrir le panneau de commande 'SQL' pour la table

source: Run SQL command to delete the table
fr: Exécutez la commande 'SQL' pour supprimer la table

source: Create classes from Table
fr: Créer des classes à partir d'une table

source: Create C++ classes for the table
fr: Créer des classes C++ pour la table

source: Copy Column Name
fr: Copier le nom de la colonne

source: Open SQL command panel for the view
fr: Ouvrir le panneau de commande SQL pour la vue

source: Run SQL command to delete the view
fr: Exécutez la commande 'SQL' pour supprimer la vue

source: Wizard for creating db structure
fr: Assistant de création de la structure de la base de données

source: on ERD diagram base.
fr: sur la base du diagramme 'ERD'.

source: All tables which really exist in
fr: Tous les tableaux qui existent réellement dans

source: the database, will be deleted during
fr: la base de données, sera supprimée lors de la

source: this process, but you can do a backup
fr: ce processus, mais vous pouvez effectuer une sauvegarde

source: in the second step.
fr: dans la deuxième étape.

source: Select target database:
fr: Sélectionnez la base de données cible :

source: The first time you have to select a target database!
fr: La première fois, vous devez sélectionner une base de données cible !

source: Backup data file
fr: Fichier de données de sauvegarde

source: Select file
fr: Sélectionner un fichier

source: Backup database structure
fr: Sauvegarde de la structure de la base de données

source: Backup structure file
fr: Sauvegarde du fichier de structure

source: Backup!
fr: Sauvegarde !

source: Backing up database data before changing the structure is really good idea. Do you want to continue without doing so?
fr: Il est recommandé de sauvegarder les données de la base de données avant d'en modifier la structure. Voulez-vous continuer sans le faire ?

source: Backup
fr: Copie

source: Data saved!
fr: Données sauvegardées !

source: Structure saved!
fr: Structure sauvée !

source: Write log:
fr: Écriture du journal :

source: Write !!
fr: Écrire ! !!

source: Show SQL
fr: Afficher 'SQL'

source: Data structure written successfully!
fr: Structure de données écrite avec succès !

source: Unknown error!
fr: Erreur inconnue !

source: Would you like to continue without writing the database structure?
fr: Souhaitez-vous continuer sans écrire la structure de la base de données ?

source: Writing structure ended.
fr: Fin d'écriture de la structure.

source: File for data restore:
fr: Fichier de restauration des données :

source: Restore log:
fr: Journal de restauration :

source: Restore
fr: Restaurer

source: Open
fr: Ouvrir

source: Open diagram
fr: Ouvrir un diagramme

source: Save
fr: Sauvegarder

source: Save diagram
fr: Sauvegarder le diagramme

source: Save SQL
fr: Sauvegarder 'SQL'

source: Commit ERD
fr: Livrer l'ERD

source: Export canvas to image
fr: Exporter le canevas vers une image

source: Print
fr: Imprimer

source: Print diagram
fr: Imprimer le diagramme

source: Preview
fr: Aperçu

source: Print preview
fr: Imprimer l'aperçu

source: Copy
fr: Copier

source: Copy item
fr: Copier l'article

source: Cut
fr: Couper

source: Cut item
fr: Coupez l'article

source: Paste
fr: Coller

source: Paste item
fr: Coller un élément

source: Undo
fr: Défaire

source: Redo
fr: Refaire

source: Tool
fr: Outil

source: Design tool
fr: Outil de conception

source: Database table
fr: Table de base de données

source: View
fr: Affichage

source: Database view
fr: Vue de la base de données

source: Constraint 1:N
fr: Contrainte 1:N

source: Foreign key connection
fr: Connexion par clé étrangère

source: Align into circle
fr: Aligner sur un cercle

source: Align into mesh
fr: Aligner sur le maillage

source: Align into vertical tree
fr: Aligner verticalement

source: Align into horizontal tree
fr: Aligner dans une arborescence horizontale

source: Zoom to all
fr: Zoomer tout

source: Load canvas from file...
fr: Charger un canevas à partir d'un fichier...

source: Save canvas to file...
fr: Enregistrer le canevas dans un fichier...

source: Save SQL create query...
fr: Sauvegarder la requête de création 'SQL'...

source: The SQL script has been saved to '%s'.
fr: Le script 'SQL' a été enregistré dans '%s'.

source: ERD type doesn't match current database adapter.
fr: Le type d'ERD ne correspond pas à l'adaptateur de base de données actuel.

source: The chart has been saved to '%s'.
fr: Le graphique a été enregistré dans '%s'.

source: New table
fr: Nouvelle table

source: New view
fr: Nouvelle vue

source: Add new ERD table
fr: Ajouter une nouvelle table 'ERD'

source: Add new ERD view
fr: Ajout d'une nouvelle vue 'ERD'

source: Copy diagram SQL to the clipboard
fr: Copier le diagramme 'SQL' dans le presse-papiers

source: Create foreign key for table
fr: Créer une clé étrangère pour la table

source: Create view for table
fr: Créer une vue pour une table

source: Copy table SQL to the clipboard
fr: Copier la table 'SQL' dans le presse-papiers

source: Add drop table statement?
fr: Ajouter une déclaration d'abandon de table ?

source: SQL export
fr: Exportation 'SQL'

source: SQL command has been copied to the clipboard.
fr: La commande 'SQL' a été copiée dans le presse-papiers.

source: Output file:
fr: Fichier de sortie :

source: Browse
fr: Parcourir

source: Scale
fr: Échelle

source: Current canvas scale
fr: Échelle actuelle du canevas

source: Custom scale
fr: Échelle personnalisée

source: Export canvas background
fr: Exporter le canevas d'arrière-plan

source: Database file:
fr: Fichier de base de données :

source: Connection name:
fr: Nom de la connexion :

source: Name for this connection
fr: Nom de cette connexion

source: Server:
fr: Serveur :

source: Host name / IP of the server hosting the MySQL server
fr: Nom d'hôte / IP du serveur hébergeant le serveur 'MySQL'

source: User name:
fr: Nom d'utilisateur :

source: Database user name
fr: Nom de l'utilisateur de la base de données

source: Password:
fr: Mot de passe :

source: Database password
fr: Mot de passe de la base de données

source: Name:
fr: Nom :

source: Default database:
fr: Base de données par défaut :

source: Referencing table:
fr: Table de référencement :

source: Column:
fr: Colonne :

source: restrict
fr: limiter

source: set null
fr: fixer nul

source: no action
fr: aucune action

source: Referenced table:
fr: Table référencée :

source: Log
fr: Journal

source: View name:
fr: Nom de la vue :

source: Class prefix:
fr: Préfixe de la classe :

source: Class postfix:
fr: Postfixe de classe :

source: Folder:
fr: Répertoire :

source: Select a folder
fr: Sélectionner un dossier

source: Virtual folder:
fr: Dossier virtuel :

source: Template:
fr: Modèle :

source: Log:
fr: Journal :

source: Generate
fr: Générer

source: Table name:
fr: Nom de la table :

source: Columns:
fr: Colonnes :

source: Add column
fr: Ajouter une colonne

source: Add new column
fr: Ajouter une nouvelle colonne

source: Remove column
fr: Supprimer la colonne

source: Remove selected column
fr: Enlever la colonne sélectionnée

source: Move column up
fr: Déplacement de la colonne vers le haut

source: Move selected column up
fr: Déplacer la colonne choisie vers le haut

source: Move column down
fr: Déplacer la colonne vers le bas

source: Move selected column down
fr: Déplacer la colonne choisie vers le bas

source: Column name
fr: Nom de colonne

source: Size
fr: Taille

source: Not null
fr: Non nul

source: Autoincrement
fr: Auto-incrément

source: Primary key
fr: Clé primaire

source: Foreign keys:
fr: Clés étrangères :

source: Add foreign key
fr: Ajout d'une clé étrangère

source: Add new foreign key
fr: Ajout d'une nouvelle clé étrangère

source: Remove foreign key
fr: Supprimer une clé étrangère

source: Remove selected foreign key
fr: Supprimer la clé étrangère choisie

source: Key name
fr: Nom de clé

source: Local column:
fr: Colonne locale :

source: Ref. table:
fr: Table de référence :

source: Ref. column:
fr: Colonne de référence :

source: On update
fr: Mise à jour validée

source: On delete
fr: Suppression validée

source: Export image
fr: Exporter l'image

source: Select dbAdapter
fr: Choisir l'adaptateur 'bd'

source: Connection settings
fr: Paramètres de connexion

source: Create foreign key
fr: Créer une clé étrangère

source: Database log
fr: Journal de bases de données

source: View settings
fr: Voir les paramètres

source: Class generator dialog
fr: Boîte de dialogue du générateur de classe

source: SQL Preview
fr: Aperçu 'SQL'

source: Table settings
fr: Paramètres de la table

source: --------------- Log starts at:
fr: --------------- Le journal commence à :

source: -- selected database %s
fr: -- base de données sélectionnée %s

source: Load SQL Script
fr: Charger un script 'SQL'

source: Execute SQL
fr: Exécuter SQL

source: Executing SQL...
fr: Exécution de SQL...

source: Unknown SQL error.
fr: Erreur 'SQL' inconnue.

source: Cant connect!
fr: Pas de connexion !

source: Choose a file
fr: Choisir un fichier

source: Chose a file
fr: Choisir un fichier

source: Insert SELECT SQL template
fr: Insérer un modèle 'SQL SELECT'

source: Insert SELECT SQL statement template into editor.
fr: Insérer le modèle d'instruction 'SQL SELECT' dans l'éditeur.

source: Insert INSERT SQL template
fr: Insérer un modèle 'SQL INSERT'

source: Insert INSERT SQL statement template into editor.
fr: Insérer le modèle d'instruction 'SQL INSERT' dans l'éditeur.

source: Insert UPDATE SQL template
fr: Insérer un modèle 'SQL UPDATE'

source: Insert UPDATE SQL statement template into editor.
fr: Insérer le modèle d'instruction 'SQL UPDATE' dans l'éditeur.

source: Insert DELETE SQL template
fr: Insérer un modèle 'SQL DELETE'

source: Insert DELETE SQL statement template into editor.
fr: Insérer le modèle d'instruction 'SQL DELETE' dans l'éditeur.

source: column
fr: colonne

source: DatabaseExplorer for CodeLite
fr: Explorateur de bases de données pour 'CodeLite'

source: DbExplorer
fr: Explorateur de BD

source: Database Explorer
fr: Explorateur de bases de données

source: Cross platform database explorer
fr: Explorateur de bases de données multiplate-forme

source: 2011 - 2015 (C) Tomas Bata University, Zlin, Czech Republic
fr: 2011 - 2015 (C) Université Tomas Bata, Zlin, République tchèque

source: Image path cannot be empty.
fr: Le chemin de l'image ne peut être vide.

source: Canvas scale must be decimal value.
fr: L'échelle du canevas doit être une valeur décimale.

source: Export ERD to image...
fr: Exporter 'ERD' vers une image...

source: New source breakpoint
fr: Nouveau point d'arrêt source

source: New function breakpoint
fr: Nouveau point d'arrêt de la fonction

source: Delete All
fr: Tout supprimer

source: New function breakppoint
fr: Nouveau point d'arrêt de la fonction

source: Function name
fr: Nom de fonction

source: Set breakpoint in function
fr: Définir un point d'arrêt dans la fonction

source: Location (source:line)
fr: Emplacement (source:ligne)

source: Set breakpoint in source file
fr: Définir un point d'arrêt dans le fichier source

source: Invalid line number
fr: Numéro de ligne non valide

source: ID
fr: Identifiant

source: Name
fr: Nom

source: Line
fr: Ligne

source: Threads
fr: Processus légers

source: Value
fr: Valeur

source: Scopes
fr: Portées

source: Loading...
fr: Chargement...

source: Expand all threads
fr: Développer tous les fils de discussion

source: Copy all
fr: Copier tout

source: Copy this thread backtrace
fr: Copier la trace du fil de discussion

source: Output
fr: Sortie

source: New
fr: Créer

source: Delete
fr: Supprimer

source: Add watch
fr: Ajouter un témoin

source: Scan
fr: Scruter

source: Help
fr: Aide

source: Delete '
fr: Supprimer '

source: Are you sure you want to scan for dap servers? (this will override your current settings)
fr: Êtes-vous sûr de vouloir scruter les serveurs 'dap' ? (ceci remplacera vos paramètres actuels)

source: Enter name
fr: Saisir le nom

source: New dap server name
fr: Nouveau nom du serveur 'dap'

source: General
fr: Général

source: Connection string
fr: Chaîne de connexion

source: Launch type
fr: Type de lancement

source: File path options
fr: Options de chemin d'accès aux fichiers

source: Use relative paths
fr: Utiliser des chemins relatifs

source: Use forward slash
fr: Utiliser la barre oblique avant

source: Use volume
fr: Utilisation du volume

source: Environment variables
fr: Variables d'environnement

source: Server environment
fr: Environnement du serveur

source: Environment format
fr: Format de l'environnement

source: Thread, stacks & variables
fr: Processus légers, piles et variables

source: Breakpoints
fr: Points d'arrêt

source: Watches
fr: Témoins

source: Debug Adapter Client
fr: Déboguer l'adaptateur client

source: Settings
fr: Paramètres

source: Debug Adapter Client...
fr: Déboguer l'adaptateur client...

source: Could not locate project:
fr: Impossible de localiser le projet :

source: Could not locate the requested build configuration
fr: Impossible de trouver la configuration de construction demandée

source: A debug session is running Cancel debug session and continue building?
fr: Une session de débogage est en cours Annuler la session de débogage et poursuivre la construction ?

source: Failed to evaluate expression:
fr: Échec de l'évaluation de l'expression :

source: ERROR: (dap) loading remote file over SSH is not supported yet
fr: ERREUR : ('dap') le chargement de fichiers distants via 'SSH' n'est pas encore supporté

source: does not exist
fr: n'existe pas

source: ERROR: (dap) file:
fr: ERREUR : fichier (dap)

source: File
fr: Fichier

source: Fullpath
fr: Chemin complet

source: Internal breakpoint was hit (id=%d), Applying user breakpoints and continuing
fr: Un point d'arrêt interne a été atteint (id=%d), Appliquer les points d'arrêt de l'utilisateur et continuer

source: Program exited normally.
fr: Le programme s'est terminé normalement.

source: ERROR: failed to place breakpoint: "%s"
fr: ERREUR : échec du placement du point d'arrêt : "%s"

source: Found the breakpoint ID!
fr: L'identifiant du point d'arrêt a été trouvé !

source: Successfully set breakpoint %ld at:
fr: Le point d'arrêt %ld a été défini avec succès à :

source: Successfully set conditional breakpoint %ld at:
fr: Le point d'arrêt conditionnel %ld a été défini avec succès à :

source: Successfully set temporary breakpoint %ld at:
fr: Succès de la mise en place d'un point d'arrêt temporaire %ld à :

source: Successfully set watchpoint %ld watching:
fr: Le point de surveillance %ld a été défini avec succès :

source: Successfully set read watchpoint %ld watching:
fr: La lecture du point de contrôle %ld a été effectuée avec succès :

source: Successfully set read/write watchpoint %ld watching:
fr: Le point de surveillance en lecture/écriture %ld a été mis en place avec succès :

source: address
fr: adresse

source: Successfully connected to debugger server
fr: Connexion réussie au serveur de débogage

source: Applying breakpoints...
fr: Appliquer des points d'arrêt...

source: Applying breakpoints... done
fr: Application de points d'arrêt... terminé

source: Breakpoint %i condition cleared
fr: Condition du point d'arrêt %i effacée

source: Condition %s set for breakpoint %i
fr: Condition %s définie pour le point d'arrêt %i

source: Debugging over SSH, using account:
fr: Débogage via 'SSH', en utilisant le compte :

source: Current working dir:
fr: Lieu de travail actuel :

source: Launching gdb from :
fr: Lancer 'gdb' à partir de :

source: Starting debugger :
fr: Démarrage du débogueur :

source: Can't interrupt debuggee process: I don't know its PID!
fr: Impossible d'interrompre le processus de débogage : Je ne connais pas son 'PID' !

source: Failed to start debugger: permission denied
fr: Échec du démarrage du débogueur : permission refusée

source: Clear
fr: Effacer

source: Remove all containers
fr: Retirer tous les conteneurs

source: Remove unused images
fr: Supprimer les images inutilisées

source: Containers
fr: Conteneurs

source: Remove all unused images, not just dangling ones
fr: Supprimer toutes les images inutilisées, et pas seulement celles qui attendent

source: Restart
fr: Redémarrage

source: Stop
fr: Arrêt

source: Attach Terminal
fr: Attacher le terminal

source: Delete Container
fr: Supprimer le conteneur

source: Workspace Path:
fr: Chemin de l'espace de travail :

source: Docker
fr: Conteneur

source: Docker compose
fr: Former le Conteneur

source: Build options:
fr: Options de construction :

source: Set here the build options to pass to the 'docker build' command. For example: '-t my_container .'
fr: Définissez ici les options de construction à passer à la commande commande 'docker build'. Par exemple : '-t mon_conteneur .'

source: Run
fr: Lancer

source: Run options:
fr: Options d'exécution :

source: Set here the build options to pass to the 'docker run' command. For example: '-i my_container .'
fr: Définissez ici les options de construction à passer à la commande commande 'docker run'. Par exemple : '-i mon_conteneur .'

source: Created
fr: Créé

source: Status
fr: Statut

source: Names
fr: Noms

source: Repository
fr: Dépôt

source: Tag
fr: Balise

source: CreatedAt
fr: Créé à

source: New Docker Workspace
fr: Nouvel espace de travail pour Conteneur

source: Docker Settings
fr: Paramètres du Conteneur

source: Dockerfile Settings
fr: Fichier paramètres du Conteneur

source: Can't find docker executable. Please install docker and let me know where it is
fr: Impossible de trouver l'exécutable 'docker'. Veuillez installer 'docker' et me faire savoir où il se trouve

source: container(s) Continue?
fr: conteneur(s) Poursuivre ?

source: Choosing 'Yes' will remove
fr: En choisissant « Oui », vous supprimez

source: Can not create workspace in the root folder
fr: Impossible de créer un espace de travail dans le dossier racine

source: New Workspace
fr: Nouvel espace de travail

source: Failed to create workspace Workspace already exists
fr: Échec de la création de l'espace de travail L'espace de travail existe déjà

source: Run...
fr: Exécuter...

source: Build...
fr: Construire...

source: Docker for CodeLite
fr: Conteneur pour 'CodeLite'

source: Path:
fr: Chemin :

source: Toolchain Path:
fr: Chemin d'accès des outils de construction :

source: Create in a separate directory
fr: Créer dans un répertoire séparé

source: New EOS Project
fr: Nouveau projet 'EOS'

source: New Project...
fr: Nouveau projet...

source: EOS Wiki
fr: Wiki 'EOS'

source: Could not find EOS CDT installation. Please install it and try again
fr: Impossible de trouver l'installation d'EOS CDT'. Veuillez l'installer et réessayer

source: A project with the same name: '
fr: Un projet portant le même nom : '

source: Failed to create workspace:
fr: Échec de la création de l'espace de travail :

source: Failed to create project:
fr: Échec de la création du projet :

source: Enable .editorconfig support
fr: Activer la prise en charge de '.editorconfig'

source: EditorConfig Settings
fr: 'EditorConfig' Paramètres

source: Support for .editorconfig files in CodeLite
fr: Prise en charge des fichiers '.editorconfig' dans 'CodeLite'

source: Failed to launch tool '
fr: Échec du lancement de l'outil '

source: Tool ID:
fr: Identifiant de l'outil :

source: Identify this tool with an ID from the given list
fr: Identifier cet outil avec un identifiant de la liste donnée

source: The name is used to identify this tool in the 'External Tools' toolbar
fr: Le nom est utilisé pour identifier cet outil dans la barre d'outils « Outils externes »

source: Tool path:
fr: Trajectoire de l'outil :

source: Path to the executable to run
fr: Chemin d'accès à l'exécutable à lancer

source: Working directory:
fr: Répertoire de travail :

source: Set the working directory for this tool
fr: Définir le répertoire de travail pour cet outil

source: Toolbar:
fr: Barre d'outils :

source: Toolbar icon (24x24):
fr: Icône de la barre d'outils (24x24) :

source: Browse...
fr: Parcourir...

source: Toolbar icon (16x16):
fr: Icône de la barre d'outils (16x16) :

source: General:
fr: Général :

source: Save all files before executing this tool
fr: Sauvegarder tous les fichiers avant d'exécuter cet outil

source: Before executing this tool, save all files
fr: Avant d'exécuter cet outil, sauvegardez tous les fichiers

source: Capture process output
fr: Capturer les résultats du processus

source: Run this tool when a file is saved
fr: Exécuter cet outil lorsqu'un fichier est enregistré

source: Whenever a file is being saved, this tool is called with the file's fullpath as the first input argument.
fr: Chaque fois qu'un fichier est sauvegardé, cet outil est appelé avec le chemin complet du fichier comme premier argument d'entrée. le chemin complet du fichier comme premier argument d'entrée.

source: Show list of available macros
fr: Afficher la liste des macros disponibles

source: External Tool
fr: Outil externe

source: Path
fr: Chemin

source: New...
fr: Nouveau...

source: Edit...
fr: Éditer...

source: Delete...
fr: Effacer...

source: Stop All
fr: Tout arrêter

source: External Tools
fr: Outils externes

source: Tools
fr: Outils

source: Are you sure you want to delete this tool?
fr: Êtes-vous sûr de vouloir supprimer cet outil ?

source: A plugin that allows user to launch external tools from within CodeLite
fr: Un extension qui permet à l'utilisateur de lancer des outils externes à partir de 'CodeLite'

source: External Tool %d
fr: Outil externe %d

source: Configure external tools...
fr: Configurer les outils externes...

source: Show Running Tools...
fr: Afficher les outils d'exécution...

source: Select a program:
fr: Choisir un programme :

source: Select a working directory:
fr: Sélectionnez un répertoire de travail :

source: Select an icon:
fr: Choisir une icône :

source: Invalid plugin name
fr: Nom de plugin invalide

source: codelite folder does not exists
fr: - Le dossier 'codelite' n'existe pas

source: The selected plugin folder does not exist
fr: Le dossier de l'extension sélectionnée n'existe pas

source: Wizards Plugin - a collection of useful wizards for C++: new Class Wizard, new wxWidgets Wizard, new Plugin Wizard
fr: Extension d'assistants - une collection d'assistants utiles pour le C++ : nouvel assistant de classe, nouvel assistant de 'wxWidgets', nouvel assistant de plugin

source: Wizards Plugin - a collection of useful utils for C++
fr: Extension d'assistants - une collection d'utilitaires utiles pour C++

source: New CodeLite Plugin Wizard...
fr: Nouvelle extension d'assistants 'CodeLite' ...

source: New Class Wizard...
fr: Nouvel assistant de classe...

source: Wizards
fr: Assistants

source: &New Class...
fr: &Nouvelle Classe...

source: Failed to load wizard's file 'plugin.cpp.wizard'
fr: Échec du chargement du fichier 'plugin.cpp.wizard' de l'assistant

source: Failed to load wizard's file 'plugin.h.wizard'
fr: Échec du chargement du fichier 'plugin.h.wizard' de l'assistant

source: New C++ Class
fr: Nouvelle classe 'C++'

source: Plugin name:
fr: Nom de l'extension :

source: Set the plugin name. The name should be a valid C++ variable name
fr: Définit le nom de l'extension. Le nom doit être un nom de variable C++ valide
