Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Provide the plugin a short description
fr: Fournir une brève description de l'extension

source: codelite root dir:
fr: répertoire racine de 'codelite' :

source: Select the location of codelite's source tree
fr: Sélectionner l'emplacement de l'arbre source de 'Codelite'

source: Project path:
fr: Chemin du projet :

source: Select the plugin project path
fr: Sélectionnez le chemin d'accès au projet d'extension

source: New Plugin Wizard
fr: Nouvel assistant de plugin

source: Class Name:
fr: Nom de la classe :

source: The class name
fr: Le nom de la classe

source: Namespace:
fr: Espace de noms :

source: Place this class inside a namespace
fr: Placer cette classe dans un espace de noms

source: Inherits:
fr: Hérite :

source: File name:
fr: Nom de fichier :

source: This is the base-name for the file(s) that will be generated. If the new class is called Foo, by default the files will be Foo.cpp and Foo.h. If you'd prefer different names, type the base-name here.
fr: Il s'agit du nom de base pour le(s) fichier(s) qui sera(ont) généré(s). Si la nouvelle classe s'appelle 'Foo', les fichiers seront par défaut 'Foo.cpp' et 'Foo.h'. Si vous préférez des noms différents, saisissez le nom de base ici.

source: Block Guard:
fr: Bloc de garde :

source: Set block guard to prevent multiple file inclusion. If left empty, the class name is used
fr: Définit la protection des blocs pour empêcher l'inclusion de plusieurs fichiers. S'il est laissé vide, le nom de la classe est utilisé

source: Virtual Directory:
fr: Répertoire virtuel :

source: The new class needs to be put somewhere. Select which of the project's virtual folders to use.
fr: La nouvelle classe doit être placée quelque part. Sélectionnez le dossier virtuel du projet à utiliser.

source: Where on the filesystem should the new class's files be put? This will normally be the directory corresponding to the Virtual Directory; but you can enter an alternative directory here if you wish.
fr: Où les fichiers de la nouvelle classe doivent-ils être placés sur le système de fichiers ? Il s'agit normalement du répertoire correspondant au répertoire virtuel, mais vous pouvez entrer un autre répertoire si vous le souhaitez.

source: Create .hpp instead of .h
fr: Créer un '.hpp' au lieu d'un '.h'

source: If checked, the generated header file will be foo.hpp instead of foo.h
fr: Si cette case est cochée, le fichier d'en-tête généré sera 'foo.hpp 'au lieu de 'foo.h'

source: Use lowercase file names
fr: Utiliser des noms de fichiers en minuscules

source: Use #pragma once
fr: Utiliser '#pragma' une fois

source: Advanced
fr: Avancé

source: This is a singleton class
fr: Il s'agit d'une classe unique

source: Virtual destructor
fr: Destructeur virtuel

source: Inline class
fr: Classe en ligne

source: Put both the declaration and the implementation in the header file
fr: Placer la déclaration et l'implémentation dans le fichier d'en-tête

source: Prohibit further inheritance
fr: Interdire tout héritage ultérieur

source: Declare this class non-copyable
fr: Déclarer cette classe non copiable

source: Declare this class non-movable
fr: Déclarer cette classe non déplaçable

source: New Class
fr: Nouvelle classe

source: ' is not a valid C++ qualifier
fr: ' n'est pas un qualificatif C++ valide

source: ': directory does not exist
fr: ' : le répertoire n'existe pas

source: Empty file name
fr: Nom de fichier vide

source: A file with this name: '%s' already exists, continue anyway?
fr: Un fichier portant ce nom : '%s' existe déjà, continuez quand même ?

source: Please select a virtual directory
fr: Veuillez sélectionner un répertoire virtuel

source: Select Generated Files Path:
fr: Sélectionnez Chemin des fichiers générés :

source: Choose a name to give the project
fr: Choisir un nom pour le projet

source: Project Path:
fr: Chemin du projet :

source: Application Type:
fr: Type d'application :

source: GUI application with Main Frame
fr: Application 'GUI' avec cadre principal

source: GUI dialog-based application (wxFormBuilder)
fr: Application graphique basée sur un dialogue (wxFormBuilder)

source: GUI frame-based application (wxFormBuilder)
fr: Application GUI basée sur un cadre (wxFormBuilder)

source: Simple main with wxWidgets enabled
fr: Simple 'main' avec 'wxWidgets' activés

source: The normal choice will be 'GUI application', but choose 'Simple main' for a wx console app
fr: Le choix normal sera « application GUI », mais choisissez « Simple main » pour une application console 'wx'

source: Advanced Settings:
fr: Paramètres avancés :

source: Create the project under a separate directory
fr: Créer le projet dans un répertoire séparé

source: Use precompiled headers
fr: Utiliser des en-têtes précompilés

source: Use MS Windows resources
fr: Utiliser les ressources de 'MS Windows'

source: Add -mwindows flag to avoid a terminal console in MSWin GUI apps
fr: Ajouter le drapeau '-mwindows' pour éviter l'apparition d'une console de terminal dans les applications graphiques 'MSWin'

source: Without this flag, there will be an unnecessary, visible terminal window when your app runs on MSWindows
fr: Sans ce drapeau, il y aura une fenêtre de terminal visible et inutile lorsque votre application fonctionnera sous 'MSWindows'

source: Basics
fr: Les bases

source: Use Unicode Build of wxWidgets
fr: Utiliser la version 'Unicode' de 'wxWidgets'

source: Uses an unicode configuration if found.
fr: Utilise une configuration 'unicode' si elle est trouvée.

source: Use Static wxWidgets libraries
fr: Utiliser les bibliothèques statiques de 'wxWidgets'

source: Uses a static configuration if found.
fr: Utilise une configuration statique si elle est trouvée.

source: Use Universal wxWidgets libraries
fr: Utiliser les bibliothèques universelles de 'wxWidgets'

source: Uses an universal configuration if found.
fr: Utilise une configuration universelle si elle est trouvée.

source: Use selected wxWidgets version.
fr: Utiliser la version de 'wxWidgets' sélectionnée.

source: Prefix:
fr: Préfixe :

source: Path of the wxWidgets installation (optional).
fr: Chemin d'accès à l'installation de 'wxWidgets' (facultatif).

source: wxWidgets settings
fr: - Paramètres des 'wxWidgets'

source: New wxWidgets Project
fr: Nouveau projet wxWidgets

source: Default
fr: Par défaut

source: Invalid project name '
fr: Nom de projet invalide '

source: Valid characters for project name are [0-9A-Za-z_]
fr: Les caractères valides pour le nom du projet sont [0-9A-Za-z_].

source: Failed to create the path: %s A permissions problem, perhaps?
fr: Échec de la création du chemin d'accès : %s Un problème de permissions, peut-être ?

source: The Help plugin uses 'Dash' for displaying the offline documentation Please click the link below to download and install Dash
fr: Le plugin d'aide utilise 'Das' pour afficher la documentation hors ligne. Veuillez cliquer sur le lien ci-dessous pour télécharger et installer 'Dash'

source: Go to Dash website
fr: Aller sur le site internet de 'Dash'

source: The Help plugin uses 'Zeal' for displaying the offline documentation Please click the link below to download and install Zeal
fr: L'extension d'aide utilise 'Zeal' pour afficher la documentation hors ligne. Veuillez cliquer sur le lien ci-dessous pour télécharger et installer 'Zeal'

source: Go to Zeal website
fr: Aller sur le site de Zeal

source: Download Zeal
fr: Télécharger 'Zeal'

source: Docsets
fr: Ensemble de documentation

source: Set a list of docsets to use when requesting help while inside a C/C++ files (comma separated list)
fr: Définir une liste de documents à utiliser lors d'une demande d'aide à l'intérieur d'un fichier 'C/C++' (liste séparée par des virgules)

source: Set a list of docsets to use when requesting help while inside a PHP files (comma separated list)
fr: Définir une liste de documents à utiliser lors d'une demande d'aide dans un fichier 'PHP' (liste séparée par des virgules)

source: Set a list of docsets to use when requesting help while inside a CMake files (comma separated list)
fr: Définir une liste de doccuments à utiliser lors d'une demande d'aide à l'intérieur d'un fichier 'CMake' (liste séparée par des virgules)

source: Set a list of docsets to use when requesting help while inside an HTML files (comma separated list)
fr: Définir une liste de documents à utiliser pour demander de l'aide à l'intérieur d'un fichier 'HTML' (liste séparée par des virgules).

source: Set a list of docsets to use when requesting help while inside an CSS files (comma separated list)
fr: Définir une liste de documents à utiliser pour demander de l'aide à l'intérieur d'un fichier 'CSS' (liste séparée par des virgules)

source: Set a list of docsets to use when requesting help while inside a JavaScript files (comma separated list)
fr: Définir une liste de documents à utiliser pour demander de l'aide à l'intérieur d'un fichier 'JavaScript' (liste séparée par des virgules).

source: Set a list of docsets to use when requesting help while inside a Java files (comma separated list)
fr: Définir une liste de documents à utiliser lors d'une demande d'aide dans un fichier 'Java' (liste séparée par des virgules).

source: Help Plugin Error
fr: Aide Erreur du plugin

source: Provide help based on selected words
fr: Fournir une aide basée sur les mots sélectionnés

source: HelpPlugin
fr: Aide sur les extensions

source: Help Plugin
fr: Aide sur les extensions

source: Search the docs for '
fr: Recherchez dans la documentation '

source: Language Server is still not ready...
fr: Le serveur de langages n'est toujours pas prêt...

source: (hit ESCAPE key to dismiss)
fr: (appuyer sur la touche ESCAPE pour quitter)

source: Restarting Language Servers...
fr: Redémarrage des serveurs de langages ...

source: Ready
fr: Prêt

source: Select the supported languages by this server:
fr: Sélectionnez les langages pris en charge par ce serveur :

source: Are you sure you want to delete '
fr: Êtes-vous sûr de vouloir supprimer '

source: Select Language Servers to add
fr: Sélectionnez les serveurs de langages à ajouter

source: Enable Language Server Completion
fr: Activer l'achèvement du serveur de langages

source: Available Language Servers
fr: Serveurs de langages disponibles

source: Scan...
fr: Scruter...

source: Scan for installed Language Servers insalled
fr: Scrutation des serveurs de langages installés

source: Add...
fr: Ajouter...

source: Add new Language Server
fr: Ajouter un nouveau serveur de langages

source: Give this language server a unique name
fr: Donner un nom unique à ce serveur linguistique

source: Command:
fr: Commande :

source: The language server executable
fr: L'exécutable du serveur de langages

source: Set the language server working directory
fr: Définir le répertoire de travail du serveur de langages

source: Languages:
fr: Langages :

source: List of supported languages by this Language Server
fr: Liste des langues prises en charge par ce serveur de langages

source: Show List of Languages
fr: Afficher la liste des langages

source: Connection string:
fr: Chaîne de connexion :

source: Set the connection string here. If the server connects using 'stdio', choose the 'stdio' entry Otherwise, set a connection in the form of: tcp://127.0.0.1:12345
fr: Définissez ici la chaîne de connexion. Si le serveur se connecte en utilisant 'stdio', choisissez l'entrée 'stdio' Sinon, définissez une connexion sous la forme suivante : tcp://127.0.0.1:12345

source: If the language server is using TCP Type the connection string in the format of: tcp://host:port
fr: Si le serveur de langues utilise TCP Saisissez la chaîne de connexion au format : tcp://host:port

source: Priority:
fr: Priorité :

source: Multiple Plugins / Servers can compete for providing code completion for a given language. Set here the server priority. The server with the highest priority will be triggered first Note that the builtin plugins are using priority in the range of 10 - 75 If you want that the LSP will be the first in the chain, set its priority to a value that is higher than 75
fr: Plusieurs extensions / serveurs peuvent se faire concurrence pour fournir la complétion de code pour une langue donnée. Définissez ici la priorité du serveur. Le serveur ayant la priorité la plus élevée sera déclenché en premier Notez que les extensions intégrées utilisent une priorité comprise entre 10 et 75. Si vous souhaitez que le 'LSP' soit le premier de la chaîne, définissez sa priorité à une valeur supérieure à 75

source: Display diagnostics
fr: Affichage des diagnostics

source: Language Server Settings
fr: Paramètres du serveur de langages

source: New Language Server
fr: Nouveau serveur de langage

source: Outline View
fr: Vue d'ensemble

source: Support for Language Server Protocol (LSP)
fr: Prise en charge du protocole du serveur de langage (LSP)

source: Language Server
fr: Serveur de langage

source: Restart Language Servers
fr: Redémarrer les serveurs de langages

source: Find references
fr: Trouver des références

source: Rename symbol
fr: Renommer un symbole

source: Find symbol
fr: Trouver un symbole

source: Search for a keyboard shortcut either by its keyboard shortcut or by its description
fr: Recherche d'un raccourci clavier par son raccourci clavier ou par sa description

source: Keyboard Shortcut
fr: Raccourci clavier

source: &Edit...
fr: &Éditer...

source: &Defaults
fr: &Défauts

source: Keyboard Shortcuts
fr: Raccourcis clavier

source: Edit
fr: Éditer

source: Breakpoint successfully deleted
fr: Point d'arrêt supprimé avec succès

source: All Breakpoints deleted
fr: Tous les points d'arrêt sont supprimés

source: Pending Breakpoints reapplied
fr: Tous les points d'arrêt supprimés, et ceux en attente réappliqués

source: Temp.
fr: Temporaire.

source: Breakpoint
fr: Point d'arrêt

source: Watchpoint
fr: Point de surveillance

source: disabled
fr: désactivé

source: Edit Breakpoint...
fr: Editer le point d'arrêt...

source: Delete Breakpoint
fr: Supprimer le point d'arrêt

source: Edit build order for project '
fr: Modifier l'ordre de construction du projet '

source: You have un-saved changes, would you like to save them before changing configuration?
fr: Vous avez des modifications non enregistrées, souhaitez-vous les enregistrer avant de modifier la configuration ?

source: A file with the same name already exists, continue?
fr: Un fichier portant le même nom existe déjà, continuez ?

source: total time
fr: durée totale

source: seconds
fr: secondes

source: (Build cancelled by the user)
fr: (Construction annulée par l'utilisateur)

source: ==== build ended with
fr: ==== la construction s'est terminée par

source: errors
fr: erreurs

source: === build ended with
fr: === la construction s'est terminée par

source: warnings
fr: avertissements

source: === build completed
fr: === construction terminée

source: successfully
fr: avec succès

source: errors,
fr: erreurs,

source: warnings)
fr: avertissements)

source: Initializing CodeLite
fr: Initialisation de 'CodeLite'

source: Pattern
fr: Modèle

source: File name index
fr: Index des noms de fichiers

source: Line number index
fr: Index des numéros de ligne

source: Column index
fr: Index des colonnes

source: Switch
fr: Commutateur

source: Add an existing compiler
fr: Ajouter un compilateur existant

source: Copy compiler
fr: Copier le compilateur

source: Scan for compilers
fr: Scruter les compilateurs

source: Add compiler error pattern
fr: Ajouter un modèle d'erreur de compilation

source: Add compiler warning pattern
fr: Ajout d'un modèle d'avertissement pour le compilateur

source: Are you sure you want to delete this compiler option?
fr: Êtes-vous sûr de vouloir supprimer cette option du compilateur ?

source: Are you sure you want to delete this linker option?
fr: Êtes-vous sûr de vouloir supprimer cette option de liaison ?

source: Update compiler warning pattern
fr: Mise à jour du modèle d'avertissement du compilateur

source: Update compiler error pattern
fr: Mise à jour du modèle d'erreur du compilateur

source: switch:
fr: commuter :

source: Please fill all the fields
fr: Veuillez remplir tous les champs

source: Rename...
fr: Renommer ..

source: Are you sure you want to delete compiler '
fr: Êtes-vous sûr de vouloir supprimer le compilateur '

source: Delete Compiler
fr: Supprimer le compilateur

source: New Compiler Name
fr: Nouveau nom du compilateur

source: Rename Compiler
fr: Renommer le compilateur

source: Compiler option
fr: Option du compilateur

source: Linker option
fr: Option du lieur

source: Select the compilers to configure:
fr: Choisir les compilateurs à configurer :

source: Installation path
fr: Chemin d'installation

source: Some of the compilers referred by the workspace no longer exist. Define each missing compiler by cloning an existing compiler.
fr: Certains compilateurs référencés par l'espace de travail n'existent plus. Définissez chaque compilateur manquant en clonant un compilateur existant.

source: Compilers
fr: Compilateurs

source: Find Installed Compilers
fr: Rechercher les compilateurs installés

source: Could not find selected compiler...
fr: Impossible de trouver le compilateur sélectionné...

source: <Click to select a compiler...>
fr: <Cliquez pour sélectionner un compilateur...>

source: ' by cloning an existing compiler
fr: en clonant un compilateur existant

source: Create a new compiler named '
fr: Créer un nouveau compilateur nommé '

source: Select the workspace configuration to edit from the drop down list:
fr: Sélectionnez la configuration de l'espace de travail à modifier dans la liste déroulante :

source: Project
fr: Projet

source: Configuration Manager
fr: Gestionnaire de configuration

source: Set the class name here For example: std::string
fr: Définissez le nom de la classe ici Par exemple : 'std::string'

source: set the class name. e.g. std::string
fr: définit le nom de la classe, par exemple 'std::string'

source: Expression to display for this class type
fr: Expression à afficher pour ce type de classe

source: Debugger command:
fr: Commande du débogueur :

source: debugger command to invoke for 'expression'
fr: commande du débogueur à invoquer pour 'expression'

source: Debugger Type
fr: Type du débogueur

source: Copy Backtrace to Clipboard
fr: Copier la trace arrière dans le presse-papiers

source: Smart curly brackets
fr: Parenthèses intelligentes

source: Smart square brackets and parentheses
fr: Crochets et parenthèses intelligents

source: Auto complete closing bracket and parentheses
fr: Compléter automatiquement les parenthèses et crochets fermants

source: Smart quotes
fr: Guillemets intelligents

source: Copying empty selection copies caret line
fr: Copier une sélection vide et copier la ligne du curseur

source: Disable semicolon shift
fr: Désactiver le décalage du point-virgule

source: Typing in Selection
fr: Saisie de la sélection

source: Wrap with quotes
fr: Encadrer avec guillemets

source: Wrap with brackets
fr: Encadrer avec des crochets

source: Other
fr: Autre

source: Enable zoom with mouse scroll
fr: Activer le zoom avec le défilement de la souris

source: Indent line comments
fr: Indenter les commentaires de ligne

source: Line numbers
fr: Numéros de ligne

source: Display line numbers
fr: Afficher les numéros de ligne

source: Highlight current line number
fr: Surligner le numéro de la ligne en cours

source: Use relative line numbers
fr: Utiliser les numéros de ligne relatifs

source: What to highlight?
fr: Que mettre en avant ?

source: Indentation lines
fr: Lignes d'indentation

source: Matching braces
fr: Appairage des accolades

source: Modified lines
fr: Lignes modifiées

source: Caret line
fr: Ligne du curseur

source: Enable background colour
fr: Activer la couleur d'arrière-plan

source: Background colour
fr: Couleur d'arrière plan

source: Right margin indicator
fr: Indicateur de marge droite

source: Show right margin indicator
fr: Afficher l'indicateur de marge droite

source: Indicator column
fr: Colonne de l'indicateur

source: Debugger line
fr: Ligne de débogage

source: Whitespace
fr: Espaces

source: Visible always
fr: Toujours visible

source: Visible after indentation
fr: Visible après indentation

source: Indentation visibility
fr: Visibilité de l'indentation

source: EOL Style
fr: Style fin de ligne

source: Line spacing
fr: Espacement des lignes

source: Select working directory:
fr: Choisir le répertoire de travail :

source: Active?
fr: Actif ?

source: Function
fr: Fonction

source: Workspaces
fr: Espaces de travail

source: Open an existing workspace
fr: Ouvrir un espace de travail existant

source: Create a new workspace
fr: Créer un nouvel espace de travail

source: Visit our GitHub project page
fr: Visitez notre page de projet 'GitHub'

source: Gitter
fr: Accès à 'Git'

source: Join the chat!
fr: Participez à la discussion !

source: Local workspaces
fr: Espaces de travail locaux

source: File System
fr: Système de fichiers

source: '%s' is already assigned to: '%s' Would you like to replace it?
fr: '%s' est déjà affecté à : '%s' Souhaitez-vous le remplacer ?

source: Check the command line options you need
fr: Vérifiez les options de ligne de commande dont vous avez besoin

source: Enter other options
fr: Saisir d'autres options

source: Command line
fr: Ligne de commande

source: Build Settings
fr: Paramètres de construction

source: Build Panel
fr: Panneau de construction

source: A compiler with this name already exists
fr: Un compilateur portant ce nom existe déjà

source: Confirm
fr: Confirmer

source: Remove Compiler?
fr: Supprimer le compilateur ?

source: Clone a compiler
fr: Cloner un compilateur

source: Scan computer for installed compilers
fr: Scruter les compilateurs installés sur l'ordinateur

source: Select the compiler folder
fr: Sélectionner le dossier du compilateur

source: New compiler found!
fr: Nouveau compilateur trouvé !

source: Set a name to the compiler
fr: Attribuer un nom au compilateur

source: Explorer
fr: Explorateur

source: Debugger to use:
fr: Débogueur à utiliser :

source: Filter:
fr: Filtre :

source: Processes:
fr: Processus :

source: &Attach
fr: &Attacher

source: &Refresh
fr: &Rafraîchir

source: Attach debugger to process:
fr: Attachez le débogueur au processus :

source: Select the configurations to build/clean:
fr: Sélectionnez les configurations à construire/nettoyer :

source: &Build
fr: &Générer

source: &Clean
fr: &Nettoyer

source: &Uncheck All
fr: &Tout décocher

source: Move Up
fr: Déplacer vers le haut

source: Move Down
fr: Déplacer vers le bas

source: Batch Build
fr: Construction par lot

source: &Add
fr: &Ajouter

source: Add a new breakpoint or watchpoint
fr: Ajouter un nouveau point d'arrêt ou de surveillance

source: &Edit
fr: &Édition

source: Edit the selected item
fr: Modifier l'élément sélectionné

source: &Delete
fr: Suppri&mer

source: Delete the selected item
fr: Supprimer l'élément sélectionné

source: Delete &All
fr: &Tout supprimer

source: Delete all breakpoints and watchpoints
fr: Supprimer tous les points d'arrêt et les points de surveillance

source: Set Pending
fr: Définir en attente

source: If this button is visible, there are breakpoints that you tried to set, but that the debugger refused. This most often happens when the breakpoint is inside a library that hadn't been loaded when the debugger started. Click to offer the breakpoints to the debugger again.
fr: Si ce bouton est visible, cela signifie qu'il existe des points d'arrêt que vous avez essayé de définir, mais que le débogueur a refusé. Cela se produit le plus souvent lorsque le point d'arrêt se trouve à l'intérieur d'une bibliothèque qui n'avait pas été chargée lorsque le débogueur a démarré. Cliquez sur ce bouton pour proposer à nouveau les points d'arrêt au débogueur.

source: Select the type of the breakpoint:
fr: Sélectionnez le type de point d'arrêt :
