Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Clone the sources into this target directory
fr: Cloner les sources dans ce répertoire cible

source: Select patch file
fr: Sélectionner le fichier correctif

source: Patch file to apply
fr: Fichier correctif à appliquer

source: git apply additional flags to use:
fr: 'git' applique des drapeaux supplémentaires à utiliser :

source: By default, codelite uses the command 'git apply --whitespace=nowarn --ignore-whitespace' for applying patch files. Set here an extra flags to use with this command, e.g.: --reverse See the git manual for more options
fr: Par défaut, 'codelite' utilise la commande 'git apply --whitespace=nowarn --ignore-whitespace' pour appliquer les corrections. Définissez ici un drapeau supplémentaire à utiliser avec cette commande, par exemple : --reverse Voir le manuel git pour plus d'options

source: Untracked
fr: Non suivi

source: Go backwards to earlier commit's blame
fr: Revenir en arrière pour retrouver les fautes commises antérieurement

source: Show earlier commit's blame
fr: Afficher les reproches d'un commit antérieur

source: Go forward to more-recent commit's blame
fr: Aller de l'avant vers les plus récentes fautes de livraisons

source: Show next-seen commit's blame
fr: Afficher le reproche de la livraison suivante

source: Previously-visited commits. Note that these are listed in the order that you visited them, not commit-date order.
fr: Livraisons précédemment visitées. Notez qu'elles sont listées dans l'ordre dans lequel vous les avez visitées, et non dans l'ordre de la date de la livraison.

source: Extra arguments:
fr: Arguments supplémentaires :

source: Optional extra arguments that you wish passed to git blame. An example might be: -L 100,130 Note that this is _not_ sanity-checked, it's added just as it is.
fr: Arguments supplémentaires optionnels que vous souhaitez passer à 'git blame'. Un exemple pourrait être : -L 100,130 Notez que ceci n'est pas vérifié, il est ajouté tel quel.

source: Redo the current commit's blame
fr: Refaire le rejet de la livraison en cours

source: Double-clicking a line shows blame for the parent commit
fr: Un double-clic sur une ligne permet d'afficher la responsabilité de la livraison parent

source: A double-click on a code line refreshes blame, rebasing it either to the commit clicked or to its parent commit. Most of the time you will want to see what the code looked like earlier, so will want the parent commit.
fr: Un double-clic sur une ligne de code rafraîchit le blâme, en le reprenant soit au commit cliqué, soit à son commit parent. La plupart du temps, vous voudrez voir à quoi ressemblait le code plus tôt, et donc vous voudrez le commit parent.

source: Show the log and diff for the selected commit
fr: Afficher le journal et le différentiel de la livraison sélectionnée

source: When a blame line is selected, the commit log message and diff are shown at the bottom of the dialog. Uncheck this box to hide those fields.
fr: Lorsqu'une ligne de reproche est sélectionnée, le message du journal de livraison et la différence sont affichés au bas de la boîte de dialogue. Décochez cette case pour masquer ces champs.

source: These are the file(s) you have chosen to Reset
fr: Voici le(s) fichier(s) que vous avez choisi(s) de réinitialiser

source: Altered files
fr: Fichiers modifiés

source: These are the files that are altered. Select which you want to reset.
fr: Ce sont les fichiers qui sont modifiés. Sélectionnez ceux que vous souhaitez réinitialiser.

source: Added files
fr: Fichiers ajoutés

source: These are the files that have been added. Select which you want to remove.
fr: Voici les fichiers qui ont été ajoutés. Sélectionnez ceux que vous souhaitez supprimer.

source: Please tell me who you are:
fr: Dites-moi qui vous êtes :

source: Email:
fr: Courriel :

source: Git settings...
fr: Paramètres 'Git'...

source: Git commit
fr: Livraison 'git'

source: Commit List
fr: Liste des livraisons

source: Current Diffs
fr: Différences actuelles

source: Select Commits to Diff
fr: Sélectionner les livraisons à différencier

source: File diff
fr: Différences de fichiers

source: Git Apply Patch
fr: Appliquer le correctif 'git'

source: Git Blame
fr: Faute 'Git'

source: Git Blame Settings
fr: 'Git Blame' Paramètres

source: Git Reset Files
fr: Réinitialisation des fichiers 'git'

source: Git User
fr: Utilisateur 'git'

source: Artistic Style has terminated
fr: 'Artistic Style' a pris fin

source: Formatted %s
fr: Formatté %s

source: Unchanged %s
fr: Inchangé %s

source: Cannot process UTF-32 encoding
fr: Ne peut pas traiter l'encodage 'UTF-32'

source: Cannot open directory
fr: Ne peut pas ouvrir le répertoire

source: Exclude %s
fr: Exclure %s

source: Cannot open HTML file %s
fr: Ne peut pas ouvrir le fichier 'HTML' %s

source: Opening HTML documentation %s
fr: Ouverture de la documentation 'HTML' %s

source: Command execute failure
fr: Le lancement de la commande a échoué

source: Command is not installed
fr: La commande n'est pas installée

source: Missing filename in %s
fr: Nom de fichier absent dans %s

source: Recursive option with no wildcard
fr: Option récursive sans joker

source: Did you intend quote the filename
fr: Vouliez-vous mettre le nom de fichier entre guillemets

source: Directory %s
fr: Répertoire %s

source: Exclude (unmatched) %s
fr: Exclure (non appairé) %s

source: Did you intend to use --recursive
fr: Vouliez-vous utiliser '--recursive'

source: No file to process %s
fr: Aucun fichier à traiter %s

source: Invalid option file options:
fr: Option de fichier d'options non valable :

source: Cannot open options file
fr: Ne peut ouvrir le fichier d'options

source: For help on options type 'astyle -h'
fr: Pour une aide sur les options entrer 'astyle -h'

source: Invalid command line options:
fr: Options en ligne de commande invalides :

source: Using default options file %s
fr: Fichier d'options par défaut en cours %s

source: %s formatted %s unchanged
fr: %s formatté %s inchangé

source: seconds
fr: secondes

source: %s lines
fr: %s lignes

source: ResultSet NOT closed and cleaned up by the DatabaseLayer dtor
fr: L'ensemble de résultats n'est ni fermé ni nettoyé par le destructeur de la couche de base de données

source: PreparedStatement NOT closed and cleaned up by the DatabaseLayer dtor
fr: Déclaration préparée ni fermée ni nettoyée par le destructeur de la couche de base de données

source: string
fr: chaîne

source: localhost
fr: hôte local

source: Unable to start transaction
fr: Impossible de démarrer la transaction

source: Database handle is NULL
fr: L'identifiant de la base de données est NUL

source: Parameter type is not compatible with parameter of type double
fr: Le type de paramètre n'est pas compatible avec un paramètre de type double

source: Error allocating space for unknown parameter type
fr: Erreur d'allocation d'espace pour un type de paramètre inconnu

source: Error deleting unknown parameter type
fr: Erreur lors de la suppression d'un type de paramètre inconnu

source: No SQL Statements found
fr: Aucune instruction 'SQL' trouvée

source: Invalid Prepared Statement Parameter
fr: Paramètre de l'instruction préparée non valide

source: Error calling isc_dsql_free_statement
fr: Erreur lors de l'appel à 'isc_dsql_free_statement'

source: Error retrieving Next record
fr: Erreur dans l'extraction de l'enregistrement suivant

source: Invalid field type
fr: Type de champ non valide

source: ' not found in the resultset
fr: ' n'a pas été trouvé dans le jeu de résultats

source: Field '
fr: Champ '

source: SHOW TABLE STATUS WHERE Comment != 'VIEW' AND Name=?;
fr: AFFICHER L'ETAT du TABLEAU SI LE COMMENTAIRE != 'VIEW' ET LE NOM=? ;

source: SHOW COLUMNS FROM %s;
fr: AFFICHER LES COLONNES DE %s ;

source: Error allocating buffer
fr: Erreur d'allocation du tampon

source: Don't understand type : %d
fr: Ne comprend pas le type : %d

source: Host=
fr: Hôte=

source: Service Name=
fr: Nom du service=

source: Error creating database connection
fr: Erreur lors de la création de la connexion à la base de données

source: Invalid Date
fr: Date invalide

source: Result as string: '%s'
fr: Résultat sous forme de chaîne : '%s'

source: Not implemented
fr: Pas de mise en œuvre

source: ResultSet NOT closed and cleaned up by the PreparedStatement dtor
fr: Résultat ni fermé ni nettoyé par le destructeur de la déclaration préparée

source: ' does not exist.
fr: n'existe pas.

source: The specified database file '
fr: Le fichier de base de données spécifié '

source: Beginning transaction
fr: Transaction initiale

source: begin transaction;
fr: début de la transaction ;

source: Committing transaction
fr: Engager une transaction

source: commit transaction;
fr: engager la transaction ;

source: Rolling back transaction
fr: Annulation de la transaction

source: rollback transaction;
fr: annuler la transaction ;

source: Error with RunQueryWithResults
fr: Erreur avec 'RunQueryWithResults'

source: Unknown error advancing result set
fr: Erreur inconnue faisant progresser l'ensemble des résultats

source: USE
fr: UTILISER

source: Edit content
fr: Modifier le contenu

source: No Database opened
fr: Aucune base de données ouverte

source: Statement not accessible
fr: Déclaration non accessible

source: Out of memory
fr: Mémoire insuffisante

source: Cannot decode binary
fr: Décodage binaire impossible

source: Invalid field index
fr: Index de champ invalide

source: Invalid field name
fr: Nom de champ invalide

source: Invalid row index
fr: Index de ligne non valide

source: Invalid scalar query
fr: Requête scalaire non valide

source: Null Results pointer
fr: Pointeur de résultats nul

source: Error binding string param
fr: Erreur du lieur sur le paramètre 'string'

source: Error binding int param
fr: Erreur du lieur sur le paramètre 'int'

source: Error binding int64 param
fr: Erreur de liaison du paramètre 'int64'

source: Error binding double param
fr: Erreur de liaison du paramètre 'double'

source: Error binding blob param
fr: Erreur de liaison du paramètre 'blob'

source: Error binding date/time param
fr: Erreur de liaison du paramètre 'date/time'

source: Error binding NULL param
fr: Erreur de liaison du paramètre 'null'

source: Error clearing bindings
fr: Erreur dans l'effacement des liens

source: Meta data support not available
fr: Le support des métadonnées n'est pas disponible

source: Encryption support not available
fr: Le support de cryptage n'est pas disponible

source: Loadable extension support not available
fr: Le support d'extension chargeable n'est pas disponible

source: Common Settings
fr: Paramètres communs

source: wxAuiManager member name
fr: - Nom du membre de 'wxAuiManager'

source: Background Colour
fr: Couleur de l'arrière-plan

source: Pane border size
fr: Taille de la bordure du volet

source: Sash
fr: Séparation

source: Sash colour
fr: Couleur de la séparation

source: Set the wxAUI sash size
fr: Définir la taille de la séparation de 'wxAUI'

source: Gradient type
fr: Type de gradient

source: Active caption colour
fr: Couleur de la légende active

source: Active caption gradient colour
fr: Couleur du dégradé de la légende active

source: Inactive caption colour
fr: Couleur de légende inactive

source: Inactive caption gradient colour
fr: Couleur du dégradé de la légende inactive

source: Active caption text colour
fr: Couleur du texte de la légende active

source: Inactive caption text colour
fr: Couleur du texte de la légende inactive

source: Triggered when any button is pressed for any docked panes
fr: Déclenché lorsqu'un bouton est pressé pour n'importe quel volet ancré

source: Triggered when a docked or floating pane is closed.
fr: Déclenché lorsqu'un volet ancré ou flottant est fermé.

source: Triggered when a pane is maximized.
fr: Déclenché lorsqu'un volet est maximisé.

source: Triggered when a pane is restored.
fr: Déclenché lorsqu'un volet est restauré.

source: Triggered when a pane is made 'active'. This event is new since wxWidgets 2.9.4.
fr: Déclenché lorsqu'un volet est rendu « actif ». Cet événement est nouveau depuis 'wxWidgets 2.9.4'.

source: This event can be caught to override the default renderer in order to custom draw your wxAuiManager window (not recommended).
fr: Cet événement peut être capturé pour remplacer le moteur de rendu par défaut afin de personnaliser le dessin de votre fenêtre' wxAuiManager' (ce qui n'est pas recommandé).

source: A page is about to be closed
fr: Une page va être fermée

source: A page has been closed
fr: Une page a été fermée

source: The page selection was changed
fr: La sélection de la page a été modifiée

source: The page selection is about to be changed. This event can be vetoed
fr: La sélection de la page est sur le point d'être modifiée. Cet événement peut faire l'objet d'un veto

source: The window list button has been pressed
fr: Le bouton de la liste des fenêtres a été enfoncé

source: Dragging is about to begin
fr: Le glissement est sur le point de commencer

source: Dragging has ended
fr: Le glissement est terminé

source: Emitted during a drag and drop operation
fr: Émis lors d'une opération de glisser-déposer

source: Whether to allow a tab to be dropped. This event must be specially allowed
fr: Autorise ou non l'abandon d'un onglet. Cet événement doit être spécialement autorisé

source: Notify that the tab has been dragged
fr: Notifier que l'onglet a été déplacé

source: Double clicked on the tabs background area
fr: Double clic sur la zone d'arrière-plan des onglets

source: The middle mouse button is pressed on a tab
fr: Le bouton central de la souris est enfoncé sur un onglet

source: The middle mouse button is released on a tab
fr: Le bouton du milieu de la souris est relâché sur un onglet

source: The right mouse button is pressed on a tab
fr: Le bouton droit de la souris est enfoncé sur un onglet

source: The right mouse button is released on a tab
fr: Le bouton droit de la souris est relâché sur un onglet

source: Caption Visible
fr: Titre visible

source: Resizable
fr: Redimensionnable

source: ToolBar Pane
fr: Panneau de la barre d'outils

source: Docking
fr: Amarrage

source: Layer
fr: Couche

source: Row
fr: Rangée

source: Best Size
fr: La meilleure taille

source: Min Size
fr: Taille minimale

source: Max Size
fr: Taille maximale

source: Buttons
fr: Boutons

source: Close Button
fr: Bouton Fermer

source: Minimize Button
fr: Bouton de réduction

source: Maximize Button
fr: Bouton d'agrandissement

source: Pin Button
fr: Bouton épinglé

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, when the button is clicked.
fr: Traite un événement 'wxEVT_COMMAND_BUTTON_CLICKED', lorsque le bouton est cliqué.

source: Load and play animation on creation
fr: Chargement et lecture de l'animation lors de la création

source: Select the animation file
fr: Sélectionner le fichier d'animation

source: Sets the bitmap to show on the control when it's not playing an animation
fr: Définit l'image bitmap à afficher sur le contrôle lorsqu'il ne joue pas d'animation

source: ComboBox drop down choices
fr: Choix de la boîte déroulante

source: The zero-based position of any initially selected string, or -1 if none are to be selected
fr: La position zéro de toute chaîne initialement sélectionnée, ou -1 si aucune chaîne ne doit être sélectionnée

source: The comboBox initial value
fr: Valeur initiale de la boîte déroulante

source: Process a wxEVT_COMMAND_COMBOBOX_SELECTED event, when an item on the list is selected. Note that calling GetValue returns the new value of selection.
fr: Traite un événement 'wxEVT_COMMAND_COMBOBOX_SELECTED', lorsqu'un élément de la liste est sélectionné. Notez que l'appel à 'GetValue' renvoie la nouvelle valeur de la sélection.

source: Process a wxEVT_COMMAND_TEXT_UPDATED event, when the comboBox text changes.
fr: Traite un événement 'wxEVT_COMMAND_TEXT_UPDATED' lorsque le texte de la boite déroulante est modifié.

source: Process a wxEVT_COMMAND_TEXT_ENTER event, when <RETURN> is pressed in the comboBox.
fr: Traite un événement 'wxEVT_COMMAND_TEXT_ENTER', lorsque <RETURN> est pressé dans la boîte déroulante.

source: Process a wxEVT_LISTBOX event, when an item on the list is selected
fr: Traite un événement 'wxEVT_LISTBOX', lorsqu'un élément de la liste est sélectionné

source: Process a wxEVT_LISTBOX_DCLICK event, when the listbox is double-clicked
fr: Traitement d'un événement 'wxEVT_LISTBOX_DCLICK', lorsque la boîte à liste est double-cliquée

source: A wxHtmlCell was clicked. See wxHtmlCellEvent
fr: Une cellule 'wxHtmlCell' a été cliquée. Voir 'wxHtmlCellEvent'

source: The mouse passed over a wxHtmlCell. See wxHtmlCellEvent
fr: La souris est passée au-dessus d'une cellule 'wxHtmlCell'. Voir 'wxHtmlCellEvent'

source: A wxHtmlCell which contains an hyperlink was clicked. See wxHtmlLinkEvent
fr: Une cellule 'wxHtmlCell' contenant un lien hypertexte a été cliquée. Voir 'wxHtmlLinkEvent'

source: The List Box Items. A semi-colon list of strings. This list may contain HTML fragments
fr: Les éléments de la boîte de liste. Une liste de chaînes de caractères avec un point-virgule. Cette liste peut contenir des fragments 'HTML'

source: This event fires when the user changes the current selection in the control
fr: Cet événement se déclenche lorsque l'utilisateur modifie la sélection en cours dans le contrôle

source: The Title Title is rendered in bold and should be single line
fr: Le titre Le titre est rendu en gras et doit être d'une seule ligne

source: Message can have multiple lines but is not wrapped automatically include explicit line breaks in the string if you want to have multiple lines
fr: Le message peut comporter plusieurs lignes, mais il n'est pas enveloppé automatiquement. inclure des sauts de ligne explicites dans la chaîne si vous voulez avoir plusieurs lignes

source: The banner orientation changes how the text in it is displayed and also defines where is the bitmap truncated if it's too big to fit but doesn't do anything for the banner position, this is supposed to be taken care of in the usual way, e.g. using sizers
fr: L'orientation de la bannière modifie l'affichage du texte qu'elle contient et définit également l'endroit où l'image bitmap est tronquée si elle est trop grande pour tenir dans la page mais ne fait rien pour la position de la bannière, qui doit être prise en charge de la manière habituelle, par exemple en utilisant des calibreurs

source: Select the bitmap file Important: You can set text and title OR a bitmap, but not both
fr: Sélectionnez le fichier image Important : vous pouvez définir le texte et le titre OU une image bitmap, mais pas les deux.

source: Select the bitmap file
fr: Sélectionner le fichier image

source: Make this button the default button
fr: Faire de ce bouton le bouton par défaut

source: A unique name for the bitmap (across your project) This name can be used later to load the bitmap from the generated class by simply calling: wxBitmap bmp = myimglist.Bitmap("my-bitmap-name")
fr: Un nom unique pour l'image bitmap (dans l'ensemble de votre projet) Ce nom peut être utilisé ultérieurement pour charger l'image bitmap à partir de la classe générée en appelant simplement : 'wxBitmap bmp = myimglist.Bitmap'(« mon-nom-de-bitmap »)

source: The bitmap
fr: L'image

source: The button initial state
fr: L'état initial du bouton

source: Handles a toggle button click event.
fr: Gère l'événement de clic sur un bouton de basculement.

source: My Button
fr: Mon bouton

source: The button label
fr: L'état initial du bouton

source: Select the bitmap file (wx2.9.X and later)
fr: Sélectionner le fichier image ('wx2.9.X' et ultérieur)

source: The position of the bitmap inside the button. By default it is positioned to the left of the text, near to the left button border.
fr: Position de l'image à l'intérieur du bouton. Par défaut, elle est positionnée à gauche du texte, près de la bordure gauche du bouton.

source: Sets x/y margins between the bitmap and the button label (wx2.9.X and later)
fr: Définit les marges x/y entre l'image bitmap et l'étiquette du bouton ('wx2.9.X' et ultérieur)

source: A day was double clicked in the calendar.
fr: Un jour a été doublement cliqué dans le calendrier.

source: The selected day changed.
fr: Le jour choisi a changé.

source: The selected month changed.
fr: Le mois choisi a changé.

source: The selected date changed.
fr: La date choisie a changé.

source: User clicked on the week day header
fr: L'utilisateur a cliqué sur l'en-tête du jour de la semaine

source: The selected year changed.
fr: L'année choisie a changé.

source: My CheckBox
fr: Ma case à cocher

source: The Checkbox label
fr: Le libellé de la case à cocher

source: Process a wxEVT_COMMAND_CHECKBOX_CLICKED event, when the checkbox is clicked.
fr: Traite un événement 'wxEVT_COMMAND_CHECKBOX_CLICKED', lorsque la case à cocher est cliquée.

source: Process a wxEVT_COMMAND_LISTBOX_SELECTED event when an item on the list is selected or the selection changes.
fr: Traite un événement 'wxEVT_COMMAND_LISTBOX_SELECTED' lorsqu'un élément de la liste est sélectionné ou que la sélection change.

source: Process a wxEVT_COMMAND_LISTBOX_DOUBLECLICKED event when the listbox is double-clicked.
fr: Traite un événement 'wxEVT_COMMAND_LISTBOX_DOUBLECLICKED' lorsque la boîte à liste est double-cliquée.

source: Process a wxEVT_COMMAND_CHECKLISTBOX_TOGGLED event when an item in the check list box is checked or unchecked.
fr: Traite un événement 'wxEVT_COMMAND_CHECKLISTBOX_TOGGLED' lorsqu'un élément de la liste de contrôle est coché ou décoché.

source: The List Box Items. A semi-colon list of strings
fr: Les éléments de la boîte de liste. Une liste de chaînes de caractères avec un point-virgule

source: The page selection is about to be changed. This event can be vetoed
fr: La sélection de la page est sur le point d'être modifiée. Cet événement peut faire l'objet d'un veto

source: The Choice drop down options. A semi-colon list of strings
fr: Les options du menu déroulant. Une liste de chaînes de caractères avec un point-virgule

source: Selected string index
fr: Index de la chaîne sélectionnée

source: Process a wxEVT_COMMAND_CHOICE_SELECTED event, when an item on the list is selected.
fr: Traite un événement 'wxEVT_COMMAND_CHOICE_SELECTED' lorsqu'un élément de la liste est sélectionné.

source: The user expanded or collapsed the collapsible pane
fr: L'utilisateur a élargi ou réduit le volet rétractable

source: Process a navigation key event
fr: Traitement d'un événement lié à une touche de navigation

source: The label
fr: L'intitulé

source: Set the state of the collapsible pane
fr: Définir l'état du volet rétractable

source: The user changed the colour selected in the control either using the button or using text control (see wxCLRP_USE_TEXTCTRL; note that in this case the event is fired only if the user's input is valid, i.e. recognizable).
fr: L'utilisateur a modifié la couleur sélectionnée dans le contrôle, soit en utilisant le bouton, soit en utilisant le contrôle de texte (voir 'wxCLRP_USE_TEXTCTRL' ; notez que dans ce cas, l'événement n'est déclenché que si la saisie de l'utilisateur est valide, c'est-à-dire reconnaissable).

source: Sets a hint shown in an empty unfocused text control
fr: Définit un indice affiché dans un contrôle de texte vide non focalisé

source: Control Specific Settings
fr: Réglages spécifiques au contrôle

source: First line of text on the button, typically the label of an action that will be made when the button is pressed
fr: Première ligne de texte sur le bouton, généralement le libellé d'une action qui sera effectuée lorsque le bouton est enfoncé

source: Second line of text describing the action performed when the button is pressed
fr: Deuxième ligne de texte décrivant l'action exécutée lorsque le bouton est enfoncé

source: wxDataViewListCtrl Column
fr: - Colonne de 'wxDataViewListCtrl'
