Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Select executable to debug
fr: Choisir l'exécutable à déboguer

source: Optionally, enter the path where the program that you want to debug can be found
fr: Si vous le souhaitez, vous pouvez indiquer le chemin d'accès au programme que vous souhaitez déboguer.

source: Browse for working directory
fr: Recherche du répertoire de travail

source: Startup commands:
fr: Commandes de démarrage :

source: SSH Account:
fr: Compte 'SSH' :

source: Select debugger executable on the remote machine
fr: Sélectionner l'exécutable du débogueur sur la machine distante

source: Executable to debug on the remote machine
fr: Exécutable à déboguer sur la machine distante

source: Quick Debug
fr: Débogage rapide

source: Choose debugger:
fr: Choisir le débogueur :

source: Select gdb
fr: Choisir 'gdb'

source: Select working directory
fr: Sélectionner le répertoire de travail

source: Case Sensitive
fr: Sensible à la casse

source: Whole word
fr: Mot complet

source: In Selection
fr: Dans la sélection

source: No matches found
fr: Aucune correspondance trouvée

source: Selected %lu matches
fr: Correspondances sélectionnées : %lu

source: result
fr: résultat

source: Found
fr: Trouvé

source: Made %d replacements
fr: A effectué %d remplacements

source: Reached the start of the document
fr: Atteinte du début du document

source: Reached the end of the document
fr: Fin du document atteinte

source: Wrapped past end of file
fr: Dépassant la fin du fichier

source: Find Prev
fr: Trouver Précédent

source: Find All
fr: Trouver tout

source: Replace All
fr: Tout Remplacer

source: Use case sensitive match
fr: Utiliser une correspondance sensible à la casse

source: Regular Expression
fr: Expression régulière

source: Use regular expression
fr: Utiliser des expressions régulières

source: Match a whole word
fr: Faire correspondre un mot entier

source: Match a whole word only
fr: Appairer avec un mot entier uniquement

source: Use wildcard syntax
fr: Utiliser la syntaxe des jokers

source: Use wildcard syntax (* and ?)
fr: Utiliser la syntaxe des jokers (* et ?)

source: Enable multiple selections
fr: Permettre des sélections multiples

source: Select each match without de-selectiing the previous match
fr: Sélectionner chaque match sans dé-sélectionner le match précédent

source: Searching for files...
fr: Recherche de fichiers...

source: No new or stale files found. The project is up-to-date
fr: Aucun fichier nouveau ou périmé n'a été trouvé. Le projet est à jour

source: Delete the %i selected files from the filesystem?
fr: Supprimer les %i fichiers sélectionnés du système de fichiers ?

source: Delete the selected file from the filesystem?
fr: Supprimer le fichier sélectionné du système de fichiers ?

source: %i file(s) successfully deleted
fr: %i fichier(s) supprimé(s) avec succès

source: Virtual Directory
fr: Répertoire virtuel

source: Select a directory to ignore:
fr: Choisissez un répertoire à ignorer :

source: Enter the filename to ignore e.g. foo*.cpp
fr: Saisir le nom du fichier à ignorer, par exemple 'foo*.cpp'

source: New Files
fr: Nouveaux fichiers

source: Select files from the left pane and add them to the project by clicking on the right arrow button
fr: Sélectionnez les fichiers dans le volet gauche et ajoutez-les au projet en cliquant sur le bouton de la flèche droite

source: These files have not yet been assigned a Virtual Directory. You can do this yourself by selecting one or more files and clicking the 'Forward' arrow button. A Virtual Directory selector will then appear. After your choice the selection(s) will be moved to the right-hand pane. Alternatively click the 'Wizard' button for best-guess auto-allocation.
fr: Ces fichiers n'ont pas encore été affectés à un répertoire virtuel. Vous pouvez le faire vous-même en sélectionnant un ou plusieurs fichiers et en cliquant sur la flèche « Forward ». Un sélecteur de répertoire virtuel apparaît alors. Une fois votre choix effectué, la ou les sélections seront déplacées vers le volet de droite. Vous pouvez également cliquer sur le bouton « Assistant » pour une attribution automatique optimale.

source: Unassigned files:
fr: Fichiers non attribués :

source: Add selected files
fr: Ajouter les fichiers sélectionnés

source: Remove selected files
fr: Supprimer les fichiers sélectionnés

source: Wherever possible, automatically allocate files to the appropriate virtual directory
fr: Dans la mesure du possible, les fichiers sont automatiquement attribués au répertoire virtuel approprié

source: Each file here has been assigned a Virtual Directory. If you're happy with the choice, select the file and click 'Apply'. Otherwise select the file and use the 'back' button to return it to the Unassigned Files section.
fr: Un répertoire virtuel a été attribué à chaque fichier ici. Si vous êtes satisfait de votre choix, sélectionnez le fichier et cliquez sur « Appliquer ». Sinon, sélectionnez le fichier et utilisez le bouton « retour » pour le renvoyer à la section Fichiers non attribués.

source: Assigned files:
fr: Fichiers attribués :

source: Virtual Folder
fr: Dossier virtuel

source: &Apply
fr: &Appliquer

source: A&pply All
fr: &Tout appliquer

source: Stale Files
fr: Fichiers périmés

source: The list below contains files that exist in the project but not on the file system
fr: La liste ci-dessous contient des fichiers qui existent dans le projet mais pas dans le système de fichiers

source: The files listed below are contained in the project, but no longer exist in reality. You can select individual items and delete them from the project, or use the Delete All button.
fr: Les fichiers énumérés ci-dessous sont contenus dans le projet, mais n'existent plus dans la réalité. Vous pouvez sélectionner des éléments individuels et les supprimer du projet, ou utiliser le bouton Supprimer tout.

source: File path
fr: Chemin de fichier

source: Look for files starting with this directory:
fr: Recherchez les fichiers commençant par ce répertoire :

source: Extensions to consider when looking for missing files:
fr: Extensions à prendre en compte lors de la recherche de fichiers manquants :

source: A semi-colon separated list of extensions e.g. cpp;h;xrc If you really want to find all possible files, just add *
fr: Une liste d'extensions séparées par des points-virgules, par exemple cpp;h;xrc Si vous voulez vraiment trouver tous les fichiers possibles, ajoutez simplement *

source: Files to ignore:
fr: Fichiers à ignorer :

source: Here you can add the names of any files that you want to ignore. Standard wildcards will work e.g. moc_*
fr: Vous pouvez ajouter ici les noms des fichiers que vous souhaitez ignorer. Les caractères génériques standard fonctionneront, par exemple -moc_*(

source: Paths to ignore:
fr: Chemins à ignorer :

source: The filepaths of any folders that shouldn't be searched for missing files
fr: Les chemins d'accès aux dossiers qui ne doivent pas être recherchés pour les fichiers manquants

source: Regexs to use (optional):
fr: Les expressions rationnelles à utiliser (facultatif) :

source: Most of the time you should find that files automatically get added to the most appropriate virtual directory. If yours don't, here you can add one or more regular expressions suitable for your situation. They'll be remembered for this project.
fr: La plupart du temps, vous devriez constater que les fichiers sont automatiquement ajoutés au répertoire virtuel le plus approprié. Si ce n'est pas le cas, vous pouvez ajouter ici une ou plusieurs expressions régulières adaptées à votre situation. Elles seront mémorisées pour ce projet.

source: Enter the regex:
fr: Saisir l'expression rationnelle :

source: Destination Virtual Directory:
fr: Répertoire virtuel de destination :

source: Select the virtual folder in which to place the matching files
fr: Sélectionnez le dossier virtuel dans lequel placer les fichiers correspondants

source: Browse for virtual folder
fr: Rechercher un dossier virtuel

source: Reconcile Project
fr: Rapprocher le projet

source: Select filetypes to reconcile
fr: Sélectionner les types de fichiers à rapprocher

source: Allocate by regex
fr: Allocation par expression rationnelles

source: New Symbol Name:
fr: Nouveau nom de symbole :

source: Location
fr: Lieu

source: &Check All
fr: &Vérifier tout

source: Select Projects
fr: Choisir les projets

source: Select the 'rename symbol' project scope
fr: Sélectionnez le champ d'application du projet « renommer un symbole »

source: Rename Symbol
fr: Renommer le symbole

source: Rename Symbol Scope
fr: Renommer un symbole de 'Scope'

source: Invalid C/C++ symbol name
fr: Nom de symbole 'C/C++' invalide

source: &Unmark All
fr: &Tout démarquer

source: Mark &All
fr: Marquer &Tout

source: CodeLite - Replace
fr: 'CodeLite' - Remplacer

source: Failed to save file:
fr: Échec de l'enregistrement du fichier :

source: Failed to open file:
fr: Échec à l'ouverture du fichier :

source: Type to filter the options
fr: Type de filtre pour les options

source: Function name starts with an upper case letter
fr: Le nom de la fonction commence par une lettre majuscule

source: Format the file when done
fr: Formatage du fichier une fois terminé

source: Setter returns a reference to the object
fr: La méthode d'écriture renvoie une référence à l'objet

source: A setter function will return a reference to the object, for example: Foo& SetFoo(const Obj& foo) {this->m_foo = foo; return *this;}
fr: Une fonction d'écriture renvoie une référence à l'objet, par exemple : 'Foo& SetFoo(const Obj& foo) {this->m_foo = foo ; return *this;}'

source: Generate Setters/Getters for class
fr: Générer des méthodes d'accès pour la classe

source: Send:
fr: Envoyer :

source: Send
fr: Envoyer

source: Enable Log
fr: Activer le journal

source: Expression to watch:
fr: Expression à suivre :

source: New watch
fr: Nouvelle surveillance

source: Update Watch
fr: Mise à jour de la surveillance

source: Update expression:
fr: Mise à jour de l'expression :

source: Symbol
fr: Symbole

source: Kind
fr: Type

source: Resolve Ambiguity
fr: Résoudre les ambiguïtés

source: CodeLite appearance:
fr: Apparence 'CodeLite' :

source: System default
fr: Système par défaut

source: Force dark
fr: Imposer sombre

source: Text selection
fr: Sélection de texte

source: Background:
fr: Arrière-plan :

source: Foreground:
fr: Avant plan :

source: Syntax Highlight
fr: Syntaxe en surbrillance

source: Global font:
fr: Police globale :

source: Set a global font for all the supported languages
fr: Définir une police globale pour toutes les langages pris en charge

source: Text theme:
fr: Thème du texte :

source: Set a global theme for all the supported languages. If the theme is not available for a given language, CodeLite will use the next available theme from the same family
fr: Définir un thème global pour toutes les langues supportées. Si le thème n'est pas disponible pour un langage donnée, 'CodeLite' utilisera le prochain thème disponible de la de la même famille

source: Customise colours per language
fr: Personnalisation des couleurs en fonction du langage

source: Available Themes:
fr: Thèmes disponibles :

source: Global Font:
fr: Police globale :

source: Use this to select a font to be used by *all* styles of this lexer
fr: Cette option permet de sélectionner une police qui sera utilisée par *tous* les styles de ce lexique

source: Global background Colour:
fr: Couleur de fond globale :

source: Use this to select a background colour to be used by *all* styles of this lexer
fr: Permet de sélectionner une couleur d'arrière-plan qui sera utilisée par *tous* les styles de ce lexique

source: File Extensions:
fr: Extensions de fichiers :

source: Associate this lexer with files which have these extensions
fr: Associer ce lexique aux fichiers ayant les extensions suivantes

source: Style Font:
fr: Style Police :

source: Select a font to be used with the selected style
fr: Sélectionner une police à utiliser avec le style sélectionné

source: Foreground Colour:
fr: Couleur de premier plan :

source: Select the foreground colour for the selected style
fr: Sélectionner la couleur de premier plan pour le style sélectionné

source: Background Colour:
fr: Couleur de fond :

source: Select the background colour for the selected style
fr: Sélectionner la couleur d'arrière-plan pour le style sélectionné

source: Style is EOL Filled
fr: Le style est rempli par 'EOL'

source: If a line ends with a character/word which has this style, the remaining of the line will be coloured with this style background colour
fr: Si une ligne se termine par un caractère/mot ayant ce style, le reste de la ligne sera coloré avec la couleur d'arrière-plan de ce style

source: Styling Within Pre-processor Line
fr: Style à l'intérieur d'une ligne du préprocesseur

source: Edit Lexer Keyword Sets:
fr: Modifier les ensembles de mots-clés du lexique :

source: Set &0
fr: Jeu &0

source: Set &1
fr: Jeu &1

source: Set &2
fr: Jeu &2

source: Set &3
fr: Jeu &3

source: Set &4
fr: Jeu &4

source: Theme Name:
fr: Nom du thème :

source: Set the theme name
fr: Définir le nom du thème

source: Make this theme for this language
fr: Créer ce thème pour ce langage

source: Based on Theme:
fr: Basé sur le thème :

source: Set the base theme for this new theme
fr: Définir le thème de base de ce nouveau thème

source: Colours and Fonts
fr: Couleurs et polices

source: New Theme
fr: Nouveau thème

source: New..
fr: Nouveau.

source: Export..
fr: Exporter.

source: Export All
fr: Tout exporter

source: Import from ZIP file
fr: Importation à partir d'un fichier 'ZIP'

source: Import
fr: Importer

source: Applying changes...
fr: Appliquer les changements ...

source: Export Themes
fr: Export de thèmes

source: Select which themes to export:
fr: Choisir les thèmes à exporter :

source: Are you sure you want to restore colours to factory defaults? By choosing 'Yes', you will lose all your local modifications
fr: Êtes-vous sûr de vouloir rétablir les couleurs par défaut ? En choisissant « Oui », vous perdrez toutes vos modifications locales

source: Select theme to import
fr: Choisir le thème à importer

source: Invalid file
fr: Fichier non valide

source: Failed to import theme file:
fr: Échec de l'importation du fichier de thème :

source: ' imported successfully!
fr: ' importé avec succès !

source: Theme : '
fr: Thème : '

source: Save as
fr: Sauvegarder sous

source: Settings have been saved into:
fr: Les paramètres ont été enregistrés dans :

source: Select a tab group, or browse for one
fr: Sélectionnez un groupe d'onglets ou recherchez-en un

source: Click to search for other groups
fr: Cliquez pour rechercher d'autres groupes

source: Double-click to choose one of these groups
fr: Double-cliquez pour choisir l'un de ces groupes

source: Replace current tabs
fr: Remplacer les onglets actuels

source: By default, the tabs of this group will be added to the current tabs. Tick this to replace the current tabs instead.
fr: Par défaut, les onglets de ce groupe seront ajoutés aux onglets actuels. Cochez cette case pour remplacer les onglets actuels.

source: Select which tabs you want to be in the group
fr: Sélectionnez les onglets que vous souhaitez voir figurer dans le groupe

source: Check All
fr: Tout vérifier

source: Click to select all items
fr: Cliquer pour sélectionner tous les éléments

source: Click to clear all items
fr: Cliquez pour effacer tous les éléments

source: Choose a name for the group:
fr: Choisir un nom pour le groupe :

source: Save in the current Workspace, or Globally
fr: Sauvegarder dans l'espace de travail actuel ou globalement

source: Tabgroups are usually specific to a single workspace. However if you want to use one in multiple workspaces, or when a workspace is not open, save it globally.
fr: Les groupes d'onglets sont généralement spécifiques à un seul espace de travail. Toutefois, si vous souhaitez en utiliser un dans plusieurs espaces de travail, ou lorsqu'un espace de travail n'est pas ouvert, enregistrez-le globalement.

source: Load a tab group
fr: Charger un groupe d'onglets

source: Save a tab group
fr: Sauvegarde d'un groupe d'onglets

source: Select a tab group:
fr: Sélectionnez un groupe d'onglets :

source: Tab groups
fr: Groupes d'onglets

source: I'm afraid that tabgroup no longer exists :/
fr: Je crains que ce groupe d'onglet n'existe plus :/

source: Do you want to replace the existing editors? (Say 'No' to load the new ones alongside)
fr: Voulez-vous remplacer les éditeurs existants ? (Dites « Non » pour charger les nouveaux éditeurs à côté)

source: Load the tabgroup
fr: Charger le groupe d'onglets

source: I'm afraid that tabgroup item no longer exists :/
fr: Je crains que cet élément du groupe d'onglet n'existe plus :/

source: &Add a new item to this tabgroup
fr: &Ajouter un nouvel élément à ce groupe d'onglets

source: &Paste an item into this tabgroup
fr: &Coller un élément dans ce groupe d'onglets

source: Du&plicate this tabgroup
fr: Du&pliquer ce groupe d'onglet

source: &Delete this tabgroup
fr: &Supprimer ce groupe d'onglets

source: &Copy this item, to be pasted to another tabgroup
fr: &Copier cet élément pour le coller dans un autre groupe d'onglets

source: Cu&t this item, to be pasted to another tabgroup
fr: Co&uper cet élément, à coller dans un autre groupe d'onglets

source: &Remove this item from the tabgroup
fr: &Supprimer cet élément du groupe d'onglets

source: There is already a file with this name. Overwrite it?
fr: Il existe déjà un fichier portant ce nom. L'écraser ?

source: Overwrite?
fr: Écraser ?

source: Tabgroup renamed
fr: Groupe d'onglets renommé

source: Select the file you want to add
fr: Sélectionnez le fichier que vous souhaitez ajouter

source: That filepath doesn't seem to exist. Are you sure?
fr: Ce chemin de fichier ne semble pas exister. En êtes-vous sûr ?

source: Failed to load the destination tabgroup :/
fr: Échec du chargement du groupe d'onglets de destination :/

source: There is already an item with this filepath in the tabgroup. Overwrite it?
fr: Il y a déjà un élément avec ce chemin d'accès dans le groupe d'onglets. L'écraser ?

source: Tabgroup item pasted
fr: Élément du groupe d'onglets collé

source: Delete tabgroup %s?
fr: Supprimer le groupe d'onglets %s ?

source: Tabgroup deleted
fr: Groupe d'onglets supprimé

source: What name to you want to give the duplicated tabgroup?
fr: Quel nom voulez-vous donner au groupe d'onglets dupliqué ?

source: Duplicate a tabgroup
fr: Dupliquer un groupe d'onglets

source: Sorry, there is already a tabgroup with this name
fr: Désolé, il existe déjà un groupe d'onglets portant ce nom

source: Sorry, duplication of the tabgroup failed :/
fr: Désolé, la duplication du groupe d'onglet a échoué :/

source: Tabgroup duplicated
fr: Groupe d'onglets dupliqué

source: Tabgroup item copied
fr: Copie d'un élément du groupe d'onglets

source: Remove item %s from %s?
fr: Supprimer l'élément %s de %s ?

source: Tabgroup item Cut
fr: Couper l'élément du groupe d'onglets

source: Tabgroup item deleted
fr: Suppression d'un élément d'un groupe d'onglets

source: Failed to amend the tabgroup :/
fr: Échec de la modification du groupe d'onglets :/

source: Global tabgroups
fr: Groupes d'onglets généraux

source: Workspace tabgroups
fr: Groupes d'onglets de l'espace de travail

source: Number of items to display in the completion box:
fr: Nombre d'éléments à afficher dans la boîte de saisie :

source: Display type info tooltips
fr: Afficher les info-bulles de type

source: Display information about the hovered text
fr: Afficher des informations sur le texte survolé

source: Display function calltip
fr: Fonction d'affichage des info-bulles

source: Display function argument list after typing an open brace '('
fr: Afficher la liste des arguments d'une fonction après avoir saisi une accolade ouverte '('

source: BACKSPACE triggers code completion
fr: 'BACKSPACE' déclenche l'achèvement du code

source: Deleting character will cause CodeLite to re-trigger the code completion
fr: L'effacement d'un caractère entraînera le ré-déclenchement de l'achèvement du code par 'CodeLite'

source: Generate compile_commands.json file
fr: Générer le fichier 'compile_commands.json'

source: Triggering
fr: Déclenchement

source: Minimum chars to type:
fr: Nombre minimum de caractères à saisir :

source: The minimum number of characters to type in order for CodeLite to trigger code completion
fr: Le nombre minimum de caractères à taper pour que 'CodeLite' déclenche l'achèvement du code

source: Number of chars to type before showing the code completion box
fr: Nombre de caractères à taper avant d'afficher la boîte d'achèvement du code

source: Auto insert single match
fr: Insertion automatique d'un seul appairage

source: When there is only a single match don't show the code completion box but rather insert the match
fr: Lorsqu'il n'y a qu'une seule correspondance, n'affichez pas la boîte l'achèvement du code, mais insérez la correspondance

source: Code Completion
fr: Achèvement du code

source: The following include paths were detected on your system and will be added to your parser search path. You may remove a path by unchecking it. You can always add/remove paths to the parser from the main menu: Settings > Tags Settings > Parser
fr: Les chemins d'inclusion suivants ont été détectés sur votre système et seront ajoutés au chemin de recherche de votre analyseur. Vous pouvez supprimer un chemin en le décochant. Vous pouvez toujours ajouter/supprimer des chemins d'accès à l'analyseur à partir du menu principal : Paramètres > Balises Paramètres > Analyseur

source: Add Search Paths to Code Completion Parser
fr: Ajouter des chemins de recherche à l'analyseur dl'achèvement du code

source: Parsing workspace...
fr: Analyse de l'espace de travail...

source: Tabgroups
fr: Groupes d'onglets

source: Parsing workspace: %d%% completed
fr: Analyse de l'espace de travail : %d%% terminée

source: Environment sets:
fr: Jeux d'environnement :

source: By default, CodeLite uses the current active environment variables set as defined in the Settings > Environment Variables dialog. However, you may choose a different set to become the active set when this workspace is loaded selecting it here.
fr: Par défaut, 'CodeLite' utilise les variables d'environnement actives définies dans la boîte de dialogue Paramètres > Variables d'environnement. dans la boîte de dialogue Paramètres > Variables d'environnement. Cependant, vous pouvez choisir un pour qu'il devienne le jeu actif lors du chargement de cet espace de travail en le sélectionnant ici.

source: Add here macros to pass to clang when generating PCH files One macro per line
fr: Ajouter ici des macros à passer à 'clang' lors de la génération de fichiers 'PCH' Une macro par ligne

source: Sync to Workspace File
fr: Synchronisation avec le fichier de l'espace de travail

source: When enabled search paths folders for Code Completion will be synced between the Workspace file and the local search paths database.
fr: Lorsque cette option est activée, les dossiers de chemins de recherche pour l'achèvement du code sont synchronisés entre le fichier de l'espace de travail et la base de données locale des chemins de recherche.

source: Workspace Settings
fr: Paramètres de l'espace de travail

source: <Use Active Set>
fr: <Utiliser le jeu actif>

source: Link Editor
fr: Éditeur de liens

source: Collapse All
fr: Tout réduire

source: Goto Active Project
fr: Aller au projet actif

source: Open selected project settings. If there is no project selected, open the parent project of the selected item in the tree
fr: Ouvrir les paramètres du projet sélectionné. Si aucun projet n'est sélectionné, ouvrir le projet parent de l'élément sélectionné dans l'arborescence

source: Unpin Project
fr: Dés-épingler le projet
