Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Text Viewer
fr: Visualisateur de texte

source: Press any key to continue...
fr: Appuyez sur n'importe quelle touche pour continuer...

source: Failed to execute command:
fr: Échec de l'exécution de la commande :

source: Working directory
fr: Répertoire de travail

source: Project kind:
fr: Type de projet :

source: QMake to use:
fr: Utiliser 'QMake' :

source: Open the QMakeSettings configuration dialog
fr: Ouvrir la boîte de dialogue de configuration 'QMakeSettings'

source: Other settings:
fr: Autres paramètres :

source: New Qmake project
fr: Nouveau projet 'Qmake'

source: Qt's QMake integration with CodeLite
fr: Intégration de 'QMake' avec 'CodeLite'

source: Create new qmake based project
fr: Créer un nouveau projet basé sur 'qmake'

source: New qmake based project...
fr: Nouveau projet basé sur 'qmake'...

source: Run qmake...
fr: Lancer 'qmake'...

source: Could not locate pro file. Did you remember to run qmake? (right click on the project)
fr: Impossible de localiser le fichier 'pro'. Avez-vous pensé à lancer 'qmake' ? (clic droit sur le projet)

source: There is no qmake defined, please define one from 'Plugins -> Qmake -> Settings'
fr: Il n'y a pas de 'qmake' défini, veuillez en définir un dans 'Extensions -> Qmake -> Paramètres'.

source: Invalid project path!
fr: Chemin d'accès au projet non valide !

source: Failed to create .project file '%s'
fr: Échec de la création du fichier .project '%s'

source: Add / modify qmake configurations:
fr: Ajouter / modifier des configurations 'qmake' :

source: Create new qmake settings
fr: Créer de nouveaux paramètres 'qmake'

source: qmake executable:
fr: l'exécutable 'qmake' :

source: Set QTDIR to the directory where you've installed Qt
fr: Définissez 'QTDIR' comme étant le répertoire dans lequel vous avez installé 'Qt'

source: QMake Settings
fr: Paramètres de 'QMake'

source: New qmake settings
fr: Nouveaux paramètres de 'qmake'

source: New qmake settings name
fr: Nouveau nom des paramètres de 'qmake'

source: Are you sure you want to delete qmake settings '%s'?
fr: Êtes-vous sûr de vouloir supprimer les paramètres qmake '%s' ?

source: This project uses qmake
fr: Ce projet utilise 'qmake'

source: qmake settings:
fr: les paramètres de 'qmake' :

source: Select the QMake to be used for this build configuration as defined in 'Plugins -> QMake -> Settings'
fr: Sélectionnez le 'QMake' à utiliser pour cette configuration de construction comme défini dans 'Extensions -> Qmake -> Paramètres'.

source: qmake execution line:
fr: ligne d'exécution de 'qmake' :

source: CodeLite will place the below text after the auto generated section (so you may override the generated variables)
fr: 'CodeLite' placera le texte ci-dessous après la section générée automatiquement (vous pouvez donc remplacer les variables générées)

source: Seelct a folder
fr: Choisir un dossier

source: Remote work over SSH
fr: Travail à distance via 'SSH'

source: Remoty plugin
fr: Extension à distance

source: Workspace type:
fr: Type d'espace de travail :

source: Switch to workspace...
fr: Passer à l'espace de travail...

source: New File System Workspace (remote)
fr: Nouvel espace de travail du système de fichiers (à distance)

source: Downloading file:
fr: Téléchargement du fichier :

source: Failed to create new workspace file:
fr: Échec de la création d'un nouveau fichier d'espace de travail :

source: Could not find a matching SSH account to load the workspace!
fr: Impossible de trouver un compte 'SSH' correspondant pour charger l'espace de travail !

source: Failed to download remote workspace file!
fr: Échec du téléchargement du fichier de l'espace de travail distant !

source: Retrying to load workspace...
fr: Tentative de chargement de l'espace de travail...

source: Failed to load workspace file:
fr: Échec du chargement du fichier de l'espace de travail :

source: Invalid empty remote path provided
fr: Chemin d'accès distant vide non valide fourni

source: Could not locate ssh executable in your PATH! Update your PATH from 'settings -> environment variables' to a location that contains your 'ssh' executable
fr: Impossible de localiser l'exécutable ssh dans votre CHEMIN ! Mettez à jour votre CHEMIN à partir de 'settings -> environment variables' vers un emplacement qui contient votre exécutable 'ssh'

source: Failed to start remote terminal process. Do you have `ssh` client installed and in PATH?
fr: Échec du démarrage du processus de terminal distant. Le client `ssh` est-il installé et se trouve-t-il dans le 'PATH' ?

source: Failed to start debugger!
fr: Échec du démarrage du débogueur !

source: Please specify an executable to run
fr: Veuillez spécifier un exécutable à lancer

source: Failed to write remote script on the remote machine!
fr: Échec de l'écriture d'un script distant sur la machine distante !

source: Remote file system scan completed. Found:
fr: L'analyse du système de fichiers distant est terminée. Trouvé :

source: Could not find codelite-remote.json file Would you like to create one?
fr: Impossible de trouver le fichier 'codelite-remote.json' Voulez-vous en créer un ?

source: Failed to create directory:
fr: Échec de la création du répertoire :

source: Failed to create file:
fr: Échec de la création du fichier :

source: Failed to save file:
fr: Échec de l'enregistrement du fichier :

source: successfully saved
fr: sauvegardé avec succès

source: Remote file:
fr: Fichier distant :

source: Workspace settings...
fr: Paramètres de l'espace de travail...

source: Edit codelite-remote.json...
fr: Editer 'codelite-remote.json'...

source: Close workspace
fr: Fermer l'espace de travail

source: saved!
fr: sauvegardé !

source: NOTICE: a workspace reload is required in order for the changes to take place
fr: AVIS : un rechargement de l'espace de travail est nécessaire pour que les modifications soient prises en compte

source: &File
fr: &Fichier

source: &Save changes Ctrl-S
fr: &Enregistrer les changements Ctrl-S

source: &Find Ctrl-F
fr: &Trouver 'Ctrl-F'

source: &Next change Alt-DOWN
fr: Changement &Suivant 'Alt-DOWN'

source: &Previous change Alt-UP
fr: &Modification précédente Alt-UP

source: &Copy active change from Left to Right Alt-RIGHT
fr: &Copie active de gauche à droite 'Alt-RIGHT'

source: &Copy active change from Right to Left Alt-LEFT
fr: &Copie active de la droite vers la gauche 'Alt-LEFT'

source: &Copy entire file from Left to Right Ctrl-Alt-RIGHT
fr: &Copier tout le fichier de gauche à droite Ctrl-Alt-DROITE

source: &Copy entire file from Right to Left Ctrl-Alt-LEFT
fr: &Copier tout le fichier de droite à gauche Ctrl-Alt-GAUCHE

source: &New Empty File
fr: &Nouveau fichier vide

source: New &Workspace
fr: Nouvel &Espace de travail

source: New &Project
fr: Nouveau &Projet

source: &Open
fr: &Ouvrir

source: &Open File...
fr: &Ouvrir le fichier...

source: &Open Folder...
fr: &Ouvrir le dossier...

source: Open &Workspace...
fr: Ouvrir &Espace de travail...

source: &Reload File
fr: &Recharger le fichier

source: Load a group of tabs
fr: Charger un groupe d'onglets

source: &Save File
fr: &Sauvegarder le fichier

source: Save &As...
fr: Enregistrer &sous...

source: Save tabs as group
fr: Enregistrer les onglets en tant que groupe

source: Duplicate Tab...
fr: Dupliquer l'onglet...

source: Page Setup...
fr: Mise en page...

source: Recent &Files
fr: Dossiers &récents

source: Recent &Workspaces
fr: &Espaces de travail récents

source: E&xit
fr: &Quitter

source: &Undo
fr: &Défaire

source: &Redo
fr: &Rétablir

source: Set la&bel for current state
fr: Définir l'étiquette pour l'état &actuel

source: &Cut
fr: &Couper

source: Co&py
fr: Co&pie

source: Past&e
fr: Coll&er

source: Select &All
fr: &Tout sélectionner

source: &Delete Line
fr: &Supprimer la ligne

source: D&uplicate Selection / Line
fr: Sélection des &Doublons / Ligne

source: Delete to Line &End
fr: Supprimer jusqu'à la fin de la ligne

source: Delete to Line &Start
fr: Supprimer jusqu'à la ligne &Début

source: &Transpose Lines
fr: &Transposer les lignes

source: Comment
fr: Commentaire

source: Text Conversion
fr: Conversion de texte

source: Make Upper&case
fr: Rendre majus&cules

source: Make &Lowercase
fr: Rendre minuscu&les

source: Trim T&railing Spaces
fr: Supp&rimer les espaces de fin

source: Highlight selected word
fr: Mettre en surbrillance le mot sélectionné

source: Match &Brace
fr: Appairer le &Support

source: S&elect to Brace
fr: Sél&ectionner pour l'accolade

source: Code Comple&te
fr: Code Comple&t

source: Complete &Word
fr: &Mot complet

source: Display &Function Calltip
fr: &Fonction d'affichage des info-bulles

source: &View
fr: &Visuels

source: Word W&rap
fr: En&cadrage des mots

source: Toggle Current &Fold
fr: Basculer l'actuel & Repli

source: Toggle &All Folds
fr: Basculer &Tous les replis

source: Toggle All To&pmost Folds in Selection
fr: Basculer tous les replis vers le haut et vers le bas dans la sélection

source: Toggle &Every Fold in Selection
fr: Basculer &Tous les replis dans la sélection

source: &Display EOL
fr: &Affichage fin de ligne

source: Show Whitespace
fr: Montrer les espaces

source: &Output Pane
fr: &Volet de sortie

source: Wor&kspace Pane
fr: Volet espace de travail

source: &Navigation Bar
fr: Barre de &Navigation

source: &Debugger Pane
fr: Volet &Débogueur

source: &Toggle All Panes
fr: &Basculer tous les volets

source: Main ToolBar Orientation
fr: Orientation de la barre d'outils principale

source: Top
fr: En haut

source: Bottom
fr: En bas

source: Show Plugins Toolbar
fr: Montrer la barre d'outils des extensions

source: Restore Layout
fr: Rétablir la mise en page

source: &Search
fr: Che&rcher

source: Find and Replace
fr: Rechercher et remplacer

source: Fi&nd...
fr: &Trouver ...

source: &Replace...
fr: &Remplacer...

source: Find &Next
fr: Résultat &suivant

source: Find &Previous
fr: Chercher &précédent

source: &Find In Files...
fr: &Trouver dans les fichiers...

source: Go To
fr: Aller à

source: Go To Pre&vious Location
fr: Aller à l'emplacement &Précédent

source: Go To For&ward Location
fr: Aller à l'emplacement &Suivant

source: &Go To Line...
fr: &Aller à la ligne...

source: Toggle &Bookmark
fr: Basculer les &Signets

source: &Next Bookmark
fr: Signet &Suivant

source: Previo&us Bookmark
fr: Signet &Précédent

source: Remove All &Currently-Active Bookmarks
fr: Supprimer tous les signets &Actuellement actifs

source: Remove &All Bookmarks
fr: Supprimer &Tous les signets

source: Find &Resource...
fr: Trouver des &Ressources...

source: &Quick Outline...
fr: &Aperçu rapide...

source: Find &Symbol
fr: Trouver un &Symbole

source: &Workspace
fr: &Espace de travail

source: &New Workspace...
fr: &Nouvel espace de travail...

source: &Open Workspace...
fr: &Ouvrir l'espace de travail ...

source: &Close Workspace
fr: &Fermer l'espace de travail

source: &Reload Workspace
fr: &Recharger l'espace de travail

source: &Import other IDEs solution/workspace files...
fr: &Importer les fichiers de solution/espace de travail d'autres IDE...

source: &Add an existing project
fr: &Ajouter un projet existant

source: &Open Active Project Settings...
fr: &Ouvrir les paramètres du projet actif...

source: &Select Active Project...
fr: &Sélectionner le projet actif...

source: Reparse the workspace
fr: Scruter l'espace de travail

source: Configuration &Manager...
fr: Gestionnaire de configuration...

source: &Run
fr: &Exécuter

source: &Stop
fr: &Arrêter

source: &Build Project
fr: &Construire un projet

source: &Compile Current File
fr: &Compiler le fichier actuel

source: &Compile Current File's Project
fr: &Compiler le projet du fichier actuel

source: Cl&ean Project
fr: &Nettoyer le projet

source: Sto&p Build
fr: &Arrêter la construction

source: Reb&uild Project
fr: &Régénérer le projet

source: Build and Run Pro&ject
fr: Construire et exécuter un pro&jet

source: Ne&xt Build Error
fr: Prochaine erreur de construction

source: &Debugger
fr: &Débogueur

source: &Start/Continue Debugger
fr: &Démarrer/Continuer le débogueur

source: &Restart Debugger
fr: &Redémarrer le débogueur

source: &Attach to process...
fr: &Attacher au processus...

source: Debug a core d&ump...
fr: Déboguer un vidage de noyau...

source: &Pause debugger
fr: &Pause du débogueur

source: S&top debugger
fr: &Arrêter le débogueur

source: Step &Into
fr: Entrer &dans

source: Step Into &Instruction
fr: Entrer dans l'&Instruction

source: Ne&xt
fr: Suivante

source: Step &Out
fr: Étape et &Sortie

source: Show &Cursor
fr: Montrer &Curseur

source: Toggle &Breakpoint
fr: Basculer &Point d'arrêt

source: Disab&le All Breakpoints
fr: &Désactiver tous les points d'arrêt

source: E&nable All Breakpoints
fr: &Activation de tous les points d'arrêt

source: &Delete All Breakpoints
fr: &Supprimer tous les points d'arrêt

source: &Quick Debug...
fr: &Débogage rapide...

source: GDB Windows
fr: Fenêtres 'GDB'

source: ASCII Viewer
fr: Visualisateur 'ASCII'

source: Disassembly
fr: Désassembler

source: &Plugins
fr: &Extensions

source: &Manage Plugins...
fr: &Gérer les extensions...

source: Settin&gs
fr: Paramè&tres

source: Colours and &Fonts...
fr: Couleurs et &Polices...

source: Keyboard &shortcuts...
fr: Clavier et &raccourcis...

source: En&vironment Variables...
fr: 'CodeLite' placera le texte ci-dessous après la section générée automatiquement (vous pouvez donc remplacer les variables générées)

source: &Build Settings...
fr: Paramètres de &Construction...

source: &GDB Settings...
fr: Paramètres &GDB...

source: &Code Completion...
fr: &Achèvement du code...

source: He&lp
fr: &Aide

source: &Check for updates...
fr: &Vérifier les mises à jour...

source: &Run the Setup Wizard...
fr: &Lancer l'assistant d'installation...

source: &About...
fr: &À propos de ...

source: &Report an issue...
fr: &Signaler un problème...

source: Close Other Tabs
fr: Fermer les autres onglets

source: Close Tabs To The Right
fr: Fermer les onglets à droite

source: Make Read Only
fr: Mettre en lecture seule

source: Copy File Name
fr: Copier le nom du fichier

source: Detach Editor
fr: Détacher l'éditeur

source: Swap Header/Implementation file F12
fr: Échanger le fichier d'en-tête/de mise en œuvre 'F12'

source: Search for selected text in workspace
fr: Recherche du texte sélectionné dans l'espace de travail

source: Search for selected text with default browser
fr: Recherche du texte sélectionné avec le navigateur par défaut

source: Code Generation / Refactoring
fr: Génération de code / Refonte

source: Insert Doxygen Comment Ctrl-Shift-D
fr: Insérer un commentaire 'Doxygen' Ctrl-Shift-D

source: Comment Selection Ctrl-Shift-/
fr: Sélection des commentaires Ctrl-Shift-/

source: Toggle Line Comment Ctrl-/
fr: Changement de ligne de commentaire Ctrl-/

source: Create new workspace...
fr: Créer un nouvel espace de travail...

source: Add a New File...
fr: Ajouter un nouveau fichier...

source: Add an Existing File...
fr: Ajouter un fichier existant...

source: Remove Virtual Folder
fr: Supprimer un dossier virtuel

source: Rename ...
fr: Renommer ...

source: ReBuild Workspace
fr: Reconstruire l'espace de travail

source: Detach
fr: Détacher

source: Hide
fr: Cacher

source: Open in CodeLite
fr: Ouvrir dans 'CodeLite'

source: Open with &Default Application
fr: Ouvrir avec l'application par &Défaut

source: Compile
fr: Compiler

source: Preprocess
fr: Prétraitement

source: Exclude from Build
fr: Exclure de la construction

source: Copy Value Only
fr: Copie de la valeur uniquement

source: Display Format
fr: Afficher le format

source: Natural
fr: Naturel

source: Hexadecimal
fr: Hexadécimal

source: Binary
fr: Binaire

source: Decimal
fr: Décimale

source: Tags
fr: Balises

source: Global Parser Paths
fr: Chemins d'accès à l'analyseur global

source: Add to include paths
fr: Ajouter aux chemins d'accès

source: Add to exclude paths
fr: Ajouter aux chemins d'exclusion

source: Workspace Parser Paths
fr: Chemins d'accès à l'analyseur de l'espace de travail

source: Open in &editor
fr: Ouvrir dans &editeur

source: Open With &Default Application
fr: Ouvrir avec l'application par &Défaut

source: Open Shell here
fr: Ouvrez le 'shell' ici

source: Open File Explorer here
fr: Ouvrez l'explorateur de fichiers ici

source: My Dialog
fr: Mon dialogue

source: My MainFrame
fr: Mon cadre principal

source: GPL v2 or later
fr: 'GPL v2' ou ultérieure

source: Short description goes here
fr: Voici une brève description

source: Exit Alt-X
fr: Quitter 'Alt-X'

source: Quit
fr: Quitter

source: My Frame
fr: Mon cadre

source: Rust plugin for CodeLite IDE
fr: Extension 'Rust' pour l'IDE 'CodeLite'

source: Select the folder to run 'cargo new'
fr: Sélectionnez le dossier dans lequel vous souhaitez exécuter « cargo new

source: Could not locate cargo in your PATH
fr: Impossible de localiser le 'cargo' dans votre chemin système

source: Open account manager...
fr: Ouvrir le gestionnaire de compte...

source: Disconnected. Click to connect
fr: Déconnecté. Cliquer pour se connecter

source: Open Terminal
fr: Ouvrir un terminal

source: Manage bookmarks...
fr: Gérer les signets...

source: Go to:
fr: Aller à :

source: Type a path and hit ENTER
fr: Tapez un chemin d'accès et appuyez sur ENTRÉE

source: SSH Client:
fr: Client 'SSH' :

source: Upload the files to this folder:
fr: Téléchargez les fichiers dans ce dossier :

source: Set the remote folder path
fr: Définir le chemin d'accès au dossier distant

source: Connect to an existing account
fr: Se connecter à un compte existant

source: Choose an account to connect to
fr: Choisir un compte auquel se connecter

source: Quick connect
fr: Connexion rapide

source: Host:
fr: Hôte :

source: User:
fr: Utilisateur :

source: Find What:
fr: Trouver quoi :

source: String to search
fr: Chaîne à rechercher

source: Search In:
fr: Rechercher dans :

source: File types to search e.g: *.txt
fr: Types de fichiers à rechercher par exemple *.txt

source: Ignore case
fr: Ignorer la casse

source: Manage Bookmarks
fr: Gérer les signets

source: SFTP / SSH Settings
fr: Paramètres 'SFTP / SSH'

source: SFTP Upload Files
fr: Téléchargement de fichiers 'SFTP'

source: SFTP Connect
fr: Connexion 'SFTP'

source: Remote Grep
fr: 'Grep' à distance

source: SFTP plugin for codelite IDE
fr: Extension 'SFTP' pour l'IDE Codelite'

source: SFTP Log
fr: Journal 'SFTP'

source: Open SSH Account Manager
fr: Ouvrir le gestionnaire de compte 'SSH'

source: &Setup...
fr: &Installation ...

source: &Disable
fr: &Désactiver

source: Workspace Mirroring
fr: Miroir de l'espace de travail

source: Select the remote workspace
fr: Sélectionner l'espace de travail distant

source: Failed to synchronize file '
fr: Échec de la synchronisation du fichier '

source: Could not locate account:
fr: Impossible de localiser le compte :

source: with remote server
fr: avec un serveur distant

source: Failed to rename file '
fr: Échec du renommage du fichier '

source: ' Could not locate account:
fr: ' Impossible de localiser le compte :

source: Failed to delete remote file '
fr: Échec de la suppression du fichier distant '

source: Failed to delete remote file:
fr: Échec de la suppression du fichier distant :

source: Uploading file:
fr: Téléchargement d'un fichier :

source: Renaming:
fr: Renommage :

source: Renamed
fr: Renommé

source: Deleting:
fr: Suppression :

source: Deleted
fr: Supprimé

source: Connecting to
fr: Connexion à

source: Enable:
fr: Activer :

source: Clear statistics
fr: Effacer les statistiques

source: Clear statistics gathered
fr: Supprimer les statistiques collectées

source: Smart Completions
fr: Achèvements intelligents

source: Make the default Code Completion smarter and better
fr: Rendre l'achèvement du code par défaut plus intelligente et plus performante

source: SmartCompletions
fr: Achèvements intelligents

source: Menu Entry:
fr: Entrée de menu :

source: Keyboard Shortcut:
fr: Raccourci clavier :

source: Use $ as placeholder for the selection and @ to set the caret position. e.g. for($ = 0; $ < @; $++) NOTE: If your snippet contains @ or $, you can escape the placeholders with a backslash: \@ OR \$
fr: Utilisez $ comme caractère de remplacement pour la sélection et @ pour définir la position du curseur. Par exemple, for($ = 0 ; $ < @ ; $++) REMARQUE : Si votre extrait contient @ ou $, vous pouvez échapper aux caractères génériques à l'aide d'une barre oblique inverse : \@ OU \$

source: Change
fr: Changer

source: Edit Snippets
fr: Éditer les extraits

source: Menu entry is not unique!
fr: L'entrée dans le menu n'est pas unique !

source: That accelerator already exists
fr: Cet accélérateur existe déjà

source: A small tool to add expandable code snippets and template classes
fr: Un petit outil pour ajouter des extraits de code extensibles et des classes de modèles

source: Snippet wizard
fr: Assistant d'extrait

source: Template class...
fr: Modèle de classe...

source: New Class from Template...
fr: Nouvelle classe à partir du modèle...

source: Enter identifier name
fr: Saisir le nom de l'identifiant

source: Enter number of cases
fr: Saisir le nombre de cas

source: Paste buffer
fr: Coller le tampon

source: New class from template
fr: Nouvelle classe à partir d'un modèle

source: Class
fr: Classe

source: Class name:
fr: Nom de la classe :

source: Name of new class
fr: Nom de la nouvelle classe

source: Template for new class
fr: Modèle de nouvelle classe

source: Files
fr: Fichiers

source: Header file:
fr: Fichier d'en-tête :

source: Implementation file:
fr: Fichier de mise en œuvre :

source: Name of source file
fr: Nom du fichier source

source: Virtual folder to add new files
fr: Dossier virtuel pour ajouter de nouveaux fichiers

source: Browse virtual folders
fr: Parcourir les dossiers virtuels

source: Hd folder to add new files
fr: Dossier 'Hd' pour ajouter de nouveaux fichiers

source: Browse folders
fr: Consulter les dossiers

source: Implementation File
fr: Fichier de mise en œuvre

source: Template Class Wizard
fr: Assistant de classe de modèles

source: Select output folder
fr: Sélectionner le dossier de sortie

source: Files successfully created.
fr: Fichiers créés avec succès.

source: Add template class
fr: Ajouter un modèle de classe

source: Add class
fr: Ajouter une classe

source: Class exists! Overwrite?
fr: La classe existe ! Écraser ?

source: Change class
fr: Changer de classe

source: That class doesn't exist! Try again?
fr: Cette classe n'existe pas ! Réessayer ?

source: File already exists! Overwrite?
fr: Le fichier existe déjà ! Écraser ?

source: Generate class files
fr: Générer des fichiers de classe

source: Could not find aff file!
fr: Impossible de trouver le fichier 'aff' !

source: Could not find dictionary file!
fr: Impossible de trouver le fichier du dictionnaire !

source: No spelling errors found!
fr: Aucune faute d'orthographe n'a été trouvée !

source: CodeLite spell checker
fr: Vérificateur d'orthographe 'CodeLite'

source: CodeLite spell-checker
fr: Vérificateur d'orthographe 'CodeLite'

source: Check spelling...
fr: Vérifier l'orthographe...

source: Run spell-checker
fr: Lancer le correcteur orthographique

source: Check continuous
fr: Vérifier en continu

source: SpellCheck
fr: Vérification orthographique

source: Ignore
fr: Ignorer

source: Check...
fr: Vérifier...

source: Start continuous check
fr: Démarrer le contrôle continu

source: Dictionary path:
fr: Chemin du dictionnaire :

source: Select the location of the installed dictionaries
fr: Sélectionner l'emplacement des dictionnaires installés

source: Find dictionaries on the web..
fr: Trouver des dictionnaires sur internet..

source: Dictionary base name:
fr: Nom de base du dictionnaire :

source: Check The Following:
fr: Vérifiez les points suivants :

source: Strings
fr: Chaînes

source: CPP comments
fr: Commentaires du 'CPP'

source: C comments
fr: Commentaires 'C'
