Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: New file name:
fr: Nouveau nom de fichier :

source: Rename file:
fr: Renommer le fichier :

source: A File with that name already exists!
fr: Un fichier portant ce nom existe déjà !

source: New virtual folder name:
fr: Nouveau nom de dossier virtuel :

source: Rename virtual folder:
fr: Renommer le dossier virtuel :

source: , reason: could not locate project
fr: raison : impossible de localiser le projet

source: failed to rename virtual folder:
fr: n'a pas réussi à renommer le dossier virtuel :

source: Project new name:
fr: Nouveau nom du projet :

source: Rename project
fr: Renommer le projet

source: A project with this name already exists in the workspace
fr: Un projet portant ce nom existe déjà dans l'espace de travail

source: Project names may contain only the following characters [a-z0-9_-]
fr: Les noms de projets ne peuvent contenir que les caractères suivants [a-z0-9_-]

source: You can only drag one folder at a time
fr: Vous ne pouvez faire glisser qu'un seul dossier à la fois

source: Can't import files to workspace without projects
fr: Impossible d'importer des fichiers dans l'espace de travail sans projet

source: Import files to project
fr: Importer des fichiers dans un projet

source: Select project:
fr: Sélectionner le projet :

source: Pin Project
fr: Projet épingé

source: Build project
fr: Construire un projet

source: Rebuild
fr: Régénérer

source: Rebuild project
fr: Régénérer le projet

source: Clean
fr: Nettoyer

source: Clean project
fr: Nettoyer le projet

source: Stop Build
fr: Arrêter la construction

source: Project Only
fr: Projet seul

source: Build Order...
fr: Ordre de construction...

source: Open Containing Folder
fr: Ouvrir le dossier contenant

source: Open Shell
fr: Ouvrir un 'Shell'

source: Make Active (double click)
fr: Activer 'make'(double clic)

source: Import Files From Directory...
fr: Importer des fichiers d'un répertoire...

source: Reconcile Project...
fr: Rapprocher le projet...

source: New Virtual Folder
fr: Nouveau dossier virtuel

source: Remove Project
fr: Supprimer le projet

source: Rename Project
fr: Renommer le projet

source: Save As Template...
fr: Enregistrer comme modèle...

source: Project Editor Preferences...
fr: Préférences de l'éditeur de projet...

source: Clear Background Colour
fr: Supprimer la couleur de fond

source: Plugins...
fr: Extensions ...

source: New Workspace Folder
fr: Nouveau dossier de l'espace de travail

source: Add an Existing Project...
fr: Ajouter un projet existant...

source: Are you sure you want to delete the following workspace folders:
fr: Êtes-vous sûr de vouloir supprimer les dossiers suivants de l'espace de travail ?

source: Are you sure you want to delete the workspace folder:
fr: Êtes-vous sûr de vouloir supprimer le dossier de l'espace de travail ?

source: Enter folder name:
fr: Saisir le nom du dossier :

source: New Folder Name
fr: Nouveau nom de dossier

source: Open Project
fr: Ouvrir un projet

source: Find :
fr: Trouver :

source: Find what
fr: Rechercher quoi

source: &Find
fr: &Rechercher

source: Begin search
fr: Commencez la recherche

source: Replace:
fr: Remplacer:

source: Replace with
fr: Remplacer par

source: &Replace
fr: &Remplacer

source: Search for matches and place them in the 'Replace' window as candidates for possible replace operation
fr: Rechercher des correspondances et les placer dans la fenêtre « Remplacer » en tant que candidats pour une éventuelle opération de remplacement

source: Files:
fr: Fichiers :

source: File extensions to include in the search Wildcards are supported
fr: Extensions de fichiers à inclure dans la recherche Les caractères génériques sont pris en charge

source: Search these file types
fr: Rechercher ces types de fichiers

source: Where:
fr: Où :

source: Search in these folders To exclude a file from the search, use wildcard that starts with an hyphen ("-") For example, to exclude all matches from the node_modules folder, one can use something like: /home/user/path/to/root/folder -*node_modules*
fr: Rechercher dans ces dossiers Pour exclure un fichier de la recherche, utilisez un caractère générique commençant par un trait d'union (« - »). Par exemple, pour exclure toutes les correspondances du dossier 'node_modules', on peut utiliser quelque chose comme : /home/user/path/to/root/folder -*node_modules*

source: Add new search location
fr: Ajouter un nouveau lieu de recherche

source: Encoding:
fr: Encodage :

source: Close this dialog
fr: Fermer ce dialogue

source: Case
fr: Casse

source: Toggle case sensitive search
fr: Recherche sensible à la casse

source: Word
fr: Mot

source: Toggle whole word search
fr: Recherche de mots entiers

source: Regex
fr: Expression régulières

source: The 'Find What' field is a regular expression
fr: Le champ « Rechercher quoi » est une expression régulière

source: Pipe filter
fr: Filtrer à l'aide de 'pipe'

source: Use the pipe character ("|") as a special separator for applying additional filters. This has the similar effect as using the "grep" command line tool
fr: Utilisez le caractère 'pipe' (« | ») comme séparateur spécial pour appliquer des filtres supplémentaires. L'effet est similaire à celui de l'outil de ligne de commande 'grep'

source: Save before
fr: Sauvegarder avant

source: Save any modified files before search starts
fr: Sauvegarder les fichiers modifiés avant le début de la recherche

source: File System:
fr: Système de fichiers :

source: Symlinks
fr: Liens symboliques

source: When enabled, follow symbolic links folders
fr: Lorsque cette option est activée, les liens symboliques suivent les dossiers

source: Hidden folders
fr: Dossiers cachés

source: Search in hidden folders
fr: Recherche dans les dossiers cachés

source: Presets:
fr: Préréglages :

source: Search for TODO patterns in the code This options enables regular expression
fr: Recherche de motifs AFAIRE dans le code Cette option permet d'utiliser l'expression régulière

source: Search for ATTN patterns in the code This options enables regular expression
fr: Recherche de motifs 'ATTN' dans le code Cette option permet d'utiliser l'expression régulière

source: Search for BUG patterns in the code This options enables regular expression
fr: Recherche de motifs de 'BUG' dans le code Cette option permet d'utiliser l'expression régulière

source: FIXME
fr: FIXE MOI

source: Search for FIXME patterns in the code This options enables regular expression
fr: Recherche de motifs 'FIXME' dans le code Cette option permet d'utiliser l'expression régulière

source: Add Folder...
fr: Ajouter un dossier...

source: Remove
fr: Enlever

source: Remove the selected path
fr: Supprimer le chemin sélectionné

source: Find In Files
fr: Recherche dans les fichiers

source: Edit Search Locations
fr: Modifier les lieux de recherche

source: Clear history
fr: Effacer l'historique

source: Add Exclude Pattern
fr: Ajouter un motif d'exclusion

source: 'Find What' is empty
fr: La rubrique « Trouver quoi » est vide

source: Find / Replace
fr: Rechercher / Remplacer

source: Stop current search
fr: Arrêter la recherche en cours

source: Show Recent Searches
fr: Montrer les recherches récentes

source: Another search is currently running, try again later
fr: Une autre recherche est en cours, réessayez plus tard

source: '; Match case:
fr: ' ; Appairer les cas :

source: ====== Searching for: '
fr: ====== Recherche de : '

source: ; Match whole word:
fr: ; Appairer le mot entier :

source: false
fr: faux

source: true
fr: vrai

source: ; Regular expression:
fr: Expression régulière :

source: ====== Search cancelled by user ======
fr: ====== Recherche annulée par l'utilisateur ======

source: Reached the end of the 'Find In Files' results
fr: Les résultats de l'opération « Rechercher dans les fichiers » sont arrivés à leur terme

source: Reached the start of the 'Find In Files' results
fr: Les résultats de l'opération « Rechercher dans les fichiers » sont arrivés au début

source: Search result is no longer valid
fr: Le résultat de la recherche n'est plus valide

source: Clear History
fr: Effacer l'historique

source: Failed to open file:
fr: Échec de l'ouverture du fichier :

source: Failed to download file:
fr: Le téléchargement du fichier a échoué :

source: Configuration Manager...
fr: Gestionnaire de configuration...

source: Batch Build...
fr: Construction par lots...

source: Build Project
fr: Construire un projet

source: Build Workspace
fr: Créer un espace de travail

source: Rebuild Workspace
fr: Reconstruire l'espace de travail

source: Clean Workspace
fr: Un espace de travail propre

source: Compile Current File
fr: Compilation du fichier courant

source: Compile Current File's Project
fr: Compiler le projet du fichier actuel

source: Clean Project
fr: Nettoyer le projet

source: Rebuild Project
fr: Régénérer le projet

source: Build and Run Project
fr: Construire et exécuter un projet

source: Next Build Error
fr: Erreur suivante de construction

source: Swap Header/Implementation file
fr: Échanger le fichier d'en-tête/de mise en œuvre

source: Goto Declaration
fr: Déclaration de Goto

source: Goto Implementation
fr: Mise en œuvre du Goto

source: Open Include File
fr: Ouvrir le fichier inclus

source: Add Include File
fr: Ajouter le fichier d'inclusion

source: C++ | Code Generation / Refactoring
fr: Génération / Refonte de code 'C++'

source: Generate Setters/Getters...
fr: Générez les méthodes d'Écriture / Lecture...

source: Move Function Implementation to...
fr: Déplacer la mise en œuvre de la fonction vers...

source: Add Function Implementation...
fr: Ajouter la mise en œuvre de la fonction...

source: Implement all Un-implemented Functions...
fr: Implémenter toutes les fonctions non implémentées...

source: Debugger
fr: Débogueur

source: Start/Continue Debugger
fr: Démarrer/Continuer le débogueur

source: Restart Debugger
fr: Redémarrer le débogueur

source: Attach to process...
fr: Attacher au processus...

source: Pause debugger
fr: Pause du débogueur

source: Stop debugger
fr: Arrêter le débogueur

source: Step Into
fr: Pas à pas détaillé

source: Step Out
fr: Pas à pas sortant

source: Step Into Instruction
fr: Pas à pas dans l'instruction

source: Next
fr: Suivant

source: Next Instruction
fr: Instruction suivante

source: Show Cursor
fr: Afficher le curseur

source: Toggle Breakpoint
fr: Basculer le point d'arrêt

source: Disable All Breakpoints
fr: Désactiver tous les points d'arrêt

source: Enable All Breakpoints
fr: Activer tous les points d'arrêt

source: Delete All Breakpoints
fr: Supprimer tous les points d'arrêt

source: Quick Debug...
fr: Débogage rapide...

source: Duplicate Selection / Line
fr: Sélection de doublons / Ligne

source: Delete to Line End
fr: Effacer jusqu'à la fin de la ligne

source: Delete to Line Start
fr: Effacer jusqu'au début de la ligne

source: Delete Line
fr: Supprimer la ligne

source: Copy Line
fr: Copier la ligne

source: Cut Line
fr: Couper la ligne

source: Split selection into lines
fr: Diviser la sélection en lignes

source: Make Lowercase
fr: Mettre en minuscule

source: Make Uppercase
fr: Mettre en majuscule

source: Insert Comment Block
fr: Insérer un bloc de commentaires

source: Comment Line
fr: Ligne de commentaire

source: Comment Selection
fr: Sélection des commentaires

source: Transpose Lines
fr: Transposer les lignes

source: Move Line Up
fr: Déplacer la ligne bers le haut

source: Move Line Down
fr: Déplacer la ligne vers le bas

source: Convert Indentation to Tabs
fr: Convertir l'indentation en tabulations

source: Convert Indentation to Spaces
fr: Convertir l'indentation en espaces

source: Center Line in Editor
fr: Centrer la ligne dans l'éditeur

source: Select All
fr: Tout sélectionner

source: Match Brace
fr: Appairer le Support

source: Select to Brace
fr: Sélectionner pour l'accolade

source: Code Complete
fr: Code complet

source: Complete Word
fr: Mot complet

source: Display Function Calltip
fr: Afficher la fonction Conseil

source: Convert to Windows Format
fr: Convertir au format 'Windows'

source: Convert to Unix Format
fr: Convertir au format 'Unix'

source: Trim Trailing Spaces
fr: Supprimer les espaces de fin

source: Copy Path Relative to Workspace
fr: Copier le chemin relatif à l'espace de travail

source: Copy Path to Clipboard
fr: Copier le chemin dans le presse-papiers

source: Copy Full Path to Clipboard
fr: Copier le chemin complet dans le presse-papiers

source: Copy File Name to Clipboard
fr: Copier le nom du fichier dans le presse-papiers

source: New File
fr: Nouveau fichier

source: Open File...
fr: Ouvrir un fichier...

source: Reload File
fr: Recharger le fichier

source: Save File
fr: Sauvegarde de fichier

source: Duplicate Tab
fr: Dupliquer l'onglet

source: Save As...
fr: Enregistrer sous...

source: Print...
fr: &Imprimer...

source: Exit
fr: Quitter

source: Manage Plugins...
fr: Gérer les extensions ...

source: Plugins
fr: Extensions

source: Search
fr: Chercher

source: Grep Selection in the Current File
fr: Sélection 'Grep' dans le fichier courant

source: Grep Selection in the Workspace
fr: Sélection 'Grep' dans l'espace de travail

source: Search for Selection with default browser
fr: Recherche de la sélection avec le navigateur par défaut

source: Goto Anything
fr: Aller à n'importe quel endroit

source: Find Previous
fr: Rechercher le précédent

source: Find Resource...
fr: Trouver une ressource...

source: Quick Outline...
fr: Aperçu rapide...

source: Search | Bookmarks
fr: Recherche de signets

source: Toggle Bookmark
fr: Basculer le signet

source: Next Bookmark
fr: Signet suivant

source: Previous Bookmark
fr: Signet précédent

source: Remove All Currently-Active Bookmarks
fr: Supprimer tous les signets actifs

source: Open Shell From File Path
fr: Ouvrir l'interpréteur de commandes à partir du chemin d'accès au fichier

source: Search | Find In Files
fr: Recherche dans les fichiers

source: Find In Files...
fr: Rechercher dans les fichiers...

source: Go to Next 'Find In File' Match
fr: Aller à la correspondance suivante « Rechercher dans un fichier »

source: Go to Previous 'Find In File' Match
fr: Aller a l'appairage précédent « Rechercher dans un fichier »

source: Search | Find and Replace
fr: Recherche | Trouver et Remplacer

source: Find...
fr: Rechercher...

source: Quick Add Next
fr: Ajouter rapidement suivant

source: Quick Find All
fr: Recherche rapide de Tous

source: Replace...
fr: Remplacer...

source: Find Next
fr: Rechercher le suivant

source: Find Word At Caret
fr: Trouver un mot au curseur

source: Find Word At Caret Backward
fr: Trouver un mot au curseur à l'envers

source: Go To Previous Location
fr: Aller à l'emplacement précédent

source: Search | Go To
fr: Rechercher | Aller à

source: Go To Forward Location
fr: Aller au dernier l'emplacement

source: Go To Line...
fr: Aller à la ligne...

source: Preferences
fr: Préférences

source: Colours and Fonts...
fr: Couleurs et polices...

source: Keyboard shortcuts...
fr: Raccourcis clavier...

source: Environment Variables...
fr: Variables d'environnement...

source: Build Settings...
fr: Paramètres de construction...

source: GDB Settings...
fr: Paramètres 'GDB'...

source: Code Completion...
fr: Achèvement du code...

source: Show Recent Tabs Dialog
fr: Afficher la boîte de dialogue des onglets récents

source: Move Tab Left
fr: Déplacer l'onglet à gauche

source: Move Tab Right
fr: Déplacer l'onglet à droite

source: Word Wrap
fr: Encadrage des mots

source: Toggle Current Fold
fr: Basculer le pliage actuel

source: Toggle All Folds
fr: Basculer tous les replis

source: Toggle All Topmost Folds in Selection
fr: Basculer tous les replis supérieurs dans la sélection

source: Toggle Every Fold in Selection
fr: Basculer chaque repli dans la sélection

source: Display EOL
fr: Affichage fin de ligne

source: Next tab
fr: Onglet suivant

source: Previous tab
fr: Onglet précédent

source: Full Screen...
fr: Plein écran...

source: Output Pane
fr: Volet de sortie

source: Workspace Pane
fr: Volet espace de travail

source: Debugger Pane
fr: Volet débogueur

source: Navigation Bar
fr: Barre de navigation

source: Toggle All Panes
fr: Basculer tous les volets

source: Toggle Minimal View
fr: Basculer vers l'affichage minimal

source: Show Menu Bar
fr: Montrer la barre de menu

source: Show Status Bar
fr: Montrer la barre d'état

source: Show Tool Bar
fr: Montrer la barre d'outils

source: View | Show Whitespace
fr: Voir | Afficher les espaces

source: Show Always
fr: Afficher toujours

source: Visible After First Indent
fr: Visible après le premier retrait

source: Indentation Only
fr: Indentation uniquement

source: View | Zoom
fr: Afficher | Zoomee

source: Zoom In
fr: Zoom avant

source: Zoom Out
fr: Rétrécir

source: Reset Zoom
fr: Réinitialiser le zoom

source: New Workspace...
fr: Nouvel espace de travail...

source: Workspace
fr: Espace de travail

source: Open Workspace...
fr: Espace de travail ouvert...

source: Close Workspace
fr: Fermer l'espace de travail

source: Reload Workspace
fr: Recharger l'espace de travail

source: Workspace Settings...
fr: Paramètres de l'espace de travail...

source: Workspace Editor Preferences...
fr: Préférences de l'éditeur d'espace de travail...

source: Import other IDEs solution/workspace files...
fr: Importer des fichiers de solution/espace de travail d'autres IDE...

source: Open Active Project Settings...
fr: Ouvrir les paramètres du projet actif...

source: Create New Project
fr: Créer un nouveau projet

source: Add an Existing Project
fr: Ajouter un projet existant

source: Parse Workspace
fr: Analyse de l'espace de travail

source: Output View
fr: Vue de la sortie

source: Workspace View
fr: Vue de l'espace de travail

source: New file
fr: Nouveau fichier

source: Open file
fr: Ouvrir un fichier

source: Backward
fr: Retour en arrière

source: Forward
fr: Successeur

source: Build Active Project
fr: Construire le projet actif

source: Stop Current Build
fr: Arrêter la construction en cours

source: Clean Active Project
fr: Nettoyer le projet actif

source: Run Active Project
fr: Lancer le projet actif

source: Stop Running Program
fr: Arrêt du programme d'exécution

source: Start or Continue debugger
fr: Démarrer ou poursuivre le débogage

source: Applying your choices and restarting CodeLite
fr: Appliquer vos choix et redémarrer 'CodeLite'

source: Applying your choices, this may take a few seconds
fr: Appliquer vos choix, cela peut prendre quelques secondes

source: Eran Ifrah (Project admin)
fr: Eran Ifrah (Administrateur du projet)

source: CodeLite Home
fr: Accueil 'CodeLite'

source: CodeLite IDE
fr: Interface graphique 'CodeLite'

source: CodeLite, a free, open source, C/C++/Rust/Python/PHP and JavaScript IDE
fr: 'CodeLite', une interface graphique 'C/C++/Rust/Python/PHP' et ''JavaScript gratuit et libre d'accès

source: ' is modified Continue with reload?
fr: ' est modifié Poursuivre le rechargement ?

source: File '
fr: Fichier '

source: Open File
fr: Charger un fichier

source: Please enter a name for the tab group
fr: Veuillez saisir un nom pour le groupe d'onglets

source: There is already a file with this name. Do you want to overwrite it?
fr: Il existe déjà un fichier portant ce nom. Voulez-vous l'écraser ?

source: Tab group saved
fr: Groupe d'onglets sauvegardé

source: Select the workspace type:
fr: Sélectionnez le type d'espace de travail :

source: Build ended with errors Continue with execute?
fr: La construction s'est terminée par des erreurs Poursuivre l'exécution ?

source: Cancel
fr: Annuler

source: Execute
fr: Exécuter

source: Build starting...
fr: Démarrer la construction ...

source: Would you like to build the active project before executing it?
fr: Souhaitez-vous construire le projet actif avant de l'exécuter ?

source: Build and Execute
fr: Construire et exécuter

source: Execute
fr: Exécuter

source: A workspace reparse is needed
fr: Un ré-analyse de l'espace de travail est nécessaire

source: Open IDE Solution/Workspace File
fr: Ouvrir le fichier de solution/espace de travail de l'IDE

source: Choose compiler
fr: Choisir le compilateur

source: Select the compiler to use:
fr: Sélectionnez le compilateur à utiliser :

source: Attempting to debug workspace with no active project? Ignoring.
fr: Tentative de débogage de l'espace de travail sans projet actif ? Ignorer.

source: Would you like to build the project before debugging it?
fr: Souhaitez-vous construire le projet avant de le déboguer ?

source: Build and Debug
fr: Construire et déboguer

source: CodeLite now offers a better editor colour theme support, would you like to fix this now?
fr: CodeLite offre maintenant un meilleur support pour les thèmes de couleurs de l'éditeur, voudriez-vous corriger cela maintenant ?

source: You already have the latest version of CodeLite
fr: Vous avez déjà la dernière version de 'CodeLite'

source: A new version of CodeLite is available for download
fr: Une nouvelle version de 'CodeLite' est disponible au téléchargement

source: Download
fr: Téléchargement

source: Could not start TTY console for debugger!
fr: Impossible de démarrer la console 'TTY' pour le débogueur !

source: Workspace or project settings have been modified outside of CodeLite Would you like to reload the workspace?
fr: Les paramètres de l'espace de travail ou du projet ont été modifiés en dehors de 'CodeLite' Voulez-vous recharger l'espace de travail ?

source: Not now
fr: Pas maintenant

source: Reload workspace
fr: Recharger l'espace de travail

source: Reload CodeLite?
fr: Recharger 'CodeLite' ?

source: Build
fr: Construire

source: Project Only
fr: Uniquement le projet

source: Clean
fr: Nettoyer

source: Select Folder
fr: Choisir un dossier

source: Select Project
fr: Choisir un projet

source: Implement inherited virtual functions
fr: Mettre en œuvre des fonctions virtuelles héritées

source: Select from the list below the functions that you want to override in your class
fr: Sélectionnez dans la liste ci-dessous les fonctions que vous souhaitez remplacer dans votre classe

source: File:
fr: Fichier:

source: Generate the functions in this filename
fr: Générer les fonctions dans ce nom de fichier

source: Visibility
fr: Visibilité

source: Virtual
fr: Virtuel

source: Override
fr: Remplacement

source: Check all
fr: Tout vérifier

source: Uncheck all
fr: Tout décocher

source: Format text after insertion
fr: Formatage du texte après insertion

source: Implement Parent Virtual Functions
fr: Mise en œuvre des fonctions virtuelles parentales

source: Import Files
fr: Importer des fichiers

source: Select the directories to import from
fr: Sélectionnez les répertoires à partir desquels l'importation doit être effectuée

source: Check the folders you wish to import files from
fr: Cochez les dossiers que vous souhaitez importer des fichiers

source: Folder
fr: Dossier

source: Files extension to import (semicolon delimited):
fr: Extension des fichiers à importer (délimités par des points-virgules) :

source: Import files without extensions
fr: Importer des fichiers sans extension

source: If you wish to import files without extensions, tick this option
fr: Si vous souhaitez importer des fichiers sans extension, cochez cette option

source: Address
fr: Adresse

source: Current scope is now set to: "%s", depth: %d
fr: Le champ d'application actuel est maintenant défini sur : « %s », profondeur : %d

source: Change value...
fr: Modifier la valeur...

source: Edit expression
fr: Éditer l'expression

source: Insert new value for '%s':
fr: Insérer une nouvelle valeur pour '%s' :

source: Save changes to '
fr: Sauvegarder les modifications dans '

source: Save Modified Files
fr: Sauvegarder les fichiers modifiés

source: Some files are modified. Choose the files you would like to save.
fr: Certains fichiers sont modifiés. Choisissez les fichiers que vous souhaitez sauvegarder.
