Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: The name for the inherited class's files (without any file extension). wxCrafter will generate a $(FILE).cpp and $(FILE).hpp e.g. for an inherited class 'FooDialog', you might enter 'foodialog' here.
fr: Le nom des fichiers de la classe héritée (sans extension). 'wxCrafter' générera un $(FICHIER).cpp et un $(FICHIER).hpp. Par exemple, pour une classe héritée 'FooDialog', vous pouvez entrer 'foodialog' ici.

source: MSW Only C++ macro decorator - allows exporting this class from a DLL
fr: 'MSW' uniquement Décorateur de macro 'C++' - permet d'exporter cette classe à partir d'une 'DLL'

source: The generated C++ class name
fr: Le nom de la classe C++ générée

source: You did not set the 'Inherited C++ Class Properties -> File name' property for the top level window: '
fr: Vous n'avez pas défini la propriété 'Propriétés héritées de la classe C++' -> Nom de fichier' pour la fenêtre de premier niveau : '

source: This means that only base class code will be generated To fix this, select the toplevel entry from the tree-view and provide an Inherited class name and file name
fr: Cela signifie que seul le code de la classe de base sera généré Pour remédier à ce problème, sélectionnez l'entrée de niveau supérieur dans la vue arborescente et fournissez un nom de classe héritée et un nom de fichier

source: OK, continue with code generation
fr: OK, continuer avec la génération du code

source: Don't show this message again
fr: Ne plus montrer ce message

source: Can not generate code. Make sure that all toplevel windows have a valid C++ class name
fr: Impossible de générer le code. Assurez-vous que toutes les fenêtres de niveau supérieur ont un nom de classe C++ valide

source: Base class and inherited class have the same name
fr: La classe de base et la classe héritée portent le même nom

source: The page node is going to be collapsed
fr: Le nœud de la page va être réduit

source: The page node is going to be expanded
fr: Le nœud de la page va être développé

source: wxTreeListCtrl Column
fr: - Colonne de 'wxTreeListCtrl'

source: Alignment of both the column header and its items
fr: Alignement de l'en-tête de la colonne et de ses éléments

source: The width of the column in pixels or the special wxCOL_WIDTH_AUTOSIZE(-2) value indicating that the column should adjust to its contents. Notice that the first column is special and will be always resized to fill all the space not taken by the other columns, i.e. the width specified here is ignored for it
fr: La largeur de la colonne en pixels ou la valeur spéciale 'wxCOL_WIDTH_AUTOSIZE(-2)' indiquant que la colonne doit s'adapter à son contenu. Notez que la première colonne est spéciale et qu'elle sera toujours redimensionnée pour remplir tout l'espace non occupé par les autres colonnes, c'est-à-dire que la largeur spécifiée ici est ignorée pour elle

source: Column flags, currently can include wxCOL_RESIZABLE to allow the user to resize the column and wxCOL_SORTABLE to allow the user to resort the control contents by clicking on this column
fr: Drapeaux de colonne, qui peuvent actuellement inclure 'wxCOL_RESIZABLE' pour permettre à l'utilisateur de redimensionner la colonne et 'wxCOL_SORTABLE' pour permettre à l'utilisateur de recourir au contenu du contrôle en cliquant sur cette colonne

source: Process wxEVT_TREELIST_SELECTION_CHANGED event and notifies about the selection change in the control. In the single selection case the item indicated by the event has been selected and previously selected item, if any, was deselected. In multiple selection case, the selection of this item has just changed (it may have been either selected or deselected) but notice that the selection of other items could have changed as well, use wxTreeListCtrl::GetSelections() to retrieve the new selection if necessary.
fr: Traite l'événement 'wxEVT_TREELIST_SELECTION_CHANGED' et notifie le changement de sélection dans le contrôle. Dans le cas d'une sélection unique, l'élément indiqué par l'événement a été sélectionné et l'élément précédemment sélectionné, le cas échéant, a été désélectionné. Dans le cas d'une sélection multiple, la sélection de cet élément vient de changer (il peut avoir été sélectionné ou désélectionné), mais il faut noter que la sélection d'autres éléments peut également avoir changé. Utilisez 'wxTreeListCtrl::GetSelections() 'pour récupérer la nouvelle sélection si nécessaire.

source: Process wxEVT_TREELIST_ITEM_EXPANDING event notifying about the given branch being expanded. This event is sent before the expansion occurs and can be vetoed to prevent it from happening.
fr: Traite l'événement 'wxEVT_TREELIST_ITEM_EXPANDING' notifiant l'expansion de la branche donnée. Cet événement est envoyé avant que l'extension ne se produise et peut faire l'objet d'un veto pour l'empêcher de se produire.

source: Process wxEVT_TREELIST_ITEM_EXPANDED event notifying about the expansion of the given branch. This event is sent after the expansion occurs and can't be vetoed.
fr: Traite l'événement 'wxEVT_TREELIST_ITEM_EXPANDED' notifiant l'expansion de la branche donnée. Cet événement est envoyé après l'expansion et ne peut pas faire l'objet d'un veto.

source: Process wxEVT_TREELIST_ITEM_CHECKED event notifying about the user checking or unchecking the item. You can use wxTreeListCtrl::GetCheckedState() to retrieve the new item state and wxTreeListEvent::GetOldCheckedState() to get the previous one.
fr: Traite l'événement 'wxEVT_TREELIST_ITEM_CHECKED' notifiant que l'utilisateur a coché ou décoché l'élément. Vous pouvez utiliser 'wxTreeListCtrl::GetCheckedState()' pour récupérer le nouvel état de l'élément et 'wxTreeListEvent::GetOldCheckedState()' pour récupérer l'état précédent.

source: Process wxEVT_TREELIST_ITEM_ACTIVATED event notifying about the user double clicking the item or activating it from keyboard.
fr: Traite l'événement 'wxEVT_TREELIST_ITEM_ACTIVATED' notifiant que l'utilisateur a double-cliqué sur l'élément ou l'a activé à partir du clavier.

source: Process wxEVT_TREELIST_ITEM_CONTEXT_MENU event indicating that the popup menu for the given item should be displayed.
fr: Traite l'événement 'wxEVT_TREELIST_ITEM_CONTEXT_MENU' indiquant que le menu contextuel de l'élément donné doit être affiché.

source: Process wxEVT_TREELIST_COLUMN_SORTED event indicating that the control contents has just been resorted using the specified column. The event doesn't carry the sort direction, use GetSortColumn() method if you need to know it.
fr: Traite l'événement 'wxEVT_TREELIST_COLUMN_SORTED' indiquant que le contenu du contrôle vient d'être trié en utilisant la colonne spécifiée. L'événement ne contient pas la direction du tri, utilisez la méthode 'GetSortColumn()' si vous avez besoin de la connaître.

source: Process a wxEVT_COMMAND_WEBVIEW_NAVIGATING event, generated before trying to get a resource. This event may be vetoed to prevent navigating to this resource. Note that if the displayed HTML document has several frames, one such event will be generated per frame
fr: Traite un événement 'wxEVT_COMMAND_WEBVIEW_NAVIGATING', généré avant d'essayer d'obtenir une ressource. Cet événement peut faire l'objet d'un veto pour empêcher la navigation vers cette ressource. Notez que si le document HTML affiché comporte plusieurs cadres, un événement de ce type sera généré par cadre

source: Process a wxEVT_COMMAND_WEBVIEW_NAVIGATED event generated after it was confirmed that a resource would be requested. This event may not be vetoed. Note that if the displayed HTML document has several frames, one such event will be generated per frame.
fr: Traite un événement 'wxEVT_COMMAND_WEBVIEW_NAVIGATED' généré après qu'il a été confirmé qu'une ressource serait demandée. Cet événement ne peut pas faire l'objet d'un veto. Notez que si le document HTML affiché comporte plusieurs cadres, un événement de ce type sera généré par cadre.

source: Process a wxEVT_COMMAND_WEBVIEW_LOADED event generated when the document is fully loaded and displayed. Note that if the displayed HTML document has several frames, one such event will be generated per frame.
fr: Traite un événement wxEVT_COMMAND_WEBVIEW_LOADED généré lorsque le document est entièrement chargé et affiché. Notez que si le document HTML affiché comporte plusieurs cadres, un événement de ce type sera généré par cadre.

source: Process a wxEVT_COMMAND_WEBVIEW_ERROR event generated when a navigation error occurs. The integer associated with this event will be a wxWebNavigationError item. The string associated with this event may contain a backend-specific more precise error message/code
fr: Traite un événement 'wxEVT_COMMAND_WEBVIEW_ERROR' généré lorsqu'une erreur de navigation se produit. L'entier associé à cet événement sera un élément 'wxWebNavigationError'. La chaîne associée à cet événement peut contenir un message/code d'erreur plus précis spécifique au retour

source: Process a wxEVT_COMMAND_WEBVIEW_NEWWINDOW event, generated when a new window is created. You must handle this event if you want anything to happen, for example to load the page in a new window or tab.
fr: Traite un événement 'wxEVT_COMMAND_WEBVIEW_NEWWINDOW,' généré lorsqu'une nouvelle fenêtre est créée. Vous devez traiter cet événement si vous voulez que quelque chose se passe, par exemple pour charger la page dans une nouvelle fenêtre ou un nouvel onglet.

source: Process a wxEVT_COMMAND_WEBVIEW_TITLE_CHANGED event, generated when the page title changes. Use GetString to get the title.
fr: Traite un événement 'wxEVT_COMMAND_WEBVIEW_TITLE_CHANGED', généré lorsque le titre de la page change. Utilisez 'GetString' pour obtenir le titre.

source: URL to load by default in the web view. Note that the designer will display about:blank. The preview and generated code will use the actual URL
fr: 'URL' à charger par défaut dans la vue internet. Notez que le concepteur affichera 'about:blank'. L'aperçu et le code généré utiliseront l'URL réelle

source: The page-specific bitmap if different from the global one
fr: L'image spécifique à la page si elle est différente de l'image globale

source: Sizer orientation
fr: Orientation du calibreur

source: Number of columns in the grid
fr: Nombre de colonnes dans la grille

source: Number of rows in the grid
fr: Nombre de lignes dans la grille

source: Which columns are allowed to grow. Comma separated list
fr: Quelles colonnes sont autorisées à croître. Liste séparée par des virgules

source: Which rows are allowed to grow. Comma separated list
fr: Quelles lignes sont autorisées à croître. Liste séparée par des virgules

source: The horizontal gap between grid cells
fr: L'écart horizontal entre les cellules de la grille

source: The vertical gap between grid cells
fr: L'écart vertical entre les cellules de la grille

source: When enabled, this sizer is kept as a class member and become accessible
fr: Lorsqu'elle est activée, ce calibreur est conservé en tant que membre de la classe et devient accessible

source: Initial State
fr: État initial

source: Standard wxButton
fr: Bouton standard

source: Button ID
fr: Identifiant du bouton

source: Tooltip text:
fr: Texte de l'infobulle :

source: Select bitmap
fr: Sélectionner l'image

source: Invalid C++ class name provided!
fr: Le nom de la classe 'C++' fourni n'est pas valide !

source: Please set an include file for this control
fr: Veuillez définir un fichier d'inclusion pour ce contrôle

source: Control instantiation code is missing
fr: Le code d'instanciation du contrôle est manquant

source: Are you sure you want to delete the following custom controls:
fr: Êtes-vous sûr de vouloir supprimer les contrôles personnalisés suivants :

source: Showing events for -
fr: Voir les événements pour -

source: Sample Text
fr: Exemple de texte

source: You must create a project before you can add new forms
fr: Vous devez créer un projet avant de pouvoir ajouter de nouveaux formulaires

source: Please enter a file name
fr: Veuillez saisir un nom de fichier

source: Please enter a class name
fr: Veuillez saisir un nom de classe

source: Please select a virtual folder for the generated code
fr: Veuillez sélectionner un dossier virtuel pour le code généré

source: Enter the new wxCrafter file a name (full path):
fr: Donnez un nom (chemin complet) au nouveau fichier 'wxCrafter' :

source: Select wxCrafter file
fr: Sélectionner le fichier 'wxCrafter'

source: New wxFrame
fr: Nouvel 'wxFrame'

source: New wxDialog
fr: Nouveau 'wxDialog'

source: New wxWizard
fr: Nouveau 'wxWizard'

source: New wxPanel
fr: Nouveau 'wxPanel'

source: New wxImageList
fr: Nouvelle 'wxImageList'

source: New wxPopupWindow
fr: Nouvelle 'wxPopupWindow'

source: Add wxPGProperty
fr: Ajout de 'wxPGProperty'

source: Add wxPGProperty Child
fr: Ajout le descendant de 'wxPGProperty'

source: Add Button
fr: Ajouter un bouton

source: Add Bitmap
fr: Ajouter une image

source: Add Column
fr: Ajouter une colonne

source: Add Row
fr: Ajouter une ligne

source: Add Pane
fr: Ajouter un volet

source: Add Tool
fr: Ajouter un outil

source: Add Control
fr: Ajouter un contrôle

source: Add Label
fr: Ajouter un libellé

source: Add Spacer
fr: Ajouter un espaceur

source: Add Stretch Spacer
fr: Ajouter un espaceur étirable

source: Add Separator
fr: Ajouter un séparateur

source: Add wxMenu
fr: Ajouter un 'wxMenu'

source: Add Menu Item
fr: Ajouter un élément de menu

source: Add Sub Menu
fr: Ajouter un sous-menu

source: Add Form
fr: Ajouter une forme

source: Add Page
fr: Ajouter une page

source: Add Sizer
fr: Ajouter un calibreur

source: Insert into new Sizer
fr: Insérer dans un nouveau calibreur

source: Change wxSizer Type
fr: Changer le type de 'wxSizer'

source: Add wxAuiManager
fr: Ajouter 'wxAuiManager'

source: Add Container
fr: Ajouter un conteneur

source: Add wxRibbonPage
fr: Ajouter 'wxRibbonPage'

source: Add wxRibbonPanel
fr: Ajouter 'wxRibbonPanel'

source: Add wxRibbonButtonBar
fr: Ajouter 'wxRibbonButtonBar'

source: Add wxRibbonToolBar
fr: Ajouter 'wxRibbonToolBar'

source: Add wxRibbonGallery
fr: Ajouter 'wxRibbonGallery'

source: Add Dropdown Button
fr: Ajouter un bouton déroulant

source: Add Hybrid Button
fr: Ajouter un bouton hybride

source: Add Toggle Button
fr: Ajouter un bouton bistable

source: Add Dropdown Tool
fr: Ajouter un outil de liste déroulante

source: Add Hybrid Tool
fr: Ajouter un outil hybride

source: Add Toggle Tool
fr: Ajouter un outil à bascule

source: Add Gallery Item
fr: Ajouter un élément de la galerie

source: Add Notebook Page
fr: Ajouter une page de carnet

source: Add Sub Page
fr: Ajouter une page secondaire

source: Add Panel
fr: Ajouter un panneau

source: Add List Column
fr: Ajouter une colonne de liste

source: Generate code...
fr: Générer du code...

source: Add wxTimer
fr: Ajouter wxTimer

source: Add wxTaskBarIcon
fr: Ajouter wxTaskBarIcon

source: Move Left into Higher Sizer
fr: Déplacer vers la gauche dans le calibreur supérieur

source: Move Right into Sibling Sizer
fr: Passez directement au calibreur du voisin

source: Duplicate
fr: Dupliquer

source: This item can be placed either as a sibling or as a child of the target widget Where should wxCrafter position this widget?
fr: Cet élément peut être placé comme frère ou enfant du visuel cible. Où 'wxCrafter' doit-il positionner ce visuel ?

source: As a Child
fr: En tant que descendant

source: As a Sibling
fr: En tant que membre de la fratrie

source: Process a wxEVT_KEY_DOWN event (any key has been pressed)
fr: Traite un événement 'wxEVT_KEY_DOWN' (n'importe quelle touche a été pressée)

source: Process a wxEVT_KEY_UP event (any key has been released)
fr: Traite un événement 'wxEVT_KEY_UP' (une touche quelconque a été relâchée)

source: Process a wxEVT_CHAR event
fr: Traiter un événement 'wxEVT_CHAR'

source: A right click (or other context menu command depending on platform) has been detected
fr: Un clic droit (ou une autre commande du menu contextuel en fonction de la plate-forme) a été détecté

source: Process a wxEVT_LEFT_DOWN event. The handler of this event should normally call event.Skip() to allow the default processing to take place as otherwise the window under mouse wouldn't get the focus.
fr: Traite un événement 'wxEVT_LEFT_DOWN'. Le gestionnaire de cet événement devrait normalement appeler 'event.Skip()' pour permettre au traitement par défaut d'avoir lieu, car sinon la fenêtre sous la souris n'obtiendrait pas le focus.

source: Process a wxEVT_LEFT_UP event.
fr: Traite un événement 'wxEVT_LEFT_UP'.

source: Process a wxEVT_LEFT_DCLICK event.
fr: Traite un événement 'wxEVT_LEFT_DCLICK'.

source: Process a wxEVT_MIDDLE_DOWN event
fr: Traitement d'un événement 'wxEVT_MIDDLE_DOWN'

source: Process a wxEVT_MIDDLE_UP event
fr: Traitement d'un événement 'wxEVT_MIDDLE_UP'

source: Process a wxEVT_MIDDLE_DCLICK event.
fr: Traite un événement 'wxEVT_MIDDLE_DCLICK'.

source: Process a wxEVT_RIGHT_DOWN event
fr: Traitement d'un événement 'wxEVT_RIGHT_DOWN'

source: Process a wxEVT_RIGHT_UP event
fr: Traitement d'un événement 'wxEVT_RIGHT_UP'

source: Process a wxEVT_RIGHT_DCLICK event
fr: Traitement d'un événement 'wxEVT_RIGHT_DCLICK'

source: Process a wxEVT_MOTION event
fr: Traitement d'un événement 'wxEVT_MOTION'

source: Process a wxEVT_ENTER_WINDOW event
fr: Traiter un événement 'wxEVT_ENTER_WINDOW'

source: Process a wxEVT_LEAVE_WINDOW event.
fr: Traite un événement 'wxEVT_LEAVE_WINDOW'.

source: Process a wxEVT_MOUSEWHEEL event
fr: Traitement d'un événement' wxEVT_MOUSEWHEEL'

source: Process a wxEVT_SET_FOCUS event
fr: Traitement d'un événement 'wxEVT_SET_FOCUS'

source: Process a wxEVT_KILL_FOCUS event
fr: Traitement d'un événement 'wxEVT_KILL_FOCUS'

source: Process a wxEVT_PAINT event
fr: Traiter un événement 'wxEVT_PAINT'

source: Process a wxEVT_ERASE_BACKGROUND event.
fr: Traite un événement 'wxEVT_ERASE_BACKGROUND'.

source: Process a wxEVT_SIZE event
fr: Traiter un événement 'wxEVT_SIZE'

source: Process a wxEVT_MOVE event, which is generated when a window is moved.
fr: Traite un événement 'wxEVT_MOVE', qui est généré lorsqu'une fenêtre est déplacée.

source: Process a wxEVT_UPDATE_UI event
fr: Traiter un événement 'wxEVT_UPDATE_UI'

source: Process a wxEVT_IDLE event
fr: Traiter un événement 'wxEVT_IDL'E

source: Event Handlers
fr: Gestionnaires d'événements

source: Open Ctrl-O
fr: Ouvrir Ctrl-O

source: &Save Ctrl-S
fr: &Sauvegarder Ctrl-S

source: Generate Code Ctrl-G
fr: Générer le code Ctrl-G

source: Batch Generate Code... Ctrl-Shift-G
fr: Générer du code par lots... Ctrl-Maj-G

source: Hide the designer
fr: Cacher le concepteur

source: Show &Preview F5
fr: Montrer l'a&Perçu F5

source: Delete DEL
fr: Supprimer SUP

source: Copy Ctrl-C
fr: Copier 'Ctrl-C'

source: Paste Ctrl-V
fr: Coller 'Ctrl-V'

source: Cut Ctrl-X
fr: Couper Ctrl-X

source: Undo Ctrl-Z
fr: Défaire Ctrl-Z

source: Redo Ctrl-Y
fr: Refaire Ctrl-Y

source: Set label for current state
fr: Définir l'étiquette de l'état actuel

source: Rename item
fr: Renommer un élément

source: Find... Ctrl-F
fr: Trouver... Ctrl-F

source: Build Active Project F7
fr: Construire le projet actif F7

source: &Import
fr: &Importer

source: Import wx&FormBuilder Project
fr: Importer un projet 'wx&FormBuilder'

source: Import wx&Smith File
fr: Importer un fichier 'wx&Smith'

source: Import &XRC File
fr: Importer un fichier '&XRC'

source: Custom Controls
fr: Contrôles personnalisés

source: New Custom Control...
fr: Nouveau contrôle personnalisé...

source: Edit Custom Control...
fr: Modifier le contrôle personnalisé...

source: Delete Custom Control
fr: Supprimer un contrôle personnalisé

source: &Help
fr: &Aide

source: Designer
fr: Concepteur

source: Header
fr: En-tête

source: Properties
fr: Propriétés

source: Sizer Flags
fr: Drapeaux du calibreur

source: <Default>
fr: <Par défaut>

source: Select a standard color from the list below
fr: Sélectionnez une couleur standard dans la liste ci-dessous

source: Custom Colour...
fr: Couleur personnalisée...

source: Select custom color...
fr: Choisissez une couleur personnalisée...

source: Close button minimizes wxCrafter to the tray
fr: Le bouton Fermer minimise 'wxCrafter' dans la barre d'état

source: Code Generation:
fr: Génération de codes :

source: Format inherited files
fr: Formatage des fichiers hérités

source: When e.g. a new eventhandler is added, wxCrafter helpfully adds an empty handler to the derived class as well as to the generated base-class. If this box is ticked, the whole of the inherited header and implementation files will be formatted each time this is done.
fr: Lorsque, par exemple, un nouveau gestionnaire d'événements est ajouté, 'wxCrafter' ajoute un gestionnaire vide à la classe dérivée ainsi qu'à la classe de base générée. Si cette case est cochée, l'ensemble des fichiers d'en-tête et d'implémentation hérités seront formatés à chaque fois.

source: Duplicating and Pasting:
fr: Dupliquer et coller :

source: What should happen when duplicating or pasting a top-level window, or pasting some contents from one top-level window to another?
fr: Que se passe-t-il lorsque l'on duplique ou que l'on colle une fenêtre de premier niveau, ou lors du collage d'un contenu d'une fenêtre de niveau supérieur à une autre ?

source: Leave unchanged any user-set names of child controls
fr: Ne pas modifier les noms des contrôles enfants définis par l'utilisateur

source: You can't have two top-level windows with the same name, but you can have FooBase::m_textEntry and BarBase::m_textEntry. Tick this box if you want to keep such names the same, convenient if you already have Foo code that references them that you want to copy to Bar; but you don't need to keep autogenerated names like m_text153.
fr: Vous ne pouvez pas avoir deux fenêtres de premier niveau portant le même nom, mais vous pouvez avoir 'FooBase::m_textEntry' et 'BarBase::m_textEntry'. Cochez cette case si vous voulez garder ces noms identiques, ce qui est pratique si vous avez déjà du code 'Foo' qui y fait référence et que vous voulez copier dans 'Bar' ; mais vous n'avez pas besoin de garder des noms autogénérés comme 'm_text153'.

source: Leave unchanged the names of all child controls
fr: Laisser inchangés les noms de tous les contrôles enfants

source: You can't have two top-level windows with the same name, but you can have FooBase::m_text123 and BarBase::m_text123. Tick this box if you want to keep such names the same; convenient if you already have Foo code that references them that you want to copy to Bar.
fr: Vous ne pouvez pas avoir deux fenêtres de premier niveau portant le même nom, mais vous pouvez avoir 'FooBase::m_text123' et 'BarBase::m_text123'. Cochez cette case si vous souhaitez que ces noms restent identiques ; c'est pratique si vous avez déjà du code 'Foo' qui y fait référence et que vous souhaitez copier dans 'Bar'.

source: Copy any event-handlers too
fr: Copier également tous les gestionnaires d'événements

source: If the class that you're duplicating has e.g. a wxTextCtrl with a wxEVT_COMMAND_TEXT_ENTER event-handler set, if this box is ticked the textctrl in duplicate class will also have that event-handler.
fr: Si la classe que vous dupliquez possède par exemple un 'wxTextCtrl' avec un gestionnaire d'événement 'wxEVT_COMMAND_TEXT_ENTER', si cette case est cochée, le 'textctrl' de la classe dupliquée aura également ce gestionnaire d'événement.

source: Enter Text
fr: Saisir le texte

source: Select Color
fr: Sélectionner une couleur

source: Select Colour...
fr: Choisir la couleur...

source: wxCrafter Settings
fr: - Paramètres de 'wxCrafter'

source: Choose a wxFormBuilder project to import
fr: Choisissez un projet 'wxFormBuilder' à importer

source: Choose a wxSmith project to import
fr: Choisir un projet 'wxSmith' à importer

source: Import a wxFormBuilder project
fr: Importer un projet 'wxFormBuilder'

source: Import a wxSmith project
fr: Importer un projet 'wxSmith'
