Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: User dictionary and ignored words are case sensitive
fr: Le dictionnaire de l'utilisateur et les mots ignorés sont sensibles à la casse

source: Ignore symbols in tags database
fr: Ignorer les symboles dans la base de données des balises

source: Don't mark words in the project's tags database as spelling errors
fr: Ne pas marquer les mots de la base de données des balises du projet comme des fautes d'orthographe

source: Clear ignore list
fr: Effacer la liste d'ignorés

source: Clear the ignore list
fr: Effacer la liste d'ignorés

source: Misspelling:
fr: Faute d'orthographe :

source: Suggest
fr: Suggérer

source: SpellChecker Settings
fr: Paramètres du correcteur orthographique

source: Misspelling found!
fr: Faute d'orthographe trouvée !

source: Choose a commit
fr: Choisir une livraison

source: This will clear the message history Continue?
fr: Cela effacera l'historique du message Continuer ?

source: Commit History
fr: Historique des livraisons

source: Insert Last Message
fr: Insérer le dernier message

source: Subversion plugin for codelite2.0 based on the svn command line tool
fr: Extension 'Subversion' pour 'codelite2.0' basée sur l'outil en ligne de commande 'svn'

source: Subversion Options
fr: Options de Subversion

source: Sync Project Files...
fr: Synchroniser les fichiers de projet...

source: Watch this folder
fr: Regarder ce dossier

source: Commit
fr: Soumettre

source: Revert changes
fr: Rétablir les modifications

source: Lock file
fr: Verrouiller le fichier

source: UnLock file
fr: Déverrouiller le fichier

source: Show Recent Changes
fr: Afficher les changements récents

source: Revert to revision
fr: Revenir à la révision

source: Create Diff
fr: Créer un différentiel

source: Change Log...
fr: Journal des modifications...

source: You are about to revert all your changes Are you sure?
fr: Vous êtes sur le point d'annuler toutes vos modifications En êtes-vous sûr ?

source: Insert base revision to diff against:
fr: Insérer la révision de base à comparer :

source: Enter new URL:
fr: Saisissez la nouvelle 'URL' :

source: Svn Rename
fr: Renommer 'Svn'

source: Fail to write commit message to a temporary file!
fr: Échec de l'écriture du message de validation dans un fichier temporaire !

source: Set the revision number:
fr: Définir le numéro de révision :

source: Invalid revision number
fr: Numéro de révision non valide

source: Would you like to remove the following folders from SVN?
fr: Souhaitez-vous supprimer les dossiers suivants de 'SVN' ?

source: Would you like to remove the following files from SVN?
fr: Souhaitez-vous supprimer les fichiers suivants du 'SVN' ?

source: more folders
fr: plus de dossiers

source: .. and
fr: ... et

source: more files
fr: plus de fichiers

source: How many recent changes you want to view?
fr: Combien de changements récents souhaitez-vous afficher ?

source: Svn show recent changes
fr: 'Svn' afficher les changements récents

source: Changes
fr: Changements

source: Unversioned Files
fr: Fichiers non versionnés

source: Source URL:
fr: 'URL' de la source :

source: Target URL:
fr: 'URL' de la cible :

source: Comment:
fr: Commentaire :

source: &Login
fr: &Connexion

source: Ignore the following file patterns:
fr: Ignorer les modèles de fichiers suivants :

source: When adding file(s) to project, add it to svn as well
fr: Lorsque vous ajoutez un ou plusieurs fichiers au projet, ajoutez-les également à svn

source: Retag workspace after svn update, revert or applying patch
fr: Rétablir le marquage de l'espace de travail après une mise à jour 'svn', un retour en arrière ou l'application d'un correctif

source: When renaming a file in the project, rename it in the repository as well
fr: Lorsque vous renommez un fichier dans le projet, renommez-le également dans le référentiel

source: Use POSIX Locale
fr: Utiliser la localisation 'POSIX'

source: When checked, CodeLite will use the default "C" locale instead of the current locale. This will ensure that svn command line output is parsed properly.
fr: Si cette option est cochée, 'CodeLite' utilisera la locale 'C' par défaut au lieu de la locale actuelle. Cela permet de s'assurer que la ligne de commande 'svn' est correctement analysée.

source: External Diff
fr: Différence externe

source: Use external diff tool
fr: Utiliser un outil de comparaison externe

source: External Diff Viewer:
fr: Visualisateur de différences externe :

source: SSH Client
fr: Client 'SSH'

source: SSH Client arguments:
fr: Arguments du client 'SSH' :

source: The SSH client field should contain the command to be used by the SVN command line client for establishing a secured channel. For example, on Windows it should contain something like: /path/to/plink.exe -l <user name> -pw <svn password> If you don't need SSH channel, leave this field empty
fr: Le champ client 'SSH' doit contenir la commande à utiliser par le client en ligne de commande 'SVN' pour établir un canal sécurisé. utilisée par le client de ligne de commande 'SVN' pour établir un canal sécurisé. Par exemple, sous Windows, il devrait contenir quelque chose comme : /path/to/plink.exe -l <nom d'utilisateur> -pw <mot de passe SVN>

source: Auto Revision:
fr: Révision automatique :

source: Preprocessor name:
fr: Nom du préprocesseur :

source: Root URL:
fr: 'URL' racine :

source: Revision:
fr: Révision :

source: URL of repository:
fr: 'URL' du dépôt :

source: Checkout directory:
fr: Répertoire d'extraction :

source: From revision:
fr: A partir de la révision :

source: To revision:
fr: À la révision :

source: Create compact log
fr: Créer un journal compact

source: From Revision:
fr: À partir de la révision :

source: To Revision:
fr: À la révision :

source: Ignore whitespaces
fr: Ignorer les espaces

source: Title
fr: Titre

source: Bug URL Pattern:
fr: 'URL' de modèle de d'erreur :

source: Enter here the URL for the bug details. For example: http://mytracker.com?bug_id=$(BUGID)
fr: Entrez ici l'URL pour les détails du problème. Par exemple : 'http://mytracker.com?bug_id=$(BUGID')

source: Bug Message Pattern:
fr: Modèle de message d'erreur :

source: Enter here the message to add to the commit log. You may use the $(BUG_URL) and $(BUGID) macros. An example: "Fixed: BUG#$(BUGID), See $(BUG_URL) for more details"
fr: Si cette option est cochée, 'CodeLite' utilisera la commande Entrer ici le message à ajouter au journal de livraison. Vous pouvez utiliser les macros $(BUG_URL) et $(BUGID). Voici un exemple : « Fixed : BUG#$(BUGID), See $(BUG_URL) for more details « locale par défaut “C” au lieu de la locale actuelle. Cela permet de s'assurer que la ligne de commande 'svn' est correctement analysée.

source: Feature URL Pattern:
fr: 'URL' de modèle de fonctionnalité :

source: Enter here the URL for the feature request details. For example: http://mytracker.com?fr_id=$(FRID)
fr: Entrez ici l'URL pour les détails de la demande de fonctionnalité. Par exemple : 'http://mytracker.com?fr_id=$(FRID')

source: Feature Message Pattern:
fr: Modèle de message de caractéristique :

source: Enter here the message to add to the commit log. You may use the $(FR_URL) and $(FRID) macros. An example: "Implements FR#$(FRID), See $(FR_URL) for more details"
fr: Saisissez ici le message à ajouter au journal de livraison. Vous pouvez utiliser les macros $(FR_URL) et $(FRID). Voici un exemple : « Implémente FR#$(FRID), Voir $(FR_URL) pour plus de détails »

source: Do not change EOL, apply patch as it is
fr: Ne pas modifier la fin d eligne, appliquer le correctif tel quel

source: Change to Windows style (CRLF)
fr: Passer au style 'Windows' (CRLF)

source: Change to UNIX style (LF)
fr: Passer au style 'UNIX' (LF)

source: Change patch line endings (EOL):
fr: Modifier les fins de ligne des correctifs :

source: Select path:
fr: Sélectionner le chemin :

source: Recently used paths:
fr: Chemins récemment utilisés :

source: Create Svn Tag
fr: Créer une balise 'Svn'

source: Login
fr: Se connecter

source: Subversion Preferences
fr: Préférences de 'Subversion'

source: Svn Info
fr: Info 'Svn'

source: Svn Checkout
fr: Extraction 'svn'

source: Svn Log
fr: Journal 'Svn'

source: Svn Diff...
fr: Differences 'svn'...

source: Svn Properties...
fr: Propriétés 'Svn'...

source: Select patch file:
fr: Sélectionner le fichier de correction :

source: Select Local Repository:
fr: Sélectionnez Référentiel local :

source: Blame
fr: Faute

source: Subversion: Show Recent Changes
fr: 'Subversion' : Afficher les changements récents

source: No Files to Display
fr: Aucun fichier à afficher

source: Modified Files
fr: Fichiers modifiés

source: Added Files
fr: Fichiers ajoutés

source: Deleted Files
fr: Fichiers supprimés

source: Conflicted Files
fr: Fichiers conflictuels

source: Locked Files
fr: Fichiers verrouillés

source: MESSAGE: Another process is already running. MESSAGE: Ignoring last command.
fr: MESSAGE : Un autre processus est déjà en cours d'exécution. MESSAGE : Ignorer la dernière commande.

source: Choose directory
fr: Choisir un répertoire

source: Svn update
fr: Mise à jour 'Svn'

source: Svn commit all changes
fr: Livrer tous les changements 'Svn'

source: Svn revert all changes
fr: Annuler tous les changements 'Svn'

source: Stop current svn process
fr: Arrêter le processus 'svn' en cours

source: Svn Cleanup
fr: Nettoyage 'Svn'

source: Clear Svn Output Tab
fr: Effacer l'onglet de sortie 'Svn'

source: Svn Settings...
fr: Paramètres 'Svn'...

source: Select a Directory to View...
fr: Sélectionner un répertoire à visualiser...

source: Close View
fr: Fermer la vue

source: Unversioned files (
fr: Fichiers non versionnés (

source: Revert
fr: Annuler

source: Lock
fr: Verrouiller

source: Unlock
fr: Débloquer

source: Resolve
fr: Résoudre

source: Create Diff...
fr: Créer un différentiel...

source: Blame...
fr: La faute...

source: Ignore this file
fr: Ignorer ce fichier

source: Ignore this file pattern
fr: Ignorer ce modèle de fichier

source: Create Tag
fr: Créer une balise

source: Create Branch
fr: Créer une branche

source: Switch URL...
fr: Changer d'URL...

source: Apply Patch...
fr: Appliquer le correctif...

source: Apply Patch - Dry Run...
fr: Appliquer l'écusson - Lancer à blanc...

source: Properties...
fr: Propriétés...

source: Nothing to commit!
fr: Rien à livrer !

source: Delete the selected files?
fr: Supprimer les fichiers sélectionnés ?

source: Using Subversion Click to open the Subversion view
fr: Utilisation de 'Subversion' Cliquez pour ouvrir la vue 'Subversion'

source: Svn rename...
fr: Renommer 'Svn ...

source: Working copy
fr: Copie du travail en cours

source: HEAD version
fr: Version de la tête (HEAD)

source: Close SVN view?
fr: Fermer la vue du 'SVN' ?

source: <No repository path is selected>
fr: <Aucun chemin d'accès au référentiel n'est sélectionné>

source: The checkout directory '%s' already exists continue with the checkout?
fr: Le répertoire d'extraction « %s » existe déjà. continuer l'extraction ?

source: ===== APPLYING PATCH - DRY RUN =====
fr: ===== APPLICATION DU CORRECTIF - MARCHE À BLANC =====

source: ===== OUTPUT END =====
fr: ===== FIN SORTIE =====

source: Loading Svn blame dialog...
fr: Chargement du dialogue de faute 'Svn'...

source: Aborted.
fr: Avortée.

source: Failed to launch Subversion client.
fr: Échec du lancement du client Subversion.

source: Select Executable:
fr: Sélectionnez Exécutable :

source: Remove path
fr: Supprimer le chemin

source: Remove paths
fr: Supprimer les chemins

source: Root URL:
fr: URL racine :

source: <not applicable>
fr: <non applicable>

source: Highlight this revision
fr: Mettre en avant cette révision

source: Authentication failed. Retrying...
fr: L'authentification a échoué. Réessayer...

source: Server certificate verification failed. Retrying...
fr: La vérification du certificat du serveur a échoué. Réessayer...

source: Modified Paths:
fr: Chemins modifiés :

source: Diff:
fr: Différences :

source: Feature Request ID:
fr: ID de la demande de fonctionnalité :

source: Bug ID:
fr: Identifiant de bogue :

source: <none detected>
fr: <rien de détecté>

source: Root Directory:
fr: Répertoire racine :

source: Exclude these file extensions:
fr: Exclure ces extensions de fichiers :

source: Exclude binary (application/octet-stream) files
fr: Exclure les fichiers binaires (application/octet- flux)

source: Svn Commit
fr: Livraison 'Svn'

source: Sync Workspace to SVN
fr: Synchroniser l'espace de travail avec 'SVN'

source: <No opened file>
fr: <Aucun fichier ouvert>

source: >>> File truncated <<<
fr: >>> Fichier tronqué <<<

source: Close file
fr: Fermer le fichier

source: Play
fr: Lecture

source: Detach window
fr: Détacher la fenêtre

source: A Linux like tail command
fr: Une commande 'tail' semblable à celle de Linux

source: Icon changes require a workspace reload
fr: Les changements d'icônes nécessitent un rechargement de l'espace de travail

source: Tweak codelite
fr: Ajuster 'codelite'

source: Tweaks Plugin
fr: Extension 'Tweaks'

source: Enable Tweaks
fr: Activer les ajustements

source: Editor Tabs
fr: Onglets de l'éditeur

source: Configure Editor Tab Colours
fr: Configuration des couleurs des onglets de l'éditeur

source: Customize your editor tab colours globally or per project
fr: Personnaliser les couleurs des onglets de l'éditeur globalement ou par projet

source: Global Tab Colours
fr: Couleurs globales des onglets

source: Tab Label Background Colour
fr: Couleur d'arrière-plan de l'étiquette de l'onglet

source: Tab Label Text Colour
fr: Couleur du texte de l'étiquette de l'onglet

source: Tab Colours Per Project
fr: Couleurs des onglets par projet

source: &Reset colours
fr: &Réinitialiser les couleurs

source: Reset colours
fr: &Réinitialiser les couleurs

source: Configure Project Images
fr: Configuration des images de projet

source: Set a different image for a every project in the workspace
fr: Définir une image différente pour chaque projet dans l'espace de travail

source: Tweaks Setting
fr: Réglage des ajustements

source: Test name:
fr: Nom du test :

source: The C++ name of the test
fr: Le nom 'C++' du test

source: Fixture name (optional):
fr: Nom du dispositif (facultatif) :

source: Output file name (optional):
fr: Nom du fichier de sortie (facultatif) :

source: The name of the file of which CodeLite will generate the test code. When left empty, CodeLite will use the first available source file in target project
fr: Le nom du fichier dont 'CodeLite' générera le code de test. S'il est laissé vide, 'CodeLite' utilisera le premier fichier source disponible dans le projet cible

source: Project to whom this unit test should be added to:
fr: Projet auquel ce test unitaire doit être ajouté :

source: New Unit Test
fr: Nouveau test unitaire

source: Class Name...
fr: Nom de la classe...

source: Select the class to test from a list of classes
fr: Sélectionner la classe à tester dans une liste de classes

source: Fixture (optional):
fr: Dispositif (optionnel) :

source: Output file (optional):
fr: Fichier de sortie (facultatif) :

source: Target UnitTest++ Project:
fr: Cible 'UniTest++' du projet :

source: Functions to test:
fr: Fonctions à tester :

source: Create UnitTests for Class
fr: Créer des tests unitaires pour la classe

source: There are no tests to generate
fr: Il n'y a pas de tests à réaliser

source: Could not find match for class '
fr: Impossible de trouver une correspondance pour la classe '

source: Select class:
fr: Sélectionnez une classe :

source: A Unit test plugin based on the UnitTest++ framework
fr: Une extension de test d'unité basée sur le système 'UnitTest++'

source: Create new test...
fr: Créer un nouveau test...

source: Create tests for class...
fr: Créer des tests pour les classes...

source: Mark this project as UnitTest++ project
fr: Marquer ce projet comme projet 'UnitTest++'

source: Run Project as UnitTest++ and report
fr: Lancer le projet en tant qu'UnitTest++' et générer un rapport

source: Run Unit tests...
fr: Lancer les tests unitaires...

source: Run project as unit test project...
fr: Lancer le projet en tant que projet de test unitaire...

source: Create new &test...
fr: Créer un nouveau &test...

source: Create tests for &class...
fr: Créer des tests pour &classe...

source: There are currently no UnitTest project in your workspace Would you like to create one now?
fr: Il n'y a actuellement aucun projet 'UnitTes't dans votre espace de travail. Voulez-vous en créer un maintenant ?

source: Could not find the target project
fr: Impossible de trouver le projet cible

source: Could not create target file '%s'
fr: Impossible de créer le fichier cible '%s'

source: Project contains 0 tests. Nothing to be done
fr: Le projet contient 0 test. Rien à faire

source: Total tests:
fr: Nombre total de tests :

source: Tests failed:
fr: Les tests ont échoué :

source: Tests passed:
fr: Les tests sont réussis :

source: Clear report...
fr: Annuler le rapport ...

source: Failed to launch NodeJS:
fr: Échec du lancement de 'NodeJS' :

source: Clear all breakpoints
fr: Effacer tous les points d'arrêt

source: Delete breakpoint
fr: Supprimer le point d'arrêt

source: Node.js: uncaught exception!
fr: 'Node.js' : exception non capturée !

source: Copy Backtrace
fr: Copier la trace arrière

source: Debug script
fr: Script de débogage

source: Script to debug:
fr: Script pour déboguer :

source: Execute script
fr: Exécuter le script

source: Script to execute:
fr: Script à exécuter :

source: Show hidden files
fr: Afficher les fichiers cachés

source: Open package.json
fr: Ouvrir le fichier 'package.json'

source: Debug...
fr: Déboguer...

source: npm init
fr: initialisation npm

source: npm install
fr: installation 'npm'

source: Failed to load package.json file from path:
fr: Échec du chargement du fichier 'package.json' à partir du chemin d'accès :

source: Could not instantiate a debugger for your NodeJS version!
fr: Impossible d'instancier un débogueur pour votre version de 'NodeJS' !

source: Enable XML code completion
fr: Activer l'achèvement du code 'XML'

source: Enable HTML code completion
fr: Activer l'achèvement du code 'HTML'

source: nodejs path:
fr: chemin 'nodejs' :

source: Set the path to Node.js executable
fr: Définir le chemin d'accès à l'exécutable 'Node.j's

source: npm path:
fr: chemin 'npm' :

source: Set the path to npm executable
fr: Définir le chemin d'accès à l'exécutable 'npm'

source: Node.js executable:
fr: Exécutable 'Node.js' :

source: Select Node.js executable
fr: Choisir l'exécutable 'Node.js'

source: Select the script to execute
fr: Sélectionner le script à exécuter

source: Debugger port:
fr: Port du débogueur :

source: Command line arguments:
fr: Arguments de la ligne de commande :

source: Pass command line arguments to Node.js Place each argument on its own line
fr: Transmettre les arguments de la ligne de commande à 'Node.js' Placer chaque argument sur sa propre ligne

source: Create the workspace in a separate directory
fr: Créer l'espace de travail dans un répertoire séparé

source: Callstack
fr: Pile d'appel

source: Where
fr: Où

source: WebTools Settings
fr: Paramètres des outils Internet

source: Node.js Debugger
fr: Débogueur 'Node.js'

source: Support for JavaScript, CSS/SCSS, HTML, XML and other web development tools
fr: Prise en charge de 'JavaScript, CSS/SCSS, HTML, XML' et d'autres outils de développement internet

source: WebTools
fr: Outils Internet

source: Enable Word Completion plugin?
fr: Activer l'extension de complétion de mots ?

source: Starts With
fr: Débute par

source: Contains
fr: Contient

source: Comparison Method
fr: Méthode de comparaison

source: Select the word completion comparison method: "Starts With" - suggest all words that starts with the partial word that the user typed "Contains" - suggest all words that contains the partial word that the user typed
fr: Sélectionnez la méthode de comparaison des mots complétés : « Commence par » - suggère tous les mots qui commencent par le mot partiel que l'utilisateur a saisi. « Contient » - propose tous les mots qui contiennent le mot partiel saisi par l'utilisateur

source: Word Completion Settings
fr: Paramètres de complétion des mots

source: Suggest completion based on words typed in the editors
fr: Suggère des compléments en fonction des mots tapés dans les éditeurs

source: Suggest completion based on words typed in the editor
fr: Suggérer des compléments en fonction des mots tapés dans l'éditeur

source: Word Completion
fr: Compléter un mot

source: Enable ZoomNavigator
fr: Activer le zoom du navigateur

source: Highlight colour:
fr: Couleur de surbrillance :

source: Zoom factor:
fr: Facteur d'agrandissement :

source: Sets the preview pane zoom factor. Valid values should be in the range of -10 and 20
fr: Définit le facteur de zoom du volet de prévisualisation. Les valeurs valides doivent être comprises entre -10 et 20

source: Use vertical scrollbar:
fr: Utiliser la barre de défilement verticale :

source: ZoomNavigator Settings
fr: Paramètres du zoom du navigateur

source: Zoom Navigator
fr: Zoom du navigateur

source: A dockable pane that shows a zoomed-out view of your code.
fr: Un volet ancrable qui affiche une vue agrandie de votre code.

source: Enable plugin
fr: Activer l'extension

source: Abbreviation plugin
fr: Extension pour les abréviations

source: Show abbreviations completion box
fr: Afficher la boîte de complétion des abréviations

source: Abbreviation
fr: Abréviation

source: Abbreviations
fr: Abréviations

source: You can use the '|' (pipe) character to set the caret position You may also use any of the known macros to CodeLite (click the 'Help' button)
fr: Vous pouvez utiliser le caractère '|' (pipe) pour définir la position du curseur. Vous pouvez également utiliser l'une des macros connues de 'CodeLite' (cliquez sur le bouton « Aide »).

source: Create a new abbreviation
fr: Créer une nouvelle abréviation

source: Delete the currently selected abbreviation
fr: Supprimer l'abréviation sélectionnée

source: Import abbreviations from the file system...
fr: Importer des abréviations à partir du système de fichiers...

source: Export
fr: Exporter

source: Export abbreviations to the file system...
fr: Exporter les abréviations vers le système de fichiers...

source: Immediate Insert
fr: Insertion immédiate

source: Save changes
fr: Sauvegarder les changements

source: Show available macros
fr: Montrer les macros disponibles

source: Abbreviations Settings...
fr: Abréviations Paramètres...

source: Abbreviation Name:
fr: Nom de l'abréviation :

source: New abbreviation...
fr: Nouvelle abréviation...

source: An abbreviation with this name already exists!
fr: Une abréviation de ce nom existe déjà !

source: Are you sure you want to delete '%s'
fr: Êtes-vous sûr de vouloir supprimer « %s » ?

source: This folder already contains a file named 'abbreviations.conf' - would you like to overwrite it?
fr: Ce dossier contient déjà un fichier nommé 'abbreviations.conf' - souhaitez-vous l'écraser ?

source: Abbreviations were exported to '
fr: Les abréviations ont été exportées vers '

source: The file does not seem to contain a valid abbreviations entries
fr: Le fichier ne semble pas contenir d'entrées d'abréviations valides

source: Abbreviations imported successfully!
fr: Les abréviations ont été importées avec succès !

source: Remote folder path:
fr: Chemin du dossier distant :

source: Connect
fr: Connecter

source: Disconnect
fr: Déconnexion

source: List folders
fr: Lister les dossiers

source: Input folder:
fr: Dossier d'entrée :

source: Output folder:
fr: Dossier de sortie :

source: Generate Themes
fr: Générer des thèmes

source: A makefile generator based on codelite's workspace
fr: Un générateur de 'makefile' basé sur l'espace de travail de 'codelite'
