Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Set the IDE global colour This colour affects various controls
fr: Définir la couleur globale de l'IDE Cette couleur affecte différents contrôles

source: Should CodeLite use TABS or SPACES for indentation?
fr: 'CodeLite' doit-il utiliser les 'TABULATIONS' ou les ESPACES pour l'indentation ?

source: Whitespace & Indentation
fr: Espaces et indentation

source: Indent using SPACES
fr: Indentation à l'aide d'espaces

source: Indent using TABS
fr: Indentation en utilisant les tabulations

source: Whitespace Visibility:
fr: Visibilité des espaces :

source: By:
fr: Par :

source: System Default
fr: Système par défaut

source: Dark
fr: Sombre

source: Grey
fr: Gris

source: Light
fr: Maigre

source: You can always run this setup wizard from the menu: Help -> Run the Setup Wizard
fr: Vous pouvez toujours lancer cet assistant de configuration à partir du menu : Aide -> Exécuter l'assistant d'installation

source: Spacer
fr: Espaceur

source: Separator
fr: Séparateur

source: CodeLite - Diff View
fr: 'CodeLite' - Voir les différences

source: ' to the clipboard
fr: vers le presse-papiers

source: Copy '
fr: Copier '

source: ' copied!
fr: copié !

source: File system scan completed
fr: L'analyse du système de fichiers est terminée

source: File System Workspace
fr: Espace de travail du système de fichiers

source: You should have at least one workspace configuration. 0 found Open the project settings and add one
fr: Vous devez avoir au moins une configuration d'espace de travail. 0 trouvé Ouvrez les paramètres du projet et ajoutez-en un

source: Don't know how to run '
fr: Ne pas savoir comment lancer '

source: Unable to create a workspace on the root folder
fr: Impossible de créer un espace de travail sur le dossier racine

source: Workspace Name
fr: Nom de l'espace de travail

source: Successfully generated file:
fr: Fichier généré avec succès :

source: Choosing 'Yes' will delete workspace configuration '
fr: Le choix de « Oui » supprimera la configuration de l'espace de travail.

source: Continue?
fr: Poursuivre ?

source: Program:
fr: Programme :

source: File extensions:
fr: Extensions de fichiers :

source: Set the file extensions to be parsed in this workspace
fr: Définir les extensions de fichiers à analyser dans cet espace de travail espace de travail

source: Exclude files:
fr: Fichiers exclus :

source: Files matching this pattern will not be displayed in the tree view
fr: Les fichiers correspondant à ce modèle ne seront pas affichés dans l'arborescence

source: Exclude paths:
fr: Chemins exclus :

source: Add here list of paths to be ignored. The path is expected to be relative to the root folder of the workspace Ignored paths will still be visible in the tree, but they will not be used in workspace operations (find in files, code completion etc)
fr: Ajouter ici une liste de chemins à ignorer. Le chemin doit être relatif au dossier racine de l'espace de travail. Les chemins ignorés seront toujours visibles dans l'arbre, mais ils ne seront pas utilisés dans les opérations de l'espace de travail (recherche dans les fichiers, complétion de code, etc.). utilisés dans les opérations de l'espace de travail (recherche dans les fichiers, achèvement du code, etc.).

source: Tool chain:
fr: Chaîne d'outils :

source: Select the toolchain to use
fr: Sélectionner la chaîne d'outils à utiliser

source: Target Name
fr: Nom de la cible

source: Path to debugger executable Leave empty to use the defaults
fr: Chemin d'accès à l'exécutable du débogueur Laisser vide pour utiliser les valeurs par défaut

source: Append the content here to the startup script, such as ~/.gdbinit
fr: Ajoutez le contenu ici au script de démarrage, tel que '~/.gdbinit'

source: Place your build flags one-per-line here
fr: Placez ici vos drapeaux de construction, un par ligne

source: Place your build flags one-per-line here. For example: -I/home/eran/include -I/home/eran/wx/include -DSOME=1 These flags will be used by CodeLite for better code completion
fr: Placez ici vos drapeaux de construction, un par ligne. Par exemple : '-I/home/eran/include -I/home/eran/wx/include -DSOME=1' Ces drapeaux seront utilisés par 'CodeLite' pour un meilleur achèvement du code

source: Environment variables:
fr: Variables d'environnement :

source: Remote
fr: Distant

source: Enable remote development
fr: Permettre le développement à distance

source: Remote folder:
fr: Dossier distant :

source: Use remote build
fr: Utiliser la construction distante

source: Execute the build commands on the remote machine
fr: Exécuter les commandes de construction sur la machine distante

source: Workspace path:
fr: Chemin d'accès à l'espace de travail :

source: Workspace name:
fr: Nom de l'espace de travail :

source: Copy from:
fr: Copie de :

source: Create workspace
fr: Créer un espace de travail

source: New Configurtion
fr: Nouvelle configuration

source: Build active project
fr: Construire un projet actif

source: Stop current build
fr: Arrêter la construction en cours

source: Add path to code completion
fr: Ajouter un chemin d'accès à l'achèvement du code

source: Generate compile_flags.txt file...
fr: Générer le fichier 'compile_flags.txt'...

source: Exclude this folder
fr: Exclure ce dossier

source: Current Tab > Close Tabs To The Right
fr: Onglet actuel > Fermer les onglets à droite

source: Current Tab > Close Other Tabs
fr: Onglet actuel > Fermer les autres onglets

source: Current Tab > Duplicate Tab
fr: Onglet actuel > Onglet dupliqué

source: Current Tab > Make it Read Only
fr: Onglet actuel > Mettre en lecture seule

source: Current Tab > Detach
fr: Onglet actuel > Détacher

source: Current Tab > Open Shell Here
fr: Onglet actuel > Ouvrir le 'shell' ici

source: Current Tab > Open in File Explorer
fr: Onglet actuel > Ouvrir dans l'explorateur de fichiers

source: Current Tab > Copy file name
fr: Onglet actuel > Copier le nom du fichier

source: Current Tab > Copy fullpath (name, extension and directory)
fr: Onglet actuel > Copier le chemin complet (nom, extension et répertoire)

source: Current Tab > Copy Path only (directory part only)
fr: Onglet actuel > Copier le chemin uniquement (partie du répertoire uniquement)

source: Current Tab > Copy full path relative to workspace
fr: Onglet actuel > Copier le chemin complet relatif à l'espace de travail

source: Replace In Selection
fr: Remplacer dans la sélection

source: No match found
fr: Aucune correspondance trouvée

source: result
fr: résultat

source: results
fr: résultats

source: Found and replaced
fr: Trouve et remplacé

source: Property Name
fr: Nom de la propriété

source: Property Value
fr: Valeur de la propriété

source: Choose a number
fr: Choisir un nombre

source: Could not find SSH account:
fr: Impossible de trouver le compte 'SSH':

source: Could not locate ssh executable
fr: Impossible de localiser l'exécutable 'ssh'

source: Download and Open Containing Folder...
fr: Télécharger et ouvrir le dossier contenant...

source: Create a new directory...
fr: Créer un nouveau répertoire...

source: Create a new folder
fr: Créer un nouveau dossier

source: New folder name
fr: Nouveau nom de dossier

source: Create a new file...
fr: Créer un nouveau fichier...

source: Create a new file
fr: Créer un nouveau fichier

source: New file name
fr: Nouveau nom de fichier

source: Copy path
fr: Copier le chemin

source: Path copied to clipboard
fr: Chemin copié dans le presse-papiers

source: New name:
fr: Nouveau nom :

source: Renaming
fr: Renommage

source: Are you sure you want to delete the selected items?
fr: Êtes-vous sûr de vouloir supprimer les éléments sélectionnés ?

source: No such directory
fr: Aucun répertoire de ce type

source: Can not set new root directory:
fr: Impossible de définir un nouveau répertoire racine :

source: Inspect Variable
fr: Inspecter la variable

source: saved
fr: sauvegardé

source: SFTP error: failed to save file.
fr: Erreur 'SFTP' : échec de l'enregistrement du fichier.

source: Select Symbol
fr: Sélectionner un symbole

source: Build ended with errors Click to view
fr: La construction s'est terminée par des erreurs Cliquez pour voir

source: Build ended with warnings Click to view
fr: La construction s'est terminée par des avertissements Cliquez pour voir

source: Build is in progress Click to view the Build Log
fr: La construction est en cours Cliquez pour afficher le journal de construction

source: Language
fr: Langage

source: Colour Themes
fr: Thèmes de couleur

source: Convert Indentations to Tabs
fr: Convertir les indentations en tabulations

source: Convert Indentations to Spaces
fr: Convertir les indentations en espaces

source: Use Tabs
fr: Utiliser des onglets

source: Use Spaces
fr: Utiliser les espaces

source: Use Linux Format (LF)
fr: Utiliser le format 'Linux' (LF)

source: Use Windows Format (CRLF)
fr: Utiliser le format 'Windows' (CRLF)

source: Convert to Linux Format
fr: Convertir au format 'Linux'

source: Set Syntax:
fr: Définir Syntaxe :

source: Select Theme:
fr: Sélectionnez un thème :

source: Tasks
fr: Tâches

source: References
fr: Références

source: Showing entries from:
fr: Affichage des entrées de :

source: entries
fr: entrées

source: Customise...
fr: Personnaliser ...

source: Fold Tree
fr: Repliage de l'arbre

source: Folders
fr: Dossiers

source: New Folder
fr: Nouveau dossier

source: Find in Files
fr: Rechercher dans les fichiers

source: Open with default application
fr: Ouvrir avec l'application par défaut

source: Open Folder...
fr: Ouvrir le dossier...

source: Set the file name:
fr: Définir le nom du fichier :

source: Set the folder name:
fr: Définir le nom du dossier :

source: New Name:
fr: Nouveau nom :

source: Rename File
fr: Renommer le fichier

source: Rename folder
fr: Renommer le dossier

source: Type the new folder name:
fr: Tapez le nouveau nom du dossier :

source: Cant find project:
fr: Impossible de trouver le projet :

source: Sorry, there is no 'Clean' command available
fr: Désolé, il n'y a pas de commande « Nettoyer » disponible.

source: Sorry, couldn't find the Build configuration
fr: Désolé, je n'ai pas trouvé la configuration de construction

source: , process terminated with exit code: 0
fr: Le processus s'est terminé avec un code de sortie : 0

source: Failed to start clean process, command:
fr: Échec du démarrage du processus de nettoyage, commande :

source: The following environment variables are used in the project, but are not defined:
fr: Les variables d'environnement suivantes sont utilisées dans le projet, mais ne sont pas définies :

source: Build anyway?
fr: Construire de toute façon ?

source: Build Cancelled!
fr: La construction est annulée !

source: Command line is empty. Build aborted.
fr: La ligne de commande est vide. La construction a été interrompue.

source: Failed to start build process, command:
fr: Échec du démarrage du processus de construction, commande :

source: Interrupted
fr: Interrompu

source: MESSAGE: Entering directory `%s'
fr: MESSAGE : Entrée dans le répertoire `%s'

source: Browse for folder...
fr: Rechercher un dossier...

source: Select a folder:
fr: Choisir un dossier :

source: Select a file:
fr: Choisir un fichier :

source: Available Macros
fr: Macros disponibles

source: Copy macro name
fr: Copier le nom de la macro

source: Expands to the selected text in the active editor
fr: S'étend au texte sélectionné dans l'éditeur actif

source: Expands to the selected text range in bytes from beginning of file, eg. 150:200
fr: S'étend à la plage de texte sélectionnée en octets à partir du début du fichier, par exemple 150:200

source: Expands to the project binary output file
fr: Expansion vers le fichier de sortie binaire du projet

source: Expands to the project's build working directory
fr: S'étend au répertoire de travail de construction du projet

source: Expands to the project's run working directory
fr: S'étend au répertoire de travail d'exécution du projet

source: Expands to project's path
fr: S'étend au chemin d'accès du projet

source: Expands to workspace's path
fr: S'étend au chemin d'accès de l'espace de travail

source: Expands to the workspace selected configuration
fr: S'étend à la configuration de l'espace de travail sélectionné

source: Expands to the current project name as appears in the 'File View'
fr: S'étend au nom du projet actuel tel qu'il apparaît dans la « Vue fichier

source: Expands to the current project intermediate directory path, as set in the project settings
fr: S'étend au chemin du répertoire intermédiaire du projet actuel, tel que défini dans les paramètres du projet

source: Expands to the current project selected configuration
fr: S'étend à la configuration sélectionnée pour le projet en cours

source: An alias to $(IntermediateDirectory)
fr: Un alias de '$(IntermediateDirectory)'

source: Expands to current file name (without extension and path)
fr: Développe le nom du fichier actuel (sans l'extension et le chemin d'accès)

source: Expands to current file path
fr: Expansion vers le chemin d'accès au fichier actuel

source: Expands to current file full path (path and full name)
fr: Expansion vers le chemin d'accès complet du fichier actuel (chemin d'accès et nom complet)

source: Expands to current file full name (name and extension)
fr: Expansion vers le nom complet du fichier actuel (nom et extension)

source: Expands to logged-in user as defined by the OS
fr: S'étend à l'utilisateur connecté tel que défini par le système d'exploitation

source: Expands to current date
fr: Extension à la date du jour

source: Expands to CodeLite's startup directory on (e.g. on Unix it expands to ~/.codelite/)
fr: S'étend au répertoire de démarrage de 'CodeLite' (par exemple, sous 'Unix', il s'étend à '~/.codelite/').

source: A space delimited string containing all of the project files in a relative path to the project file
fr: Une chaîne de caractères délimitée par des espaces contenant tous les fichiers du projet dans un chemin relatif au fichier du projet

source: A space delimited string containing all of the project files in an absolute path
fr: Une chaîne de caractères délimitée par des espaces contenant tous les fichiers du projet dans un chemin d'accès absolu

source: backticks: evaluates the expression inside the backticks into a string
fr: crochets : évalue l'expression à l'intérieur des crochets en une chaîne de caractères

source: The directory part of $(OutputFile)
fr: La partie répertoire de '$(OutputFile)'

source: The output file
fr: Le fichier de sortie

source: The program to run
fr: Le programme à lancer

source: Expands to the compiler name as set in the Tools tab
fr: S'étend au nom du compilateur tel qu'il est défini dans l'onglet Outils

source: Expands to the source switch (usually, -c)
fr: S'étend au commutateur source (habituellement, -c)

source: The file full path (includes path+name+extension)
fr: Le chemin d'accès complet du fichier (chemin+nom+extension)

source: The file full name (includes name+extension)
fr: Le nom complet du fichier (y compris le nom et l'extension)

source: The file name (name only)
fr: Le nom du fichier (nom uniquement)

source: The file's path with UNIX slashes, including terminating separator
fr: Le chemin d'accès au fichier avec des barres obliques 'UNIX', y compris le séparateur de fin

source: Expands to the compiler options as set in the project settings
fr: S'étend aux options du compilateur telles qu'elles ont été définies dans les paramètres du projet

source: Expands to the resource compiler name
fr: S'étend au nom du compilateur de ressources

source: Expands to the linker name as set in the Tools tab
fr: S'étend au nom de l'éditeur de liens tel qu'il est défini dans l'onglet Outils

source: Expands to the archive tool (e.g. ar) name as set in the Tools tab
fr: S'étend au nom de l'outil d'archivage (par exemple, 'ar') tel que défini dans l'onglet Outils

source: Expands to the shared object linker name as set in the Tools tab
fr: S'étend au nom de l'éditeur de liens de l'objet partagé tel qu'il est défini dans l'onglet Outils

source: Objects suffix (usually set to .o)
fr: Suffixe des objets (généralement '.o')

source: The object name (without the suffix)
fr: Le nom de l'objet (sans le suffixe)

source: Objects suffix (usually set to .o.d)
fr: Suffixe des objets (généralement défini sur .o.d)

source: Objects suffix (usually set to .o.i)
fr: Suffixe des objets (généralement défini à .o.i)

source: The compiler include switch
fr: Le compilateur inclus les commutateurs

source: The library switch (e.g. -l)
fr: Le commutateur de bibliothèque (par exemple -l)

source: The output switch (e.g. -o)
fr: Le commutateur de sortie (par exemple -o)

source: Library switch (e.g. -L)
fr: Commutateur de bibliothèque (par exemple -L)

source: Preprocessor switch (e.g. -D)
fr: Commutateur du préprocesseur (par exemple -D)

source: Expands to all preprocessors set in the project setting where each entry is prefixed with $(PreprocessorSwitch)
fr: S'étend à tous les préprocesseurs définis dans les paramètres du projet où chaque entrée est préfixée par '$(PreprocessorSwitch)'

source: Archive switch, usually not needed (VC compiler sets it to /OUT:)
fr: Commutateur d'archive, généralement inutile (le compilateur 'VC' le met à '/OUT' :)

source: The compiler preprocess-only switch (e.g. -E)
fr: Le commutateur de pré-processus du compilateur (par exemple -E)

source: The linker options as set in the project settings
fr: Les options de l'éditeur de liens telles que définies dans les paramètres du projet

source: All include paths prefixed with $(IncludeSwitch)
fr: Tous les chemins d'inclusion préfixés par '$(IncludeSwitch)'

source: Resource compiler include path as set in the project settings
fr: Chemin d'inclusion du compilateur de ressources tel que défini dans les paramètres du projet

source: List of libraries to link with. Each library is prefixed with $(LibrarySwitch)
fr: Liste des bibliothèques à lier. Chaque bibliothèque est préfixée par' $(LibrarySwitch)'

source: List of library paths to link with. Each library is prefixed with $(LibraryPathSwitch)
fr: Liste des chemins d'accès aux bibliothèques à utiliser pour l'édition de liens. Chaque bibliothèque est préfixée par '$(LibraryPathSwitch)'

source: The directory part of $(ProjectOutputFile)
fr: La partie répertoire de '$(ProjectOutputFile)'

source: The output file, same as $(ProjectOutputFile)
fr: Le fichier de sortie, identique à '$(ProjectOutputFile)'

source: Invalid memory value: %s
fr: Valeur de mémoire non valide : %s

source: Address:
fr: Adresse :

source: Address or pointer to watch
fr: Adresse ou pointeur de surveillance

source: Size:
fr: Taille :

source: Memory size to view
fr: Taille de la mémoire à visualiser

source: Number of columns:
fr: Nombre de colonnes :

source: Number of columns to use per row
fr: Nombre de colonnes à utiliser par ligne

source: Evaluate
fr: Évaluer

source: Evaluate the expression in the "Address" field
fr: Évaluer l'expression dans le champ « Adresse »

source: Update
fr: Actualiser

source: Update the memory in the main display area to apply your changes
fr: Mettez à jour la mémoire dans la zone d'affichage principale pour appliquer vos modifications

source: Project name:
fr: Nom de projet :

source: Give a name to the template
fr: Donner un nom au modèle

source: Project category:
fr: Catégorie de projet :

source: Choose a category for this template
fr: Choisissez une catégorie pour ce modèle

source: Set a description to this template
fr: Attribuer une description à ce modèle

source: Save Project As Template
fr: Enregistrer le projet en tant que modèle

source: END
fr: FIN

source: NEXT
fr: SUIVANTE

source: Select a Keyboard Shortcut
fr: Sélectionner un raccourci clavier

source: Open resource...
fr: Ouvrir une ressource ...

source: Type resource name to open. You may use a space delimited list of words to narrow down the list of choices e.g. Typing: 'Open Dialog' will include results that contain both words "Open" _and_ "Dialog"
fr: Tapez le nom de la ressource à ouvrir. Vous pouvez utiliser une liste de mots délimitée par des espaces pour réduire la liste des choix. Par exemple, si vous tapez : « Ouvrir dialogue », vous obtiendrez les résultats qui contiennent les deux mots « Ouvrir » _et_ « Dialogue ».

source: Show &files
fr: Afficher les &fichiers

source: Show &symbols
fr: Afficher les &symboles

source: Open Resource
fr: Ouvrir une Ressource

source: Replace With:
fr: Remplacer par :

source: The following files will be updated:
fr: Les fichiers suivants seront mis à jour :

source: Included From:
fr: Inclus à partir de :

source: Line:
fr: Ligne :

source: Fix Include Statement
fr: Corriger la déclaration d'inclusion

source: Account
fr: Compte

source: Host
fr: Hôte

source: User
fr: Utilisateur

source: Add new account
fr: Ajouter un nouveau compte

source: Delete the selected accounts
fr: Supprimer les comptes sélectionnés

source: Edit the selected account
fr: Modifier le compte choisi

source: Account Name:
fr: Nom du compte :

source: Give this account a unique name
fr: Donner un nom unique à ce compte

source: Host / IP:
fr: Hôte / 'IP' :

source: The remote host ip address or its known name
fr: L'adresse 'IP' de l'hôte distant ou son nom connu

source: The SSH port. If you don't know it, leave it as 22 (SSH default port)
fr: Le port 'SSH'. Si vous ne le connaissez pas, laissez-le à 22 (port 'SSH' par défaut).

source: Username:
fr: Nom utilisateur :

source: Login user name
fr: Nom d'utilisateur

source: This field is optional. By leaving this field empty, codelite will attempt to connect only using public key authentication
fr: Ce champ est facultatif. En laissant ce champ vide, 'Codelite' tentera de se connecter uniquement en utilisant l'authentification par clé publique

source: Default folder:
fr: Dossier par défaut :

source: Set the home folder for this account
fr: Définir le dossier personnel de ce compte

source: Test Connection
fr: Connexion de test

source: Account:
fr: Compte :

source: Set the remote folder to browse and click on the 'Refresh' button
fr: Définissez le dossier distant à parcourir et cliquez sur le bouton « Rafraîchir »

source: Find:
fr: Rechercher :

source: File types:
fr: Types de fichiers:

source: Case sensitive
fr: Sensible à la casse

source: SSH Account Manager
fr: Gestionnaire de compte 'SSH'

source: Add Account
fr: Ajouter un compte

source: SFTP Browser
fr: Navigateur 'SFTP'

source: Remote Find In Files
fr: Recherche à distance dans les fichiers

source: Global Functions and Variables
fr: Fonctions et variables globales

source: Functions Prototypes
fr: Prototypes de fonctions

source: Redo
fr: Refaire

source: Undo
fr: Défaire

source: Undo/Redo to a pre&viously labelled state
fr: Annuler / Rétablir un état précédemment étiqueté

source: AddProjectToBuildMatrix was called with NULL project
fr: 'AddProjectToBuildMatrix' a été appelé avec un projet 'NULL'

source: No workspace open
fr: Aucun espace de travail ouvert

source: Failed to load project file:
fr: Échec du chargement du fichier de projet :

source: Failed to save workspace file to disk. Please check that you have permission to write to disk
fr: Échec de l'enregistrement du fichier de l'espace de travail sur le disque. Veuillez vérifier que vous avez l'autorisation d'écrire sur le disque

source: Malformed project name
fr: Nom de projet mal formé

source: No such project
fr: Aucun projet de ce type

source: File removal failed
fr: Échec de la suppression du fichier

source: Could not open workspace file: '%s'
fr: Impossible d'ouvrir le fichier de l'espace de travail : '%s'

source: Corrupted workspace file
fr: Fichier d'espace de travail corrompu

source: Caption
fr: Intitulé

source: Modified
fr: Modifié

source: Text
fr: Texte

source: Edit Text
fr: Éditer le texte

source: Select Tab
fr: Sélectionner un onglet
