Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Respond to a wxEVT_COMMAND_TEXT_UPDATED event, generated when the text changes. Notice that this event will be sent when the text controls contents changes - whether this is due to user input or comes from the program itself (for example, if SetValue() is called); see ChangeValue() for a function which does not send this event.
fr: Répond à un événement 'wxEVT_COMMAND_TEXT_UPDATED', généré lorsque le texte est modifié. Notez que cet événement est envoyé lorsque le contenu du contrôle de texte change, qu'il s'agisse d'une saisie de l'utilisateur ou d'une action du programme lui-même. - qu'il s'agisse d'une saisie de l'utilisateur ou d'une action du programme lui-même (par exemple, si 'SetValue()' est appelé) ; voir 'ChangeValue()' pour une fonction qui n'envoie pas cet événement.

source: Respond to a wxEVT_COMMAND_TEXT_ENTER event, generated when enter is pressed in a text control (which must have wxTE_PROCESS_ENTER style for this event to be generated).
fr: Répond à un événement 'wxEVT_COMMAND_TEXT_ENTER', généré lorsque l'on appuie sur Entrée dans un contrôle de texte (qui doit avoir le style 'wxTE_PROCESS_ENTER' pour que cet événement soit généré).

source: Process wxEVT_SCROLL_TOP scroll-to-top events (minimum position)
fr: Traite les événements 'wxEVT_SCROLL_TOP' de défilement vers le haut (position minimale)

source: Process wxEVT_SCROLL_BOTTOM scroll-to-bottom events (maximum position).
fr: Traite les événements de défilement de 'wxEVT_SCROLL_BOTTOM' vers le bas (position maximale).

source: Process wxEVT_SCROLL_LINEUP line up events.
fr: Traite les événements de ligne 'wxEVT_SCROLL_LINEUP'.

source: Process wxEVT_SCROLL_LINEDOWN line down events.
fr: Traite les événements de descente de ligne 'wxEVT_SCROLL_LINEDOWN'.

source: Process wxEVT_SCROLL_PAGEUP page up events.
fr: Traite les événements de montée de page de 'wxEVT_SCROLL_PAGEUP'.

source: Process wxEVT_SCROLL_PAGEDOWN page down events
fr: Traitement des événements de descente de page 'wxEVT_SCROLL_PAGEDOWN'

source: Process wxEVT_SCROLL_THUMBTRACK thumbtrack events (frequent events sent as the user drags the thumbtrack).
fr: Traite les événements 'wxEVT_SCROLL_THUMBTRACK' de la piste du pouce (événements fréquents envoyés lorsque l'utilisateur fait glisser la piste du pouce).

source: Process wxEVT_SCROLL_THUMBRELEASE thumb release events.
fr: Traite les événements de relâchement du pouce 'wxEVT_SCROLL_THUMBRELEASE'.

source: Process wxEVT_SCROLL_CHANGED end of scrolling events (MSW only).
fr: Traite les événements de fin de défilement 'wxEVT_SCROLL_CHANGED' ('MSW' uniquement).

source: The position of the scrollbar in scroll units.
fr: La position de la barre de défilement en unités de défilement.

source: The size of the thumb, or visible portion of the scrollbar, in scroll units.
fr: Taille du pouce, ou partie visible de la barre de défilement, en unités de défilement.

source: The maximum position of the scrollbar.
fr: La position maximale de la barre de défilement.

source: The size of the page size in scroll units. This is the number of units the scrollbar will scroll when it is paged up or down. Often it is the same as the thumb size.
fr: Taille de la page en unités de défilement. Il s'agit du nombre d'unités que la barre de défilement fera défiler lorsqu'elle est paginée vers le haut ou vers le bas. Il s'agit souvent de la même taille que celle du pouce.

source: Pixels per scroll unit in the horizontal direction
fr: Points par unité de défilement dans le sens horizontal

source: Pixels per scroll unit in the vertical direction
fr: Points par unité de défilement dans le sens vertical

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_TOP scroll-to-top events
fr: Depuis 'wxWidgets 2.9.X' Traite les événements de défilement vers le haut de 'wxEVT_SCROLLWIN_TOP'

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_BOTTOM scroll-to-bottom events
fr: Depuis 'wxWidgets 2.9.X' Traite les événements de défilement vers le bas de 'wxEVT_SCROLLWIN_BOTTOM'

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_LINEUP line up events.
fr: Depuis 'wxWidgets 2.9.X' Traite les événements 'wxEVT_SCROLLWIN_LINEUP de mise en ligne.

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_LINEDOWN line down events
fr: Depuis 'wxWidgets 2.9.X' Traiter les événements de descente de ligne 'wxEVT_SCROLLWIN_LINEDOWN'

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_PAGEUP page up events
fr: Depuis 'wxWidgets 2.9.X' Traite les événements de montée de page 'wxEVT_SCROLLWIN_PAGEUP'

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_PAGEDOWN page down events
fr: Depuis wxWidgets 2.9.X Traite les événements de descente de page 'wxEVT_SCROLLWIN_PAGEDOWN

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_THUMBTRACK thumbtrack events (frequent events sent as the user drags the thumbtrack)
fr: Depuis 'wxWidgets 2.9.X Traite les événements 'wxEVT_SCROLLWIN_THUMBTRACK thumbtrack' (événements fréquents envoyés lorsque l'utilisateur fait glisser le 'thumbtrack')

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_THUMBRELEASE thumb release events
fr: Depuis 'wxWidgets 2.9.X' Traiter les événements de relâchement du pouce 'wxEVT_SCROLLWIN_THUMBRELEASE'

source: Default text value.
fr: Valeur du texte par défaut.

source: Show the 'Cancel' button
fr: Afficher le bouton 'Annuler'

source: Show the 'Search' button
fr: Afficher le bouton 'Rechercher'

source: Respond to a wxEVT_COMMAND_SEARCHCTRL_SEARCH_BTN event generated when the search button is clicked. Note that this does not initiate a search.
fr: Répond à un événement 'wxEVT_COMMAND_SEARCHCTRL_SEARCH_BTN' généré lorsque le bouton de recherche est cliqué. Notez que cela ne déclenche pas de recherche.

source: Respond to a wxEVT_COMMAND_SEARCHCTRL_CANCEL_BTN event, generated when the cancel button is clicked.
fr: Répond à un événement 'wxEVT_COMMAND_SEARCHCTRL_CANCEL_BTN', généré lorsque le bouton d'annulation est cliqué.

source: Set the same effect to use for both showing and hiding the pages
fr: Définir le même effet à utiliser pour l'affichage et le masquage des pages

source: Minimum slider value
fr: Valeur minimale de la glissière

source: Maximum slider value
fr: Valeur maximale de la glissière

source: The spacer's size: width,height
fr: Taille de l'espaceur : largeur, hauteur

source: Generated when left/up arrow is pressed.
fr: Généré lorsque l'on appuie sur la flèche gauche/haut.

source: Generated when right/down arrow is pressed.
fr: Généré lorsque l'on appuie sur la flèche droite/bas.

source: Generated whenever an arrow is pressed.
fr: Généré chaque fois qu'une flèche est pressée.

source: The initial value
fr: La valeur initiale

source: Minimal value
fr: Valeur minimale

source: Maximal value
fr: Valeur maximale

source: Generated whenever the numeric value of the spinctrl is updated
fr: Généré à chaque fois que la valeur numérique du contrôle rotatif est mise à jour

source: Sets the split mode
fr: Définit le mode de partage

source: Gravity is real factor which controls position of sash while resizing wxSplitterWindow.
fr: La gravité est un facteur réel qui contrôle la position de l'ouvrant lors du redimensionnement de 'wxSplitterWindow'.

source: Gravity tells wxSplitterWindow how much will left/top window grow while resizing.
fr: La gravité indique à 'wxSplitterWindow 'de combien les fenêtres gauche et supérieure vont s'agrandir lors du redimensionnement.

source: 0.0 - only the bottom/right window is automatically resized
fr: 0.0 - seule la fenêtre inférieure/droite est automatiquement redimensionnée

source: Example values:
fr: Exemples de valeurs :

source: 0.5 - both windows grow by equal size
fr: 0,5 - les deux fenêtres s'agrandissent de la même manière

source: 1.0 - only left/top window grows
fr: 1.0 - Seules les fenêtres gauche et supérieure s'agrandissent

source: (Gravity should be a real value between 0.0 and 1.0)
fr: (La gravité doit être une valeur réelle comprise entre 0,0 et 1,0)

source: Sets the minimum pane size
fr: Définit la taille minimale du volet

source: Sets the sash initial position
fr: Définit la position initiale du vantail

source: The sash position is in the process of being changed
fr: La guichet est en cours de modification

source: The sash position was changed
fr: La position du guichet a été modifiée

source: The splitter has been just unsplit
fr: Le séparateur n'a pas été divisé

source: The sash was double clicked. The default behaviour is to unsplit the window when this happens (unless the minimum pane size has been set to a value greater than zero)
fr: Le guichet a été doublement cliqué. Le comportement par défaut consiste à découper la fenêtre lorsque cela se produit (sauf si la taille minimale de la fenêtre a été fixée à une valeur supérieure à zéro).

source: Label:
fr: Intitulé :

source: Wrap the text after N pixels. If set to -1, don't wrap
fr: Encadrer le texte après N pixels. Si la valeur est -1, le texte n'est pas enveloppé

source: Sets the number of fields
fr: Fixe le nombre de champs

source: If you used SCI_SETLEXER(SCLEX_CONTAINER) to make the container act as the lexer you will receive this notification when Scintilla is about to display or print text that requires styling
fr: Si vous avez utilisé 'SCI_SETLEXER(SCLEX_CONTAINER)' pour que le conteneur joue le rôle de lexique, vous recevrez cette notification lorsque Scintilla est sur le point d'afficher ou d'imprimer du texte nécessitant une mise en forme. vous recevrez cette notification lorsque Scintilla est sur le point d'afficher ou d'imprimer un texte qui nécessite une stylisation

source: A char was added
fr: Un caractère a été ajouté

source: Sent to the container when the save point is entered allowing the container to display a "document saved" indicator and change its menus
fr: Envoyée au conteneur lorsque le point de sauvegarde est atteint permettant au conteneur d'afficher un indicateur « document sauvegardé » et de modifier ses menus

source: Sent to the container when the save point is left allowing the container to display a "document dirty" indicator and change its menus
fr: Envoyé au conteneur lorsque le point de sauvegarde est quitté permettant au conteneur d'afficher un indicateur « document sale » et de modifier ses menus

source: An attempt to modify a read-only document was made
fr: Une tentative de modification d'un document en lecture seule a été effectuée

source: Key was pressed
fr: La touche a été enfoncée

source: Double-click
fr: Double clic

source: Update UI
fr: Mise à jour de l'interface utilisateur

source: Document modified
fr: Document modifié

source: Macro record started/stopped
fr: Démarrage/arrêt de l'enregistrement macro

source: One of margins was left clicked with the mouse
fr: L'une des marges a été cliquée à gauche avec la souris

source: Scintilla has determined that a range of lines that is currently invisible should be made visible
fr: 'Scintilla' a déterminé qu'une gamme de lignes actuellement invisibles devrait être rendue visible

source: Painting has just been done. Useful when you want to update some other widgets based on a change in Scintilla but want to have the paint occur first to appear more responsive
fr: La décoration vient d'être faite. Utile lorsque vous souhaitez mettre à jour d'autres visuels en fonction d'un changement dans 'Scintilla' mais que l'on souhaite que la décoration se produise en premier pour paraître plus réactif

source: The user has selected an item in a user list.
fr: L'utilisateur a sélectionné un élément dans une liste d'utilisateurs.

source: Only on the GTK+ version. Indicates that the user has dragged a URI such as a file name or Web address onto Scintilla
fr: Uniquement sur la version 'GTK+'. Indique que l'utilisateur a fait glisser un URI tel qu'un nom de fichier ou une adresse internet sur 'Scintilla'

source: Generated when the user keeps the mouse in one position for the dwell period
fr: Généré lorsque l'utilisateur maintient la souris dans la même position pendant la période d'attente

source: Generated after a wxEVT_STC_DWELLSTART and the mouse is moved or other activity such as key press indicates the dwell is over
fr: Généré après un 'wxEVT_STC_DWELLSTART' et le déplacement de la souris ou une autre activité telle qu'une pression sur une touche indiquant que la durée est terminée

source: Drag and Drop start event
fr: Événement de démarrage par glisser-déposer

source: Drag and Drop over event
fr: Glisser-déposer sur l'événement

source: Drag and Drop drop event
fr: Événement de dépose par glisser-déposer

source: This event is generated when the user zooms the display using the keyboard
fr: Cet événement est généré lorsque l'utilisateur effectue un zoom sur l'écran à l'aide du clavier

source: A hotspot was clicked
fr: Un point d'accès a été cliqué

source: A hotspot was double clicked
fr: Un point d'accès a été doublement cliqué

source: The calltip window was clicked
fr: La fenêtre de l'infobulle a été cliquée

source: Auto-completion list selection was made
fr: La sélection de la liste liste d'achèvement a été effectuée

source: User clicked the mouse on a text that has an indicator
fr: L'utilisateur a cliqué avec la souris sur un texte comportant un indicateur

source: User released the mouse on a text that has an indicator
fr: L'utilisateur a relâché la souris sur un texte comportant un indicateur

source: Auto completion list was cancelled
fr: La liste d'achèvement automatique a été annulée

source: The user deleted a character while auto-completion list was active
fr: L'utilisateur a supprimé un caractère alors que la liste d'achèvement était active

source: Wrap text
fr: Encadrer le texte

source: Display indentation guides (vertical lines)
fr: Afficher les guides d'indentation (lignes verticales)

source: EOL Mode
fr: Mode fin de ligne

source: Display the line endings characters
fr: Afficher les caractères de fin de ligne

source: Set the wxStyledTextCtrl lexer. The lexer affects the syntax highlight of control
fr: Définit le lexique de 'wxStyledTextCtrl'. Le lexique affecte la mise en évidence de la syntaxe du contrôle

source: Set the basic styles font
fr: Définir la police des styles de base

source: Keywords
fr: Mots-clés

source: Keywords set 1
fr: Jeu de mots-clés 1

source: Keywords set 2
fr: Jeu de mots-clés 2

source: Keywords set 3
fr: Jeu de mots-clés 3

source: Keywords set 4
fr: Jeu de mots-clés 4

source: Keywords set 5
fr: Jeu de mots-clés 6

source: Set the wxTaskBarIcon tooltip
fr: Définir l'info-bulle de la 'wxTaskBarIcon'

source: The iconType is only applicable on wxOSX_Cocoa
fr: Le type d'icône ne s'applique qu'à 'wxOSX_Cocoa'

source: Set the wxTaskBarIcon icon
fr: Définir l'icône de la 'wxTaskBarIcon'

source: Process a wxEVT_TASKBAR_MOVE event
fr: Traitement d'un événement 'wxEVT_TASKBAR_MOVE event'

source: Process a wxEVT_TASKBAR_LEFT_DOWN event
fr: Traitement d'un événement 'wxEVT_TASKBAR_LEFT_DOWN'

source: Process a wxEVT_TASKBAR_LEFT_UP event
fr: Traitement d'un événement 'wxEVT_TASKBAR_LEFT_UP'

source: Process a wxEVT_TASKBAR_RIGHT_DOWN event
fr: Traitement d'un événement 'wxEVT_TASKBAR_RIGHT_DOWN'

source: Process a wxEVT_TASKBAR_RIGHT_UP event
fr: Traitement d'un événement 'wxEVT_TASKBAR_RIGHT_UP'

source: Process a wxEVT_TASKBAR_LEFT_DCLICK event
fr: Traiter un événement 'wxEVT_TASKBAR_LEFT_DCLICK'

source: Process a wxEVT_TASKBAR_RIGHT_DCLICK event
fr: Traiter un événement 'wxEVT_TASKBAR_RIGHT_DCLICK'

source: User tried to enter more text into the control than the limit set by SetMaxLength.
fr: L'utilisateur a essayé d'entrer plus de texte dans le contrôle que la limite fixée par 'SetMaxLength'.

source: A mouse event occurred over an URL in the text control (wxMSW and wxGTK2 only)
fr: Un événement souris s'est produit sur une URL dans le contrôle de texte ('wxMSW' et 'wxGTK2' uniquement).

source: Default text control value
fr: Valeur par défaut du contrôle de texte

source: The maximum length of user entered text. Only for single-line wxTextCtrls.
fr: Longueur maximale du texte saisi par l'utilisateur. Uniquement pour les 'wxTextCtrls' à ligne unique.

source: Enable spell checking using the operating system provided text proofing tools. This function is only available on OSX, Windows 8 (or newer), and GTK3 (or newer).
fr: Activer la vérification orthographique à l'aide des outils de vérification de texte fournis par le système d'exploitation. Cette fonction n'est disponible que sous 'OSX', 'Windows 8' (ou plus récent) et 'GTK3' (ou plus récent).

source: Enable auto-completion of the text using the file system directories. Notice that currently this function is only implemented in wxMSW port and does nothing under the other platforms.
fr: Active l'auto-complétion du texte en utilisant les répertoires du système de fichiers. Notez que cette fonction n'est actuellement implémentée que dans le portage 'wxMSW' et ne fait rien sous les autres plates-formes.

source: Enable auto-completion of the text typed in a single-line text control using all valid file system path. Notice that currently this function is only implemented in wxMSW port and does nothing under the other platforms.
fr: Active l'auto-complétion du texte tapé dans un contrôle de texte d'une seule ligne en utilisant tous les chemins d'accès valides du système de fichiers. Notez que cette fonction n'est actuellement implémentée que dans le portage 'wxMSW' et ne fait rien sous les autres plates-formes.

source: Control name
fr: Nom du contrôle

source: Sets the current interval for the timer (in milliseconds)
fr: Définit l'intervalle actuel de la minuterie (en millisecondes)

source: Start the timer
fr: Démarrer la minuterie

source: A one shot timer - sets whether the timer event is called repeatedly or only once
fr: Une minuterie unique - détermine si l'événement de la minuterie est appelé de manière répétée ou une seule fois

source: Process a timer event
fr: Traitement d'un événement de la minuterie

source: Process a wxEVT_COMMAND_TOOL_CLICKED event (a synonym for wxEVT_COMMAND_MENU_SELECTED). Pass the id of the tool
fr: Traite un événement 'wxEVT_COMMAND_TOOL_CLICKED' (synonyme de 'wxEVT_COMMAND_MENU_SELECTED''). Transmettre l'identifiant de l'outil

source: Process a wxEVT_COMMAND_TOOL_DROPDOWN_CLICKED event
fr: Traiter un événement 'wxEVT_COMMAND_TOOL_DROPDOWN_CLICKED'

source: ToolBar Item
fr: Élément de barre d'outils

source: The tool label
fr: L'étiquette de l'outil

source: Tool Label
fr: Étiquette de l'outil

source: Short help string. This will appear as the tool's tooltip
fr: Chaîne d'aide courte. Elle apparaîtra dans l'info-bulle de l'outil

source: Long help string. This will be displayed in the statusbar
fr: Chaîne d'aide longue. Elle sera affichée dans la barre d'état

source: Bitmap
fr: Image 'bitmap'

source: Disabled bitmap
fr: 'Bitmap' désactivé

source: The tool kind
fr: Le genre d'outil

source: Use wxCrafter to construct the menu called by the dropdown
fr: Utiliser 'wxCrafter' pour construire le menu appelé par le menu déroulant

source: Process a wxEVT_COMMAND_AUITOOLBAR_TOOL_DROPDOWN event
fr: Traiter un événement 'wxEVT_COMMAND_AUITOOLBAR_TOOL_DROPDOWN'

source: ToolBar Item Separator
fr: Séparateur d'éléments de la barre d'outils

source: ToolBar Item Space
fr: Espacement des éléments de la barre d'outils

source: AuiToolBar Item Space
fr: Espace des éléments de la barre d'outils 'Aui'

source: The width of the space in pixels
fr: Largeur de l'espace en pixels

source: How stretchable the space is. The normal value is 1.
fr: Le degré d'extensibilité de l'espace. La valeur normale est 1.

source: wxAuiToolBar Label
fr: - Label 'wxAuiToolBar'

source: My toolbar label
fr: Mon libellé de barre d'outils

source: The label's text
fr: Texte de l'étiquette

source: Optionally, specify the label's width
fr: Optionnellement, spécifier la largeur de l'étiquette

source: The control size. It is recommended to leave it as -1,-1 and let the sizers calculate the best size for the window
fr: La taille du contrôle. Il est recommandé de la laisser à -1,-1 et de laisser les calibreurs calculer la meilleure taille pour la fenêtre.=

source: C++ member name
fr: Nom du membre 'C++'

source: ToolBar
fr: Barre d'outils

source: Sets the default size of each tool bitmap
fr: Définit la taille par défaut de chaque image d'outil

source: Sets the values to be used as margins for the toolbar.
fr: Définit les valeurs à utiliser comme marges pour la barre d'outils.

source: Sets the space between tools.
fr: Règle l'espace entre les outils.

source: Sets the width of separators.
fr: Définit la largeur des séparateurs.

source: Subclass
fr: Sous-classe

source: The name of the derived class. Used both for C++ and XRC generated code.
fr: Le nom de la classe dérivée. Utilisé à la fois pour le code généré en 'C++' et en 'XRC'.

source: (C++ only) The name of any extra header file to be #included e.g. mydialog.hpp
fr: (C++ uniquement) Le nom de tout fichier d'en-tête supplémentaire à inclure, par exemple 'mydialog.hpp'

source: Override the default class style with the content of this field. The style should be | separated
fr: Remplacer le style de classe par défaut par le contenu de ce champ. Le style doit être séparé par des |

source: Set the values to be used as margins for the toolbar.
fr: Définir les valeurs à utiliser comme marges pour la barre d'outils.

source: Process a wxEVT_MAXIMIZE event
fr: Traitement d'un événement 'wxEVT_MAXIMIZE'

source: Process a wxEVT_MOVE event, which is generated when a window is moved
fr: Traite un événement 'wxEVT_MOVE', qui est généré lorsqu'une fenêtre est déplacée

source: Process a wxEVT_MOVE_START event, which is generated when the user starts to move or size a window. Windows only
fr: Traite un événement 'wxEVT_MOVE_START', qui est généré lorsque l'utilisateur commence à déplacer ou à agrandir une fenêtre. Fenêtres uniquement

source: Process a wxEVT_MOVE_END event, which is generated when the user stops moving or sizing a window. Windows only
fr: Traite un événement 'wxEVT_MOVE_END', qui est généré lorsque l'utilisateur cesse de déplacer ou de redimensionner une fenêtre. Fenêtres uniquement

source: Process a wxEVT_SHOW event
fr: Traiter un événement 'wxEVT_SHOW'

source: When enabled, the generated code will add support for wxPersistenceManager (i.e. the Window will remember its size, position and any child wxBookCtrlBase control will remember its selection)
fr: Si cette option est activée, le code généré ajoutera la prise en charge de 'wxPersistenceManager' (c'est-à-dire que la fenêtre se souviendra de sa taille et de sa position et que tout contrôle 'wxBookCtrlBase' enfant se souviendra de sa sélection).

source: The title, if any
fr: Le titre, le cas échéant

source: CodeLite's virtual folder for the generated files
fr: Dossier virtuel de 'CodeLite' pour les fichiers générés

source: Centre on parent. This may be in both dimensions (the default); only vertically or horizontally; or not at all.
fr: Centrer sur le parent. Il peut s'agir des deux dimensions (par défaut), de la verticale ou de l'horizontale uniquement, ou encore de rien du tout.

source: Inherited class name Fill this field to generate a class that inherits from the base class, where you should place all your application logic. e.g. for a generated class 'FooDialogBase', you might enter 'FooDialog' here.
fr: Nom de la classe héritée Remplissez ce champ pour générer une classe qui hérite de la classe de base, où vous devez placer toute votre logique d'application. Par exemple, pour une classe générée « FooDialogBase », vous pouvez saisir « FooDialog » ici.
