Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Break by line, function or memory address:
fr: Interruption par ligne, fonction ou adresse mémoire :

source: Line number
fr: Numéro de ligne

source: Enter the line-number on which you wish to break. It's assumed to refer to the current file: if it doesn't, please enter the correct filepath below.
fr: Saisissez le numéro de ligne sur laquelle vous souhaitez effectuer un saut de ligne. Il est supposé faire référence au fichier actuel : si ce n'est pas le cas, veuillez saisir le chemin d'accès correct ci-dessous.

source: If you wish to break when a particular function is entered, insert its name here. In C just the name will do e.g. 'main' or 'myFoo'. For C++ class methods, you need to do 'MyClass::myFoo' Alternatively you can enter a regular expression, and tick the checkbox below. A breakpoint will then be set on all matching functions.
fr: Si vous souhaitez interrompre l'exécution d'une fonction particulière, insérez son nom ici. En C, le nom suffit, par exemple « main » ou « myFoo ». Pour les méthodes de classe C++, vous devez insérer « MyClass::myFoo Vous pouvez également saisir une expression régulière et cocher la case ci-dessous. Un point d'arrêt sera alors placé sur toutes les fonctions correspondantes.

source: This is a regex
fr: Il s'agit d'une expression rationnelle

source: If you wish to insert a breakpoint on several functions, you can tick this box, then enter a suitable regular expression in the textctrl above.
fr: Si vous souhaitez insérer un point d'arrêt sur plusieurs fonctions, vous pouvez cocher cette case, puis saisir une expression régulière appropriée dans le 'textctr'l ci-dessus.

source: Memory address:
fr: Adresse mémoire :

source: To break on a memory address, enter the address here. e.g. 0x0a1b2c3d or 12345678
fr: Pour casser une adresse mémoire, entrez l'adresse ici. Par exemple, '0x0a1b2c3d' ou '12345678'

source: In file:
fr: Dans le fichier :

source: If you've entered a line-number, its assumed to refer to the current file. If it isn't, enter the correct filename here. For a function, a file is usually not required. However, if you have several functions with the same name, in several different files (do people _really_ do that?) and you want to break on only one of those, enter the correct filename here.
fr: Si vous avez saisi un numéro de ligne, il est supposé faire référence au fichier en cours. Si ce n'est pas le cas, entrez le nom de fichier correct ici. Pour une fonction, un fichier n'est généralement pas nécessaire. Cependant, si vous avez plusieurs fonctions portant le même nom, dans plusieurs fichiers différents (les gens font-ils _vraiment_ cela ?) et que vous voulez casser une seule de ces fonctions, entrez le nom de fichier correct ici.

source: write only
fr: écrire seulement

source: read only
fr: en lecture seule

source: read-write
fr: lecture-écriture

source: Type of watchpoint:
fr: Type de point de surveillance :

source: The usual type of watchpoint is 'write-only': that is, it's triggered whenever the target is changed. Alternatively you can choose for it to trigger when the target is read from, or either written to or read from.
fr: Le type de point de surveillance habituel est « en écriture seule », c'est-à-dire qu'il est déclenché chaque fois que la cible est modifiée. Vous pouvez également choisir de le déclencher lorsque la cible est lue, ou lorsqu'elle est lue ou écrite.

source: Data to watch:
fr: Données à surveiller :

source: Identify the data to be watched. It can be one of: 1) Any variable name e.g. 'foo' 2) A memory address, suitably cast e.g.*(int*)0x12345678 will watch an int-sized block starting at this address. Don't include spaces in the expression: gdb can't understand them. 3) A complex expression e.g. a*b + c/d'. The expression can use any operators valid in the program's native language. NB. A watchpoint set on a local variable will automatically be removed when the variable loses scope.
fr: Identifier les données à observer. Il peut s'agir de l'un des éléments suivants 1) un nom de variable quelconque, par exemple « foo ». 2) Une adresse mémoire, convenablement exprimée, par exemple *(int*)0x12345678 surveillera un bloc de taille 'int' qui commence à cette adresse. N'incluez pas d'espaces dans l'expression : 'gdb' ne les comprend pas. 3) Une expression complexe, par exemple a*b + c/d'. L'expression peut utiliser n'importe quel opérateur valide dans le langage natif du programme. NB. Un point de surveillance placé sur une variable locale sera automatiquement supprimé lorsque la variable perdra sa portée.

source: Conditional Breaks: Add any condition here
fr: Ruptures conditionnelles : Ajoutez n'importe quelle condition ici

source: You can add a condition to any breakpoint or watchpoint. The debugger will then stop only if the condition is met. The condition can be any simple or complex expression in your programming language, providing it returns a bool. However any variables that you use must be in scope. If you've previously set a condition and no longer want it, just clear this textctrl.
fr: Vous pouvez ajouter une condition à n'importe quel point d'arrêt ou de surveillance. Le débogueur ne s'arrêtera alors que si la condition est remplie. La condition peut être n'importe quelle expression simple ou complexe dans votre langage de programmation, à condition qu'elle renvoie un booléen. Cependant, toutes les variables que vous utilisez doivent être dans le champ d'application. Si vous avez déjà défini une condition et que vous n'en voulez plus, effacez simplement ce 'textctrl'.

source: Command List: Add any command(s) here
fr: Liste des commandes : Ajouter une ou plusieurs commande(s) ici

source: You can add a list of commands to any breakpoint or watchpoint. When the breakpoint is hit and the program interrupted, those commands will be executed. For example, to print the value of the variable foo and then continue running the program, enter: print foo cont If you've previously entered commands, and no longer want them, just clear this textctrl.
fr: Vous pouvez ajouter une liste de commandes à n'importe quel point d'arrêt ou de surveillance. Lorsque le point d'arrêt est atteint et que le programme est interrompu, ces commandes sont exécutées. Par exemple, pour imprimer la valeur de la variable 'foo' et continuer à exécuter le programme, entrez : print foo cont Si vous avez déjà saisi des commandes et que vous n'en avez plus besoin, il vous suffit d'effacer ce 'textctrl'.

source: Disable
fr: Désactiver

source: If you check this box, the breakpoint (or watchpoint) will still exist, but it won't trigger. If you uncheck it in the future, the breakpoint will work again.
fr: Si vous cochez cette case, le point d'arrêt (ou point de surveillance) existera toujours, mais il ne se déclenchera pas. Si vous la décochez à l'avenir, le point d'arrêt fonctionnera à nouveau.

source: Make temporary
fr: Rendre temporaire

source: A temporary breakpoint (or watchpoint) is one that works only once. When it's hit it behaves like any other, except that it's then deleted.
fr: Un point d'arrêt temporaire (ou point de surveillance) est un point qui ne fonctionne qu'une seule fois. Lorsqu'il est atteint, il se comporte comme n'importe quel autre, sauf qu'il est ensuite supprimé.

source: Ignore count:
fr: Ignorer le décompte :

source: Enter a count >0 to ignore this breakpoint (or watchpoint) for that number of times. It then behaves as though it is disabled, except that every time it would have triggered, the ignore count decrements. When the count reaches zero, the breakpoint becomes active again.
fr: Entrez un nombre >0 pour ignorer ce point d'arrêt (ou point de surveillance) pendant le nombre de fois indiqué. Il se comporte alors comme s'il était désactivé, sauf qu'à chaque fois qu'il se serait déclenché, le nombre d'ignorants est décrémenté. Lorsque le compte obtient zéro, le point d'arrêt redevient actif.

source: Breakpoint and Watchpoint Properties
fr: Propriétés des points d'arrêt et de surveillance

source: You don't seem to have entered a variable for the watchpoint to watch. Please try again.
fr: Vous ne semblez pas avoir saisi de variable pour le point de surveillance à surveiller. Veuillez réessayer.

source: The breakpoint's line-number is invalid. Please try again.
fr: Le numéro de ligne du point d'arrêt n'est pas valide. Veuillez réessayer.

source: You don't seem to have entered a name for the function. Please try again.
fr: Il semble que vous n'ayez pas saisi de nom pour la fonction. Veuillez réessayer.

source: Sorry, you can't change a breakpoint to a watchpoint, or vice versa, while the debugger is running
fr: Désolé, vous ne pouvez pas changer un point d'arrêt en point de surveillance, ou vice versa, lorsque le débogueur est en cours d'exécution

source: Not possible
fr: Pas possible

source: You can add a condition to any breakpoint. The debugger will then stop only if the condition is met. The condition can be any simple or complex expression in your programming language, providing it returns a bool. However any variables that you use must be in scope. If you've previously set a condition and no longer want it, just clear this textctrl.
fr: Vous pouvez ajouter une condition à n'importe quel point d'arrêt ou de surveillance. Le débogueur ne s'arrêtera alors que si la condition est remplie. La condition peut être n'importe quelle expression simple ou complexe dans votre langage de programmation, à condition qu'elle renvoie un booléen. Cependant, toutes les variables que vous utilisez doivent être dans le champ d'application. Si vous avez déjà défini une condition et que vous n'en voulez plus, effacez simplement ce 'textctrl'.

source: It is not possible to Add a conditional watchpoint. Create a normal watchpoint first, then Edit it to add the conditon
fr: Il n'est pas possible d'ajouter un point de surveillance conditionnel. Créez d'abord un point de surveillance normal, puis modifiez-le pour ajouter la condition

source: At
fr: Au

source: Extras
fr: Suppléments

source: Ignored
fr: Ignoré

source: Memory
fr: Mémoire

source: What
fr: Ce qu'il y a

source: Create a breakpoint or watchpoint
fr: Créer un point d'arrêt ou un point de surveillance

source: Watchpoint successfully added
fr: Ajout réussi d'un point de surveillance

source: Breakpoint successfully added
fr: Point d'arrêt ajouté avec succès

source: Breakpoint#
fr: Point d'arrêt#

source: Temporary conditional breakpoint
fr: Point d'arrêt conditionnel temporaire

source: Temporary breakpoint
fr: Point d'arrêt temporaire

source: Conditional breakpoint
fr: Point d'arrêt conditionnel

source: Normal breakpoint
fr: Point d'arrêt normal

source: (disabled)
fr: (désactivé)

source: Ignore-count:
fr: Ignorer le comptage :

source: Commands:
fr: Commandes :

source: Breakpoint
fr: Point d'arrêt

source: Watchpoint
fr: Point de surveillance

source: %i deleted
fr: %i supprimé

source: breakpoints disabled
fr: points d'arrêt désactivés

source: breakpoints enabled
fr: points d'arrêt activés

source: Watchpoint creation unsuccessful
fr: Échec de la création d'un point de surveillance

source: Breakpoint creation unsuccessful
fr: La création d'un point d'arrêt n'a pas abouti

source: Please enter the new ignore-count
fr: Veuillez saisir le nouveau nombre d'ignorés

source: Set ignore-count
fr: Définir le nombre d'ignorés

source: Properties for watchpoint
fr: Propriétés du point de surveillance

source: Properties for breakpoint
fr: Propriétés du point d'arrêt

source: Select build order for configuration:
fr: Sélectionner l'ordre de construction pour la configuration :

source: Projects
fr: Projets

source: Build Order
fr: Ordre de construction

source: Up
fr: Haut

source: Down
fr: Bas

source: Apply
fr: Appliquer

source: Skip warnings
fr: Ignorer les avertissements

source: When using the menu to jump between errors/warnings, ignore warnings
fr: Lorsque vous utilisez le menu pour passer d'une erreur ou d'un avertissement à l'autre, ignorer les avertissements

source: When build completes, scroll to the first error line
fr: Lorsque la compilation est terminée, faites défiler la page jusqu'à la première ligne d'erreur

source: Marker style:
fr: Type de marqueur :

source: Red arrow
fr: Flèche rouge

source: Annotation box
fr: Boîte d'annotation

source: None
fr: Non

source: Open Workspace Configuration Manager...
fr: Ouvrir le gestionnaire de configuration de l'espace de travail...

source: has the read-only attribute set
fr: a l'attribut lecture seule défini

source: Would you like CodeLite to try and remove it?
fr: Souhaitez-vous que 'CodeLite' tente de le supprimer ?

source: Failed to open file
fr: Échec de l'ouverture du fichier

source: for write
fr: pour écrire

source: Save As
fr: Enregistrer sous

source: Failed to save file
fr: Échec de l'enregistrement du fichier

source: Unable to create intermediate file '%s' for writing. File already exists!
fr: Impossible de créer un fichier intermédiaire '%s' pour l'écriture. Le fichier existe déjà !

source: Failed to open file '%s' for write
fr: Échec de l'ouverture du fichier '%s' pour l'écriture

source: Save file failed!
fr: L'enregistrement du fichier a échoué !

source: Could not convert the file to the requested encoding
fr: Impossible de convertir le fichier dans l'encodage demandé

source: File text conversion failed! Check your file font encoding from Settings | Preferences | Misc | Locale
fr: La conversion du texte du fichier a échoué ! Vérifiez l'encodage de la police de votre fichier à partir de Paramètres | Préférences | Divers | Localisation

source: The file
fr: Le fichier

source: is a read only file, continue?
fr: est un fichier en lecture seule, continuez ?

source: Failed to override read-only file
fr: Échec de remplacement d'un fichier en lecture seule

source: Can not find the string '
fr: Impossible de trouver la chaîne '

source: Type %i bookmark
fr: Type %i signet

source: Bookmarks
fr: Signets

source: Loading file...
fr: Chargement du fichier...

source: Add Bookmark
fr: Ajouter un signet

source: Remove Bookmark
fr: Supprimer un signet

source: Remove All Bookmarks
fr: Supprimer tous les signets

source: Add Breakpoint
fr: Ajouter un point d'arrêt

source: Add a Temporary Breakpoint
fr: Ajouter un point d'arrêt temporaire

source: Add a Disabled Breakpoint
fr: Ajouter un point d'arrêt désactivé

source: Add a Conditional Breakpoint..
fr: Ajouter un point d'arrêt conditionnel...

source: Remove Breakpoint
fr: Supprimer le point d'arrêt

source: Ignore Breakpoint
fr: Ignorer le point d'arrêt

source: Disable Breakpoint
fr: Désactiver le point d'arrêt

source: Enable Breakpoint
fr: Activer le point d'arrêt

source: Edit Breakpoint
fr: Modifier le point d'arrêt

source: Run to here
fr: Courir jusqu'à ici

source: Create Conditional Breakpoint
fr: Créer un point d'arrêt conditionnel

source: Enter the condition statement
fr: Saisir l'énoncé de la condition

source: Failed to insert breakpoint
fr: Échec de l'insertion d'un point d'arrêt

source: Temporary
fr: Temporaire

source: Disabled
fr: Désactivé

source: Conditional
fr: Conditionnel

source: No breakpoint found on this line
fr: Aucun point d'arrêt n'a été trouvé sur cette ligne

source: Breakpoint deletion failed
fr: Échec de la suppression du point d'arrêt

source: Breakpoint not deleted
fr: Point d'arrêt non supprimé

source: More Watches
fr: Plus de points de surveillance

source: Add Watch
fr: Ajouter une surveillance

source: Run to Caret Line
fr: Courir jusqu'à la ligne du curseur

source: Jump to Caret Line
fr: Sauter à la ligne du curseur

source: Watch
fr: Scrutateur

source: as
fr: comme

source: matches
fr: correspondances

source: Found and selected
fr: Trouvé et sélectionné

source: Failed to reload remote file:
fr: Échec du rechargement du fichier distant :

source: Ask me for each file
fr: Demandez moi à chaque fichier

source: Save all files
fr: Enregistrer tous les fichiers

source: Discard changes for all files
fr: Rejeter les modifications pour tous les fichiers

source: Some of the files are modified, what action should CodeLite take?
fr: Certains fichiers sont modifiés, quelle action CodeLite doit-il entreprendre ?

source: Close All
fr: Fermer tout

source: Switch:
fr: Commutateur :

source: Help:
fr: Aide :

source: Regex Pattern:
fr: Motif d'expression rationnelle :

source: Compiler regular expression
fr: Expression régulière du compilateur

source: File Index in Pattern:
fr: Index des fichiers dans le modèle :

source: The capture index in the regex that holds the file path
fr: L'index de capture dans l'expression rationnelle qui contient le chemin d'accès au fichier.

source: Line Number in Pattern:
fr: Numéro de ligne dans le motif :

source: The capture index in the regex that holds the line number
fr: L'index de capture dans l'expression rationnelle qui contient le numéro de ligne

source: Column Index in Pattern:
fr: Index des colonnes dans le modèle :

source: The capture index in the regex that holds the column number
fr: L'index de capture dans l'expression rationnelle qui contient le numéro de colonne

source: New compiler name:
fr: Nouveau nom du compilateur :

source: Copy settings from:
fr: Copier les paramètres de :

source: C++ Compiler
fr: Compilateur 'C++'

source: The C++ compiler path (plus optional flags). This tool is represented in the Makefile as $(CXX)
fr: Le chemin d'accès au compilateur C++ (plus des drapeaux optionnels). Cet outil est représenté dans le Makefile par $(CXX)

source: C Compiler
fr: Compilateur 'C'

source: The C compiler path (plus optional flags). This tool is represented in the Makefile as $(CC)
fr: Le chemin du compilateur C (plus les drapeaux optionnels). Cet outil est représenté dans le Makefile par $(CC)

source: Assembler Name
fr: Nom de l'assembleur

source: The assembler tool path. This tool is referred in the Makefile as $(AS)
fr: Le chemin d'accès à l'outil assembleur. Cet outil est désigné dans le 'Makefile' par $(AS)

source: Linker
fr: Éditeur de liens

source: The linker tool. Usually similar to the 'C++ Compiler' tool path
fr: L'outil de liaison. Généralement similaire au chemin d'accès à l'outil « Compilateur C++ ».

source: Shared Object Linker
fr: Lieur d'objets partagés

source: The tool to create shared objects
fr: L'outil pour créer les objets partagés

source: The static archive tool "ar". This tool is referred in the Makefile as $(AR)
fr: L'outil d'archivage statique « ar ». Cet outil est appelé $(AR) dans le Makefile.

source: Resource Compiler
fr: Compilateur de ressources

source: The resource compiler. (Windows only)
fr: Le compilateur de ressources. (uniquement 'Windows')

source: The Make tool. on Windows / MinGW this is usually mingw32-make.exe while on other OSs its simply 'make'
fr: L'outil 'Make' sous 'Windows / MinGW', il s'agit généralement de 'mingw32-make.exe', tandis que sous d'autres systèmes d'exploitation, il s'agit simplement de « make ».

source: Set the 'mkdir' for your OS. Leave it empty to use the default for your OS
fr: Définissez le 'mkdir' pour votre système d'exploitation. Laissez-le vide pour utiliser la valeur par défaut de votre système d'exploitation

source: On various platform (e.g. Cygwin) it is recommended to use their own special gdb executable rather than the global one You can specify one here, or leave this empty to use the default
fr: Sur certaines plateformes (par exemple 'Cygwin'), il est recommandé d'utiliser leur propre exécutable 'gdb' plutôt que l'exécutable global Vous pouvez en spécifier un ici, ou laisser ce champ vide pour utiliser l'exécutable par défaut

source: Patterns
fr: Les motifs

source: Compiler Errors Patterns:
fr: Motifs d'erreurs du compilateur :

source: Add
fr: Ajouter

source: Add new error pattern
fr: Ajouter un nouveau motif d'erreur

source: Delete the selected error pattern
fr: Supprimer le modèle d'erreur sélectionné

source: Edit the selected error pattern
fr: Modifier le motif d'erreur sélectionné

source: Compiler Warnings Patterns:
fr: Motifs d'avertissements du compilateur :

source: Add new warning pattern
fr: Ajouter un nouveau motif d'avertissement

source: Delete the selected warning pattern
fr: Supprimer le modèle d'avertissement sélectionné

source: Edit the selected warning pattern
fr: Modifier le motif d'avertissement sélectionné

source: Compiler Options
fr: Options du compilateur

source: Double click on an entry to modify it:
fr: Double-cliquez sur une entrée pour la modifier :

source: Linker Options
fr: Options du lieur

source: Templates
fr: Modèles

source: Define the compilation line per file type
fr: Définir la ligne de compilation par type de fichier

source: Template
fr: Modèle

source: Add new file type
fr: Ajouter un nouveau type de fichier

source: Defines the linker command per project type
fr: Définit la commande de l'éditeur de liens par type de projet

source: Project Type
fr: Type de projet

source: Pass object list to the linker via file
fr: Transmettre la liste des objets à l'éditeur de liens via le fichier

source: Switches
fr: Indicateurs

source: Global Paths
fr: Chemin d'accès globaux

source: Include Path:
fr: Chemin des inclusions :

source: Set here an additional include paths. Each path should be separated with a semi-colon Note that usually you don't need to modify this field and it should be left empty
fr: Définissez ici des chemins d'inclusion supplémentaires. Chaque chemin doit être séparé par un point-virgule Notez que vous n'avez généralement pas besoin de modifier ce champ et qu'il doit être laissé vide

source: Libraries Path:
fr: Chemin des bibliothèques :

source: Set here an additional library search paths. Each path should be separated with a semi-colon Note that usually you don't need to modify this field and it should be left empty
fr: Définissez ici des chemins de recherche supplémentaires pour la bibliothèque. Chaque chemin doit être séparé par un point-virgule. Notez que vous n'avez généralement pas besoin de modifier ce champ et qu'il doit être laissé vide

source: Misc
fr: Divers

source: Objects extension:
fr: Extension des objets :

source: Depends extension:
fr: Extension des dépendances :

source: Preprocessed extension:
fr: Extension pré-processeur :

source: Generate dependencies files (*.o.d)
fr: Générer des fichiers de dépendances (*.o.d)

source: Object name is same as the file name
fr: Le nom de l'objet est identique au nom du fichier

source: By default, codelite will prepend the relative directory to the file name to compose an object name (e.g. src/a.cpp will generate object: src_a.o). Uncheck this option to make the object name exactly as the file name without any prefixes
fr: Par défaut, 'codelite' ajoutera le répertoire relatif au nom du fichier pour composer un nom d'objet (par exemple, src/a.cpp générera l'objet : src_a.o). Décochez cette option pour que le nom de l'objet corresponde exactement au nom du fichier sans aucun préfixe

source: File extension:
fr: Extension de fichier :

source: Resource
fr: Ressources

source: Pattern:
fr: Motif :

source: New Compiler
fr: Nouveau compilateur

source: Edit Compiler Template
fr: Éditer le modèle de compilateur

source: New File Type Template
fr: Nouveau modèle de type de fichier

source: Settings for workspace configuration '%s' have changed, would you like to save them?
fr: Les paramètres de la configuration de l'espace de travail « %s » ont changé, souhaitez-vous les enregistrer ?

source: Enter New Configuration Name:
fr: Saisir le nom de la nouvelle configuration :

source: New Configuration
fr: Nouvelle configuration

source: Open Include File "
fr: Ouvrir le fichier inclus "

source: Add Forward Declaration for "
fr: Ajouter une déclaration préalable pour "

source: Add Include File for "
fr: Ajouter un fichier inclus pour "
