Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Enable Auto Save
fr: Activer la sauvegarde automatique

source: Save interval:
fr: Intervalle de sauvegarde :

source: Check and save modified files interval (in seconds)
fr: Intervalle de vérification et d'enregistrement des fichiers modifiés (en secondes)

source: Auto Save Settings
fr: Configurer la sauvegarde automatique

source: Automatically save modified source files
fr: Enregistrer automatiquement tous les fichiers modifiés

source: Settings...
fr: Paramètres...

source: Auto Save
fr: Sauvegarde automatique

source: exists. Would you like to overwrite it?
fr: existe. Voulez-vous l'écraser ?

source: A custom
fr: Une personnalisation

source: Don't Overwrite
fr: Ne pas écraser

source: Overwrite
fr: Écraser

source: Remember my answer and don't annoy me again
fr: Souvenez-vous de ma réponse et ne m'importunez plus

source: CMake application path is invalid!
fr: Le chemin d'accès à l'application 'CMake' n'est pas valide !

source: CMake Help
fr: Aide de 'CMake'

source: CMake integration for CodeLite
fr: Intégration de 'CMake' pour 'CodeLite'

source: CMake integration with CodeLite
fr: Intégration de 'CMake' avec 'CodeLite'

source: Open CMakeLists.txt
fr: Ouvrir 'CMakeLists.txt'

source: Run CMake
fr: Lancer 'CMake'

source: Export CMakeLists.txt
fr: Exporter 'CMakeLists.txt'

source: Failed to execute:
fr: Échec de l'exécution :

source: Build
fr: Construire

source: CMake program:
fr: Programme 'CMake' :

source: Select a file
fr: Sélectionnez un fichier

source: Path to cmake executable.
fr: Le chemin d'accès à l'exécutable 'cmake'.

source: Default Generator:
fr: Générateur par défaut:

source: You can specify default generator for all projects (if is not overridden by project settings). If generator is not selected the CMake uses platform's default.
fr: Vous pouvez spécifier le générateur par défaut pour tous les projets (s'il n'est pas remplacé par les paramètres du projet). Si le générateur n'est pas sélectionné, 'CMake' utilise le générateur par défaut de la plateforme.

source: Select Topic:
fr: Sélectionnez un sujet :

source: Reload
fr: Recharger

source: Reloads Help from CMake
fr: Recharger l'Aide de 'CMake'

source: Double click to insert in the current editor.
fr: Un double-clic sur une insertion dans l'éditeur courant.

source: CMakePlugin Settings
fr: Paramètres de l'extension 'CMakePlugin'

source: Create application call graph from profiling information provided by gprof tool.
fr: Créer un graphe d'appel d'application à partir des informations de profilage fournies par l'outil 'gprof'.

source: Show call graph
fr: Afficher les appels du graphe

source: Show call graph for selected/active project
fr: Afficher le graphique des appels pour le projet sélectionné/actif

source: About...
fr: À propos...

source: Call Graph
fr: Graphe d'Appels

source: Show call graph for selected project
fr: Afficher le graphe des appels pour le projet sélectionné

source: Create application call graph from profiling information provided by gprof tool.
fr: Créer un graphe d'appel d'application à partir des informations de profilage fournies par l'outil gprof.

source: 2012 - 2015 (C) Tomas Bata University, Zlin, Czech Republic
fr: 2012 - 2015 (C) Université Tomas Bata, Zlin, République tchèque

source: Unable to get opened workspace.
fr: Impossible d'obtenir l'espace de travail ouvert.

source: Unable to get current build matrix.
fr: Impossible d'obtenir la matrice de construction actuelle.

source: Please select the binary to analyze
fr: Veuillez sélectionner le binaire à analyser

source: selected binary was canceled
fr: le binaire sélectionné a été annulé

source: bin/exe isn't executable
fr: 'bin/exe' n'est pas exécutable

source: Please select the gprof file
fr: Veuillez sélectionner le fichier 'gprof'

source: selected gprof was canceled
fr: la sélection de 'gprof' a été annulée

source: wxProcess::GetInputStream() can't be opened, aborting
fr: 'wxProcess::GetInputStream()' ne peut pas être ouvert, abandon du processus

source: The CallGraph plugin has suggested node threshold %d to speed-up the call graph creation. You can alter it on the call graph panel.
fr: L'extension 'CallGraph' a suggéré un seuil de nœud %d pour accélérer la création du graphe d'appel. Vous pouvez le modifier dans le panneau du graphe d'appel.

source: Failed to open file CallGraph.png. Please check the project settings, rebuild the project and try again.
fr: Échec de l'ouverture du fichier 'CallGraph.png'. Veuillez vérifier les paramètres du projet, reconstruire le projet et réessayer.

source: "The call-graph is empty; the node threshold ceiling is %d !"
fr: « Le graphe d'appel est vide ; le plafond du seuil des nœuds est %d ! »

source: Node threshold [%] :
fr: Seuil des nœuds [%] :

source: Edge threshold [%] :
fr: Seuil des bords [%] :

source: Hide parameters
fr: Masquer les paramètres

source: Hide namespaces
fr: Masquer les espaces de noms

source: Refresh
fr: Rafraîchir

source: Save call graph to...
fr: Sauvegarder le graphe d'appel dans...

source: Close call graph
fr: Fermer le graphie des appels

source: Zoom in
fr: Zoom avant

source: Zoom out
fr: Zoom arrière

source: Function name
fr: Nom de fonction

source: Total time [%]
fr: Temps total [%]

source: Self time [s]
fr: Temps d'autonomie [s]

source: Called
fr: Appelé

source: Save call graph...
fr: Sauvegarder le graphe d'appel...

source: CallGraph failed to save file with DOT language, please build the project again.
fr: 'CallGraph' n'a pas réussi à enregistrer le fichier avec le langage 'DOT', veuillez recréer le projet.

source: Select path for Gprof:
fr: Sélectionner le chemin d'accès à 'Gprof' :

source: Select...
fr: Sélectionner ...

source: Select path for Dot:
fr: Sélectionner le chemin pour 'Dot' :

source: Settings for CALL graph
fr: Configurer des appels

source: Resolutions:
fr: Résolutions :

source: Node threshold (0 - 100) [%]:
fr: Seuil du nœuds [%] :

source: Edge threshold (0 - 100) [%]:
fr: Seuil des bords [%] :

source: Number of node load level colors (max 10):
fr: Nombre de couleurs du niveau de charge du nœud (max. 10) :

source: Strip parameters
fr: Paramètres de la bande

source: Number of edge load level colors (max 10):
fr: Nombre de couleurs de niveau de charge des arêtes (max 10) :

source: &Ok
fr: &Vu

source: &Cancel
fr: &Annuler

source: Select gprof...
fr: Sélectionner le fichier 'gprof' ...

source: Select dot...
fr: Sélectionner 'Dot' ...

source: Please check the external tools' paths settings.
fr: Veuillez vérifier les paramètres des chemins d'accès des outils externes.

source: CodeDesigner RAD integration with CodeLite
fr: Intégration de 'CodeDesigner RAD' avec 'CodeLite'

source: Open with CodeDesigner...
fr: Ouvrir avec 'CodeDesigner' ...

source: New simple state chart...
fr: Nouveau graphe d'état simplifié ...

source: New hierarchical state chart...
fr: Nouveau graphe d'état hiérarchique...

source: New class diagram...
fr: Nouveau diagramme de classe ...

source: Please select a 'cdp' (CodeDesigner Project) file only
fr: Veuillez sélectionner uniquement un fichier 'cdp' ('CodeDesigner Project')

source: Failed to launch CodeDesigner, no path specified Please set CodeDesigner path from Plugins -> CodeDesigner -> Settings...
fr: Échec du lancement de 'CodeDesigne', aucun chemin d'accès n'a été spécifié Veuillez définir le chemin d'accès à 'CodeDesigner' à partir de 'Extensions -> CodeDesigner -> Paramètres' ...

source: New Class Diagram
fr: Nouveau diagramme de classe

source: New Hierarchical State Chart
fr: Nouveau graphe d'état hiérarchique

source: New Simple State Chart
fr: Nouveau graphe d'état simplifié

source: Can't find CodeDesigner template file '%s'
fr: Impossible de trouver le fichier modèle 'CodeDesigner' '%s'

source: Failed to copy template file to '%s'
fr: Échec de la copie du fichier de modèle dans '%s'

source: Failed to read file '%s'
fr: Échec de la lecture du fichier texte "%s".

source: Failed to write file '%s'
fr: Échec de l'écriture dans le fichier ' %s'

source: Insert generated files into...
fr: Insérer les fichiers générés dans...

source: Select CodeDesigner executable:
fr: Sélectionnez l'exécutable 'CodeDesigne'r :

source: CodeDesigner project settings:
fr: Paramètres du projet 'CodeDesigner' :

source: Package name:
fr: Nom du paquet :

source: Diagram name:
fr: Nom du diagramme :

source: Language:
fr: Langage :

source: Application entry point
fr: Point d'entrée de l'application

source: Generate source code
fr: Générer le code source

source: CodeLite settings:
fr: Paramètres 'CodeLite' :

source: Project tree folder:
fr: Arborescence du projet :

source: OK
fr: VU

source: Cancel
fr: Annuler

source: New CodeDesigner project
fr: Nouveau projet 'CodeDesigner'

source: Diagram name cannot be empty
fr: Le nom du diagramme ne peut pas être vide

source: Package name cannot be empty
fr: Le nom du paquet ne peut pas être vide

source: Folder name cannot be empty
fr: Le nom du dossier ne peut pas être vide

source: CodeDesigner path:
fr: Chemin de 'CodeDesigne' :

source: Communication port:
fr: Port de communication :

source: &OK
fr: &Accepter

source: CodeDesigner RAD Settings...
fr: Paramètres de 'CodeDesigner' Développement Rapide ...

source: Enabled
fr: Activé

source: Format on save?
fr: Formater lors de la sauvegarde ?

source: Inplace edit
fr: Modification sur place

source: Working directory
fr: Répertoire de travail

source: Supported languages
fr: Liste des langages prises en charge

source: Command
fr: Commande

source: format error. Process exit code:
fr: erreur de format. Code de sortie du processus :

source: Source Code Formatter (Supports C/C++/Obj-C/JavaScript/PHP files)
fr: Formateur de code source (prend en charge les fichiers 'C/C++/Obj-C/JavaScript/PHP')

source: Source Code Formatter
fr: Formater le code source

source: Format Current Source
fr: Formater le source actuel

source: Format Source
fr: Formater le source

source: Format Source Code
fr: Formater le code source

source: Format Options
fr: Options du formatage

source: Source Code Formatter Options...
fr: Options de formatage du code source...

source: Code Formatter: scanning for files...
fr: Formateur du code : recherche de fichiers...

source: Project contains no supported files
fr: Le projet ne contient pas de fichiers pris en charge

source: files Continue?
fr: fichiers Poursuivre ?

source: You are about to beautify
fr: Vous êtes sur le point d'arranger

source: files
fr: fichier

source: Successfully formatted
fr: Formatage réussi

source: Done
fr: Terminé

source: Lose all your modifications and restore default settings?
fr: Perdre toutes les modifications et rétablir les paramètres par défaut ?

source: name
fr: nom

source: Defaults
fr: Par défaut

source: Revert all changes and load factory defaults
fr: Annuler toutes les modifications et charger les valeurs par défaut de l'usine

source: Source Code Formatter Options
fr: Options de formatage du code source

source: The uncompromising python code formatter
fr: Le formateur de code 'python' sans compromis

source: black - a python formatter
fr: 'black' - un formateur python

source: Parse cmake listfiles and format them nicely
fr: Analyse les fichiers listes de cmake et les formate joliment

source: cmake-format - a CMake formatter
fr: 'cmake-format' - un formateur 'CMake'

source: A tool to format C/C++/Java/JavaScript/JSON/Objective-C/Protobuf/C# code
fr: Un outil pour formater le code 'C/C++/Java/JavaScript/JSON/Objective-C/Protobuf/C#'

source: clang-format - a C/C++ formatter
fr: 'clang-forma't - un formateur 'C/C++'

source: commandline JSON processor
fr: processeur 'JSON 'en ligne de commande

source: jq - a json formatter
fr: 'jq' - un formateur 'json'

source: PHP Code Beautifier and Fixer
fr: Embellisseur et correcteur de code 'PHP'

source: PHP formatter
fr: Formateur 'PHP'

source: The PHP Coding Standards Fixer
fr: Le correcteur de normes de codage 'PHP'

source: Format Rust code
fr: Formateur du code 'Rust'

source: Rust formatter
fr: Formateur 'Rust'

source: xmllint - command line XML tool
fr: 'xmllint' - outil 'XML' en ligne de commande

source: Xml formatter
fr: Formateur 'Xml'

source: commandline YAML processor
fr: processeur 'YAML' en ligne de commande

source: Yaml formatter
fr: Formateur 'Yaml'

source: PHP: parsed
fr: 'PHP' : analysé

source: Send command to the process
fr: Envoi d'une commande au processus

source: Failed to start child process
fr: Échec du démarrage du processus enfant

source: Executing:
fr: Exécution :

source: Failed to execute command: %s
fr: Échec de l'exécution de la commande : %s

source: Can't open file:
fr: Impossible d'ouvrir le fichier :

source: Can't write data to file:
fr: Impossible d'écrire des données dans le fichier :

source: Failed to unlink file:
fr: Échec de la désolidarisation du fichier :

source: Failed to rename file:
fr: Échec du renommage du fichier :

source: Failed to list directory:
fr: Échec de l'énumération du répertoire :

source: Failed to open remote file:
fr: Échec de l'ouverture du fichier distant :

source: Could not stat file:
fr: Impossible de statuer sur le fichier :

source: Could not read file:
fr: Impossible de lire le fichier :

source: SFTP: failed to create directory:
fr: 'SFTP' : échec de la création d'un répertoire :

source: Failed to rename path.
fr: Échec du renommage du chemin d'accès.

source: Failed to remove directory:
fr: Échec de la suppression du répertoire :

source: Failed to unlink path:
fr: Échec de la désolidarisation du chemin d'accès :

source: Could not stat:
fr: Impossible de statuer :

source: Failed to read symlink target.
fr: Échec de la lecture de la cible du lien symbolique.

source: Failed to chmod file:
fr: Échec du 'chmod' du fichier :

source: Accept server authentication?
fr: Accepter l'authentification du serveur ?

source: Host key for server changed: it is now:
fr: La clé d'hôte du serveur a changé : c'est maintenant :

source: The host key for this server was not found but another type of key exists.
fr: La clé d'hôte de ce serveur n'a pas été trouvée mais un autre type de clé existe.

source: An attacker might change the default server key to confuse your client into thinking the key does not exist
fr: Un pirate peut modifier la clé du serveur par défaut pour faire croire à votre client que la clé n'existe pas.

source: Could not find known host file.
fr: Impossible de trouver un fichier d'hôte connu.

source: If you accept the host key here, the file will be automatically created.
fr: Si vous acceptez la clé d'hôte ici, le fichier sera automatiquement créé.

source: Public key hash:
fr: Hachage de la clé publique :

source: The server is unknown. Do you trust the host key?
fr: Le serveur est inconnu. Faites-vous confiance à la clé de l'hôte ?

source: ssh_userauth_none failed
fr: échec de 'ssh_userauth_none'

source: Login failed: invalid username/password
fr: Échec de la connexion : nom d'utilisateur/mot de passe non valide

source: Authentication error:
fr: Erreur d'authentification :

source: Interactive Keyboard is not enabled for this server
fr: Le clavier interactif n'est pas activé pour ce serveur

source: Public Key error:
fr: Erreur de clé publique :

source: MyLabel
fr: Mon étiquette

source: <New...>
fr: <Nouveau...>

source: <Edit...>
fr: <Editer...>

source: ----------Build Started--------
fr: ---------- La construction a commencé --------

source: ----------Build Ended----------
fr: ---------- Construire Terminé ----------

source: ----------Building project:[
fr: ----------Construction du projet :[

source: ----------Cleaning project:[
fr: ----------Nettoyage du projet : [

source: <Entire Workspace>
fr: <Espace de travail complet>

source: <Active Project>
fr: <Projet actif>

source: <Current File's Project>
fr: <Dossier en cours du Projet>

source: <Current File>
fr: <Fichier courant>

source: <Open Files>
fr: <Ouvrir des fichiers>

source: <Workspace Folder>
fr: <Dossier de l'espace de travail

source: <Use Defaults>
fr: <Utiliser les valeurs par défaut>

source: Number of files scanned:
fr: Nombre de fichiers analysés :

source: Matches found:
fr: Correspondances trouvées :

source: seconds
fr: secondes

source: , elapsed time:
fr: ,temps écoulé :

source: Failed to open the following files for scan:
fr: Échec de l'ouverture des fichiers suivants pour l'analyse :

source: Left File:
fr: Dossier de gauche :

source: Right File:
fr: Fichier de droite :

source: Choose a file...
fr: Choisir un fichier...

source: Opened files:
fr: Fichiers ouverts :

source: Select File for Comparison
fr: Sélectionnez un fichier à comparer

source: Select file:
fr: Sélectionner le fichier :

source: Untitled
fr: Sans-titre

source: CodeLite Diff Plugin
fr: Extension de Différrenciation 'CodeLite'

source: Diff Tool
fr: Outil de différenciation

source: New File Comparison
fr: Comparaison de nouveaux fichiers

source: New Folder Comparison
fr: Comparaison des nouveaux dossiers

source: Start new diff
fr: Démarrer une nouvelle comparaison

source: Start new folders diff
fr: Démarrer la comparaison de nouveaux dossiers

source: Compare with...
fr: Comparer avec...

source: Enable continuous build
fr: Activer la construction en continu

source: &Clear All
fr: &Effacer tout

source: Failed Files:
fr: Fichiers défaillants :

source: Continuous build plugin which compiles files on save and report errors
fr: Plugin de construction continue qui compile les fichiers lors de l'enregistrement et signale les erreurs

source: BuildQ
fr: ConstruireQ

source: Compiling
fr: Compilation

source: Copyright Plugin - a small plugin that allows you to place copyright block on top of your source files
fr: Extension 'Copyright' - un petit extension qui vous permet de placer un bloc de propriété intellectuelle au dessus de vos fichiers sources source

source: Copyright Plugin - Place copyright block on top of your source files
fr: Extension de propriété - Placez un bloc de propriété intellectuelle au-dessus de vos fichiers sources

source: Copyright
fr: Droit d'auteur

source: Insert Copyright Block
fr: Insérer un bloc de droit d'auteur

source: Batch Insert of Copyright Block
fr: Insertion par lots de blocs de droits d'auteur

source: Copyrights
fr: Les droits d'auteur

source: Template file name '%s', does not exist!
fr: Le nom du fichier modèle '%s' n'existe pas !

source: Failed to read template file '%s'
fr: Échec de la lecture du fichier modèle '%s'

source: There is no active editor
fr: Il n'y a pas d'éditeur actif

source: Template file contains text which is not comment, continue anyway?
fr: Le fichier modèle contient du texte qui n'est pas un commentaire, continuez quand même ?

source: File contains ignore string, skipping it
fr: Le fichier contient une chaîne ignorée, l'ignorer

source: Batch insert requires a workspace to be opened
fr: L'insertion par lots nécessite l'ouverture d'un espace de travail

source: You are about to modify %u files. Continue?
fr: Vous êtes sur le point de modifier %u fichiers. Poursuivre ?

source: Processing file ...
fr: Traitement du fichier ...

source: File contains ignore string, skipping it:
fr: Le fichier contient une chaîne ignorée, l'ignorer :

source: Inserting comment to file:
fr: Insertion d'un commentaire dans un fichier :

source: Template file contains text which is not comment, continue anyways?
fr: Le fichier modèle contient du texte qui n'est pas un commentaire, continuez quand même ?

source: Insert Copyrights Block
fr: Insérer le bloc des droits d'auteur

source: Template File Path:
fr: Chemin d'accès au fichier modèle :

source: Select the path to the file containing the template header to be prepended to the source files
fr: Sélectionnez le chemin d'accès au fichier contenant l'en-tête du modèle à ajouter aux fichiers sources

source: File Masking:
fr: Masquage des fichiers :

source: Ignore String:
fr: Ignorer la chaîne :

source: Set here a string that once found in the source file CodeLite will not prepend the Copyrights block to the file
fr: Définir ici une chaîne de caractères qui, une fois trouvée dans le fichier source, permettra à 'CodeLite' de ne pas ajouter le bloc de droit d'auteur au fichier

source: Backup modified files
fr: Sauvegarde des fichiers modifiés

source: &Save
fr: Enregi&strer

source: Copyrights Settings
fr: Paramètres des droits d'auteur

source: Choose a file:
fr: Choisissez un fichier :

source: Select projects to insert copyrights block:
fr: Sélectionnez les projets pour insérer le bloc des droits d'auteur :

source: Check &All
fr: &Tout vérifier

source: &Un-Check All
fr: To&ut décocher

source: &Insert
fr: &Insérer

source: Virtual name cannot be empty
fr: Le nom virtuel ne peut pas être vide

source: ......... Generated successfully!
fr: ......... Généré avec succès !

source: ......... Error!!!
fr: ......... Erreur !!!

source: Table %s has no primary key defined!
fr: La table %s n'a pas de clé primaire définie !

source: File name
fr: Nom de fichier

source: Error (%d): %s
fr: Erreur (%d) : %s

source: DB Error
fr: Erreur base de données

source: Unknown error.
fr: Erreur inconnue.

source: MySQL connection is not supported.
fr: La connexion 'MySQL' n'est pas prise en charge.

source: PostgreSQL connection is not supported.
fr: La connexion 'PostgreSQL' n'est pas prise en charge.

source: SQLite connection is not supported.
fr: La connexion 'SQLite' n'est pas prise en charge.

source: Open connection
fr: Ouvrir la connexion

source: Close selected connection
fr: Fermer la connexion choisie

source: Refresh View
fr: Rafraîchir la vue

source: Databases
fr: Bases de données

source: Databases (%s)
fr: Bases de données (%s)

source: Views
fr: Vues

source: Close
fr: Fermer

source: Close connection?
fr: Fermer la connexion ?

source: Add database
fr: Ajout d'une base de données

source: Database name
fr: Nom de la base de données

source: Database created successfully
fr: La base de données a été créée avec succès

source: Can't create new db in this database engine!
fr: Impossible de créer une nouvelle base de données dans ce moteur de base de données !

source: Error
fr: Erreur

source: Remove database '%s'?
fr: Supprimer la base de données '%s' ?

source: Drop database
fr: Abandonner la base de données

source: Database dropped successfully
fr: Abandon réussi de la base de données

source: Remove table '%s'?
fr: Supprimer la table '%s' ?

source: Drop table
fr: Abandon table

source: Table dropped successfully
fr: La table est supprimée avec succès

source: Remove view '%s'?
fr: Supprimer la vue '%s' ?

source: Drop view
fr: Abandon de la vue

source: View dropped successfully
fr: L'affichage a été abandonné avec succès

source: Import database from SQL file ...
fr: Importer une base de données à partir d'un fichier SQL ...

source: Dump data into file ...
fr: Vider les données dans un fichier ...

source: Data was saved to
fr: Les données ont été sauvegardées dans

source: Export database...
fr: Exporter la base de données...

source: The database has been exported to '%s'.
fr: La base de données a été exportée vers '%s'.

source: Successful!
fr: Une réussite !

source: Fail!
fr: Échec !

source: Close Connection
fr: Fermer la connexion

source: Refresh Connection
fr: Rafraîchir la connexion

source: Open SQL panel
fr: Ouvrir le panneau 'SQL'

source: Open SQL command panel for the database
fr: Ouvrir le panneau de commande 'SQ'L pour la base de données

source: Run SQL command for deleting Database
fr: Exécuter la commande 'SQL' pour supprimer la base de données

source: Create classes from DB
fr: Créer des classes à partir de la base de données

source: Create C++ classes for the database
fr: Créer des classes 'C++' pour la base de données

source: Import database from file
fr: Importer une base de données à partir d'un fichier
