Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Import an XRC file
fr: Importer un fichier 'XRC'

source: Failed to load the file to import
fr: Échec du chargement du fichier à importer

source: This doesn't seem to be a valid wxFormBuilder project file. Aborting.
fr: Ce fichier ne semble pas être un fichier de projet 'wxFormBuilder' valide. Abandon.

source: Can't import unknown class %s from wxFB
fr: Impossible d'importer la classe inconnue %s de 'wxFB'

source: This doesn't seem to be a valid wxSmith file. Aborting.
fr: Ceci ne semble pas être un fichier 'wxSmith' valide. Abandon.

source: Can't import unknown class %s in from wxSmith
fr: Impossible d'importer la classe inconnue %s de 'wxSmith'

source: This doesn't seem to be a valid XRC file. Aborting.
fr: Il ne semble pas s'agir d'un fichier 'XRC' valide. Abandon.

source: Can't import unknown class %s from XRC
fr: Impossible d'importer la classe inconnue %s de 'XRC'

source: Back to CodeLite
fr: Retour à 'CodeLite'

source: Generate Code
fr: Générer le code

source: Create an empty wxCrafter project
fr: Créer un projet 'wxCrafter' vide

source: Could not create resource file '
fr: Impossible de créer un fichier de ressources '

source: Open a wxCrafter file
fr: Ouvrir un fichier 'wxCrafter'

source: wxCrafter Project Settings
fr: - Paramètres du projet 'wxCrafter'

source: Output Directory
fr: Répertoire de sortie

source: The generated files' output directory
fr: Le répertoire de sortie des fichiers générés

source: The generated files' name. wxCrafter will generate a $(FILE).cpp and $(FILE).hpp
fr: Le nom des fichiers générés. 'wxCrafter' générera un fichier $'(FILE).cpp' et '$(FILE).hpp'

source: Additional Include Files
fr: Fichiers inclus supplémentaires

source: List of additional include files that should be included in the generated files e.g. my_header.hpp ; string.h
fr: Liste des fichiers d'inclusion supplémentaires qui doivent être inclus dans les fichiers générés par exemple : 'my_header.hpp ; string.h'

source: Bitmap Files
fr: Fichiers d'images

source: Set here the file name for the bitmaps wxCrafter converts all the bitmaps in the project into C++ code and will place them in this file
fr: Définissez ici le nom du fichier pour les images 'wxCrafter' convertit toutes les images du projet en code C++ et les place dans ce fichier

source: wxWindow ID Generation
fr: - Génération d'identifiants de 'wxWindow'

source: Generate Window ID
fr: Générer un identifiant de fenêtre

source: Auto generate enum in the base class for the wxWindow IDs which are not a stock window ID nor wrapped with the XRCID macro When left unchecked it is up to the user to provide a header file with the wxWindow IDs
fr: Générer automatiquement un 'enum' dans la classe de base pour les identifiants de 'wxWindow' qui ne sont pas des identifiants de fenêtre en stock ou qui ne sont pas enveloppés avec la macro 'XRCID'. Si la case n'est pas cochée, c'est à l'utilisateur de fournir un fichier d'en-tête avec les ID de 'wxWindow.'

source: First Window ID
fr: Premier identifiant de fenêtre

source: When 'Generate Window ID' is checked, use this as the first enumerator value
fr: Lorsque l'option « Générer l'identifiant de la fenêtre » est cochée, elle est utilisée comme première valeur de l'énumérateur

source: Generate Translatable Strings
fr: Générer des chaînes de caractères traductibles

source: When enabled, all generated strings are wrapped with the "_" macro, otherwise allow users to directly enter native text string encapsulated by wxT() macro
fr: Lorsque cette option est activée, toutes les chaînes générées sont enveloppées par la macro « _ », sinon elle permet aux utilisateurs de saisir directement la chaîne de texte native encapsulée par la macro 'wxT(')

source: Add wxWidgets Handlers if missing
fr: Ajouter les gestionnaires de 'wxWidgets' s'ils sont manquants

source: When enabled, wxCrafter will add missing handlers (e.g. wxBitmapXmlHandler)
fr: Lorsque cette option est activée, 'wxCrafter' ajoutera les gestionnaires manquants (par exemple 'wxBitmapXmlHandler').

source: A control with this name already exists!
fr: Un contrôle portant ce nom existe déjà !

source: Construct the Dropdown Menu
fr: Construire le menu déroulant

source: Flags
fr: Drapeaux

source: Border
fr: Bord

source: ** Click to select different virtual folder **
fr: ** Cliquez pour sélectionner un autre dossier virtuel **

source: wxCrafter Project
fr: - Projet 'wxCrafter'

source: The control's size. It is recommended to leave it as -1,-1 and let the sizers calculate the best size for the window
fr: La taille du contrôle. Il est recommandé de la laisser à -1,-1 et de laisser les calibreurs calculer la meilleure taille pour la fenêtre

source: The control's minimum size, to indicate to the sizer layout mechanism that this is the minimum required size
fr: La taille minimale du contrôle, pour indiquer au mécanisme de mise en page du calibreur qu'il s'agit de la taille minimale requise

source: Set the control's background colour
fr: Définir la couleur d'arrière-plan du contrôle

source: Set the control's foreground colour
fr: Définir la couleur d'avant-plan du contrôle

source: Set the control's font
fr: Définir la police de caractères du contrôle

source: Sets the control initial state to 'Hidden'
fr: Définit l'état initial du contrôle sur « Caché ».

source: Sets the control initial state to 'Disabled'
fr: Définit l'état initial du contrôle sur « Désactivé ».

source: This control should have keyboard focus
fr: Ce contrôle doit avoir la priorité sur le clavier

source: Text Editor
fr: Éditeur de texte

source: Use pre-defined font
fr: Utiliser une police prédéfinie

source: Bold
fr: Gras

source: Italic
fr: Italique

source: Underlined
fr: Souligné

source: Custom font
fr: Police de caractères personnalisée

source: Check this to prevent this dialog from showing up again
fr: Cochez cette case pour éviter que cette boîte de dialogue ne s'affiche à nouveau

source: Set the class name
fr: Définir le nom de la classe

source: Class:
fr: Classe :

source: XRC Preview class:
fr: Classe de prévisualisation 'XRC' :

source: Set here a standard wxWidgets control for preview purposes
fr: Définissez ici un contrôle 'wxWidgets' standard à des fins de prévisualisation

source: Set here a standard wxWidgets control for preview purposes (optional)
fr: Définir ici un contrôle 'wxWidgets' standard à des fins de prévisualisation (facultatif)

source: Additional include file
fr: Fichier d'inclusion supplémentaire

source: Include file:
fr: Fichier inclus :

source: Place here the include file that this custom control requires e.g. #include <MyCustomControl.hpp>
fr: Placez ici le fichier d'inclusion dont ce contrôle personnalisé a besoin par exemple : '#include <MyCustomControl.hpp>'

source: Implementation file content
fr: Contenu du fichier de mise en œuvre

source: You may use here the following macros (the macros expands to the value defined in the designer): $parent - expands to the custom control parent name $name - expands to the C++ member name $id - the control ID Example: $name = new MyControl($parent, $id)
fr: Vous pouvez utiliser les macros suivantes (les macros s'étendent à la valeur définie dans le concepteur) : $parent - se développe vers le nom du parent du contrôle personnalisé $name - se développe vers le nom du membre C $id - l'ID du contrôle Exemple : $name = new MyControl($parent, $id)

source: Place the instantation code here e.g. $(name) = new MyControl(this);
fr: Placez le code d'instantanéité ici par exemple : '$(name) = new MyControl(this)' ;

source: Custom Events
fr: Événements personnalisés

source: Define here custom events of the control e.g. 'Event Type' can be something like wxEVT_MY_BUTTON_CLICKED and 'Event Class' can be wxCommandEvent
fr: Définissez ici les événements personnalisés du contrôle par exemple, « Type d'événement » peut être quelque chose comme 'wxEVT_MY_BUTTON_CLICKED' et « Classe d'événement » peut être 'wxCommandEvent'

source: Event Type
fr: Type d'événement

source: Event Class
fr: Classe d'événement

source: Instantiation code:
fr: Code d'instanciation :

source: Events
fr: Évènements

source: Filepath to import:
fr: Chemin du fichier à importer :

source: Enter the filepath to import
fr: Saisir le chemin d'accès au fichier à importer

source: Destination Filepath:
fr: Chemin d'accès au fichier de destination :

source: Enter the name and path for wxCrafter file once it's imported
fr: Saisir le nom et le chemin d'accès du fichier 'wxCrafte'r une fois importé

source: Add the new wxcp file to the current project
fr: Ajouter le nouveau fichier 'wxcp' au projet en cours

source: Destination Virtual Folder:
fr: Dossier virtuel de destination :

source: If the resulting .wxcp file is to be added to the current project, it needs to go in a Virtual Folder. Enter the one to use.
fr: Si le fichier '.wxcp' résultant doit être ajouté au projet en cours, il doit être placé dans un dossier virtuel. Saisissez celui que vous souhaitez utiliser.

source: Load the .wxcp file when import is completed
fr: Charger le fichier '.wxcp' lorsque l'importation est terminée

source: Type part of the file and hit ENTER
fr: Tapez une partie du fichier et appuyez sur ENTRÉE

source: Select the controls you wish to delete:
fr: Sélectionnez les contrôles que vous souhaitez supprimer :

source: Delete the selected control
fr: Supprimer le contrôle sélectionné

source: Build:
fr: Construire :

source: Event Type:
fr: Type d'évènement :

source: Set the eventype here e.g. wxEVT_MY_BUTTON_CLICKED
fr: Définissez ici le type d'événement par exemple 'wxEVT_MY_BUTTON_CLICKED'

source: Event Class:
fr: Classe d'évènement :

source: The event class. e.g. wxCommandEvent
fr: La classe d'événement. Par exemple, 'wxCommandEvent'

source: Select bitmap from a file
fr: Sélectionner une image dans un fichier

source: Convert the selected path to relative (relative to the wxCrafter project file)
fr: Convertir le chemin sélectionné en chemin relatif (relatif au fichier du projet 'wxCrafter')

source: Use wxArtProvider
fr: Utilise 'wxArtProvider'

source: This type identifies a specific art object which can be requested to wxArtProvider.
fr: Ce type identifie un objet artistique spécifique qui peut être demandé à 'wxArtProvider'.

source: This type identifies the client of the art objects requested to wxArtProvider.
fr: Ce type identifie le client des objets artistiques demandés à 'wxArtProvider'.

source: Size Hint:
fr: Indice de taille :

source: Size of the returned bitmap or wxDefaultSize if size doesn't matter
fr: Taille de l'image retournée ou 'wxDefaultSize' si la taille n'a pas d'importance

source: Control Events
fr: Événements de contrôle

source: Inherited Events
fr: Évènements hérités

source: The new base-class must have a different name. If you don't enter one, it will be created for you. The inherited fields are optional, but a good idea.
fr: La nouvelle classe de base doit avoir un nom différent. Si vous n'en entrez pas, elle sera créée pour vous. Les champs hérités sont facultatifs, mais c'est une bonne idée.

source: New Base-Class Name:
fr: Nom de la nouvelle classe de base :

source: New Inherited-Class Name:
fr: Nouveau nom de la classe héritée :

source: New Inherited-Class Filename:
fr: Nouveau nom de fichier de la classe héritée :

source: The basename of the file for the new inherited class e.g. For FooDlg you might choose foodlg
fr: Le nom de base du fichier de la nouvelle classe héritée, par exemple, pour 'FooDlg', vous pouvez choisir 'foodlg'

source: Set label:
fr: Définissez l'étiquette :

source: Select bitmap:
fr: Sélectionner l'image :

source: Select
fr: Sélectionner

source: Font Picker
fr: Sélecteur de police

source: Define Custom Control
fr: Définir un contrôle personnalisé

source: Choose an XRC file to import
fr: Choisir le fichier 'XRC' à importer

source: About wxCrafter...
fr: À propos de 'wxCrafter' ...

source: New Custom Event
fr: Nouvel événement personnalisé

source: Select Bitmap
fr: Choisir l'image

source: Choose names
fr: Choisir les noms

source: Select Bitmap / Text
fr: Sélection de Image / Texte

source: Set File and Bitmap
fr: Définir le fichier et l'image

source: Forms
fr: Formes

source: Sizers
fr: Conteneurs

source: A standard wxButton that can be placed in side a wxStdDialogButtonSizer class
fr: Un bouton standard qui peut être placé à côté d'une classe 'wxStdDialogButtonSizer'

source: Stretchable spacer
fr: Espaceur extensible

source: Splitter Window Page
fr: Page de la fenêtre de division

source: Notebook Page
fr: Page du cahier

source: Controls
fr: Contrôles

source: Custom Control
fr: Contrôle personnalisé

source: Menu / ToolBar
fr: Menu / Barre d'outils

source: Sub Menu
fr: Sous menu

source: Toolbar Separator
fr: Séparateur pour barre d'outils

source: wxRibbonButton (Normal)
fr: normal 'wxRibbonButton'

source: wxRibbonButton (Dropdown)
fr: déroulant 'wxRibbonButton'

source: wxRibbonButton (Toggle)
fr: basculer 'wxRibbonButton'

source: wxRibbonTool (Normal)
fr: normal 'wxRibbonTool'

source: wxRibbonTool (Dropdown)
fr: déroulant 'wxRibbonTool'

source: wxRibbonTool (Toggle)
fr: bascule 'wxRibbonTool'

source: wxRibbonTool (Separator)
fr: séparateur 'wxRibbonTool '

source: Add a column...
fr: Ajouter une colonne ...

source: wxInfoBar Button
fr: bouton 'wxInfoBar'

source: Select the form type:
fr: Sélectionner le type de formulaire :

source: Select the form type
fr: Sélectionner le type de formulaire

source: Set the form title (optional):
fr: Définir le titre du formulaire (facultatif) :

source: Resource file:
fr: Fichier de ressource :

source: Select the wxcp project in which to put this new form
fr: Sélectionner le projet 'wxcp' dans lequel placer ce nouveau formulaire

source: Create a new wxcp file
fr: Créer un nouveau fichier 'wxcp'

source: Base class name:
fr: Nom de la classe de base :

source: The base class name e.g. FooBase wxCrafter will place all the generated UI code into this class. You will normally derive a class Foo from this class, and put your own code there.
fr: Le nom de la classe de base, par exemple 'FooBase' 'wxCrafter' placera tout le code généré dans cette classe. Vous dériverez normalement une classe 'Foo' à partir de cette classe, et y placerez votre propre code.

source: Derived class name:
fr: Nom de la classe dérivée :

source: The name of the class derived from 'Base class name' e.g. 'Foo' where the base-class is 'FooBase'.
fr: Le nom de la classe dérivée du « Nom de la classe de base », par exemple « Foo » lorsque la classe de base est « FooBase ».

source: Subclass file:
fr: Fichier sous-classe :

source: The filename in which to store the derived class (no need to add the extension). e.g. for a class Foo, stored in files foo.cpp and foo.hpp, write 'foo' here.
fr: Le nom de fichier dans lequel la classe dérivée doit être stockée (il n'est pas nécessaire d'ajouter l'extension). Par exemple, pour une classe 'Foo', stockée dans les fichiers 'foo.cpp' et 'foo.hpp', écrivez 'foo' ici.

source: Virtual Folder:
fr: Dossier virtuel :

source: Select the virtual folder within the project for the generated files
fr: Sélectionner le dossier virtuel dans le projet pour les fichiers générés

source: Create new wxCrafter Form
fr: Créer un nouveau formulaire 'wxCrafter'

source: wxWidgets GUI Designer
fr: - Concepteur d'interface graphique 'wxWidgets'

source: Show the designer
fr: Montrer le concepteur

source: Open wxCrafter project...
fr: Ouvrir le projet 'wxCrafter'...

source: Close wxCrafter project
fr: Fermer le projet 'wxCrafter'

source: Save project
fr: Enregistrer le projet

source: Import a wxSmith file
fr: Importer un fichier 'wxSmith'

source: Import from XRC
fr: Importation depuis 'XRC'

source: Define custom control...
fr: Définir un contrôle personnalisé...

source: Edit custom controls...
fr: Modifier les contrôles personnalisés...

source: Delete custom control...
fr: Supprimer le contrôle personnalisé...

source: wxCrafter project is modified Do you want to save your changes?
fr: - Le projet 'wxCrafter' est modifié Voulez-vous enregistrer vos modifications ?

source: Could not find target project: '
fr: Impossible de trouver le projet cible : '

source: Make sure that the virtual folder entry is valid (it must exist)
fr: Assurez-vous que l'entrée du dossier virtuel est valide (elle doit exister).

source: Virtual Folder provided was: '
fr: Le dossier virtuel fourni était : '

source: wxCrafter: code generation completed successfully!
fr: 'wxCrafter' : la génération de code a été effectuée avec succès !

source: Add wxWidgets UI Form...
fr: Ajouter un formulaire d'interface utilisateur 'wxWidgets'...

source: Could not create virtual folder 'wxcrafter'
fr: Impossible de créer le dossier virtuel 'wxcrafter'

source: Error while reading file content: '
fr: Erreur lors de la lecture du contenu du fichier : '

source: Could not read file content
fr: Ne peut pas lire le contenu du fichier

source: In order for the change to take place, you need to restart codelite
fr: Pour que la modification soit prise en compte, vous devez redémarrer 'Codelite'

source: Open with wxCrafter...
fr: Ouvrir avec 'wxCrafter' ...

source: Import with wxCrafter...
fr: Importer avec 'wxCrafter' ...

source: Re-generate code for project
fr: Régénérer le code pour le projet

source: This project does not contain any wxCrafter files
fr: Ce projet ne contient aucun fichier 'wxCrafter'

source: Icon Type:
fr: Type d'icône :

source: Bg Colour:
fr: Couleur de fond :

source: Fg Colour:
fr: Couleur de face :

source: Include File:
fr: Fichier inclus :

source: Hidden
fr: Caché

source: Disabled
fr: Désactivé

source: Focused
fr: Est mis en avant

source: Tooltip:
fr: Astuces :

source: Shortcut:
fr: Raccourci :

source: Default Button
fr: Bouton par défaut

source: Wrap:
fr: Encadrer :

source: # Columns:
fr: # Colonnes :

source: Col Label Vertical Align
fr: Alignement vertical de l'étiquette de colonne

source: Col Label Horizontal Align
fr: Alignement horizontal de l'étiquette de colonne

source: Rows:
fr: Lignes :

source: Row Label Vertical Align
fr: Alignement Vertical de l'étiquette de la ligne

source: Row Label Horizontal Align
fr: Alignement horizontal de l'étiquette de la ligne

source: Use Native Header
fr: Utiliser l'en-tête native

source: Use Native Column Labels
fr: Utiliser des étiquettes de colonnes natives

source: # Rows:
fr: # Lignes :

source: Growable columns:
fr: Colonnes extensibles :

source: Growable rows:
fr: Lignes extensibles :

source: Horizontal gap:
fr: Espace horizontal :

source: Vertical gap:
fr: Espace vertical :

source: Value:
fr: Valeur:

source: Max Length:
fr: Longueur 'max' :

source: Auto Complete Directories:
fr: Compléter automatiquement les répertoires :

source: Auto Complete Files:
fr: Compléter automatiquement fichiers :

source: Minimum Size:
fr: Taille minimale :

source: Bitmap File:
fr: Fichier image :

source: Bitmap File (16x16) :
fr: Fichier image (16x16) :

source: Bitmap File (32x32) :
fr: Fichier image (32x32) :

source: Bitmap File (64x64) :
fr: Fichier image (64x64) :

source: Bitmap File (128x128):
fr: Fichier image (128x128) :

source: Bitmap File (256x256):
fr: Fichier image (256x256) :

source: Disabled-Bitmap File
fr: Fichier d'image désactivé

source: Choices:
fr: Choix :

source: ComboBox Choices:
fr: Choix de la liste déroulante :

source: Selection:
fr: Sélection :

source: Title:
fr: Titre :

source: Enable Window Persistency:
fr: Activer la persistance des fenêtres :

source: Width:
fr: Largeur :

source: Height:
fr: Hauteur :

source: Major Dimension:
fr: Dimension principale :

source: Min value:
fr: Valeur 'Min' :

source: Max value:
fr: Valeur 'Max' :

source: Range:
fr: Étendue :

source: HTML Code:
fr: Code 'Html' :

source: Fit Content to Columns
fr: Ajuster le contenu aux colonnes

source: Allow Cell Editing
fr: Autoriser l'édition de cellules

source: Checked
fr: Coché

source: Show Cancel Button
fr: Afficher le bouton Annuler

source: Show Search Button
fr: Afficher le bouton de recherche

source: Wildcard:
fr: Joker :

source: Thumbsize:
fr: Taille des vignettes :

source: Page Size:
fr: Taille de page :

source: Normal Colour:
fr: Couleur normale :

source: Visited Colour:
fr: Couleur visitée :

source: Hover Colour:
fr: Couleur de survol :

source: Default Path:
fr: Chemin par défaut :

source: Filter Index:
fr: Indice de filtre :

source: Show Hidden Files:
fr: Afficher les fichiers cachés :

source: Scroll Rate X:
fr: Vitesse de défilement X :

source: Scroll Rate Y:
fr: Vitesse de défilement Y :

source: Expand Node
fr: Développer les noeuds

source: Null Page
fr: Page Nulle

source: Split Mode:
fr: Mode divisé :

source: Sash Gravity:
fr: Poids de la séparation :

source: Minimum Pane Size:
fr: Taille de bordure :

source: Sash Position:
fr: Position de la séparation :

source: Set Splitter Left:
fr: Placer le séparateur à gauche :

source: Cell Position:
fr: Position d'une cellule :

source: Cell Span:
fr: Durée de vie d'une cellule :

source: Kind:
fr: Genre :

source: Help String:
fr: Chaîne d'aide :

source: Margins:
fr: Marges :

source: Bitmap Size:
fr: Taille de l'image :

source: Field Count:
fr: Nombre de champs :

source: Padding:
fr: Remplissage :

source: Separator Size:
fr: Taille du séparateur :

source: Line Number Margin
fr: Marge des numéros de ligne

source: Symbol Margin
fr: Symbole de marge

source: Fold Margin
fr: Marge de repliement

source: Separator Margin
fr: Marge de séparation

source: Lexer
fr: Lexique

source: Wrap Text
fr: Encadrer le texte

source: Indentation Guides
fr: Guides d'indentation

source: Display EOL Markers
fr: Affichage des marqueurs de fin de ligne

source: Class Decorator
fr: Décorateur de classe

source: Alignment
fr: Alignement

source: Generated Model Class Name
fr: Nom de classe du modèle généré

source: Cell Mode
fr: Mode cellulaire

source: Column Flags
fr: Drapeaux de colonne

source: Container Item Has Columns
fr: L'élément du conteneur a des colonnes

source: Gradient Start
fr: Début du dégradé

source: Gradient End
fr: Fin du dégradé

source: Collapsed
fr: Effondré

source: Icon ID
fr: Identifiant d'icône

source: Sash Size
fr: Taille de la séparation

source: Pane Border Size
fr: Taille de la bordure du panneau

source: Sash Colour
fr: Couleur de la séparation

source: Caption Colour
fr: Couleur de légende

source: Caption Gradient Colour
fr: Couleur du dégradé de la légende

source: Inactive Caption Colour
fr: Couleur de légende inactive

source: Inactive Caption Gradient Colour
fr: Couleur du dégradé des légendes inactives

source: Active Caption Text Colour
fr: Couleur de la légende active

source: Inactive Caption Text Colour
fr: Couleur de la légende inactive

source: Gradient Type
fr: Type de dégradé

source: Bitmap Mask
fr: Masque d'image

source: Base Class Suffix
fr: Suffixe de la classe de base

source: Interval
fr: Intervalle

source: One Shot Timer
fr: Une seule fois

source: Output File Name
fr: Nom du fichier de sortie

source: Inherited Class
fr: Classe héritée

source: Keywords Set 1
fr: Jeu de mots-clés 1

source: Keywords Set 2
fr: Jeu de mots-clés 2

source: Keywords Set 3
fr: Jeu de mots-clés 3

source: Keywords Set 4
fr: Jeu de mots-clés 4

source: Keywords Set 5
fr: Jeu de mots-clés 5

source: Ribbon Theme
fr: Thème du ruban

source: Minimum #Rows
fr: Nombre minimal de lignes

source: Maximum #Rows
fr: Nombre maximal de lignes

source: Backend
fr: Précédent

source: wxMediaCtrl Controls
fr: contrôles 'wxMediaCtrl'

source: wxFrame Type
fr: -Type 'wxFrame'

source: Show Effect
fr: Visualiser l'effet

source: Property Editor Control
fr: Contrôle de l'éditeur de propriétés

source: Construct the Dropdown Menu:
fr: Construire le menu déroulant :

source: Text Hint
fr: Indice de texte

source: Load and play
fr: Charger et jouer
