Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Reload Modified Files
fr: Recharger les fichiers modifiés

source: Files have been modified outside the editor. Choose which files you would like to reload.
fr: Les fichiers ont été modifiés en dehors de l'éditeur. Choisissez les fichiers que vous souhaitez recharger.

source: Please save your changes before marking the file as read only
fr: Veuillez enregistrer vos modifications avant de marquer le fichier en lecture seule

source: Save the current layout as:
fr: Sauvegarder la mise en page actuelle sous :

source: Save Perspective As...
fr: Enregistrer la perspective sous...

source: Welcome!
fr: Bienvenue !

source: ' already exists
fr: ' existe déjà

source: A file with similar name '
fr: Un fichier portant un nom similaire '

source: Overwrite it?
fr: L'écraser ?

source: Warning
fr: Avertissement

source: Importing IDE solution/workspace...
fr: Importation d'une solution/espace de travail 'IDE'...

source: Solution/workspace unsupported
fr: Solution/espace de travail non pris en charge

source: There is already a file in this folder with a name: %s that matches using case-insensitive comparison
fr: Il existe déjà un fichier dans ce dossier avec un nom : %s qui correspond en utilisant la comparaison insensible à la casse

source: This won't be a problem on Linux, but it may be on other, case-insensitive platforms
fr: Cela ne pose pas de problème sous 'Linux', mais peut l'être sur d'autres plates-formes non sensibles à la casse

source: Add the file anyway?
fr: Ajouter quand même le fichier ?

source: Possible name-clash
fr: Possibilité de conflit de noms

source: %u file(s) not added, probably due to a name-clash
fr: %u fichier(s) non ajouté(s), probablement en raison d'un conflit de noms

source: Working directory is set to:
fr: Le répertoire de travail est défini sur :

source: Program exited
fr: Programme abandonné

source: Failed to locate the configured default terminal application required by CodeLite, please install it or check your configuration!
fr: L'application de terminal par défaut requise par 'odeLite'n'a pas été localisée, veuillez l'installer ou vérifier votre configuration !

source: ': debugger not loaded
fr: ' : le débogueur n'est pas chargé

source: Failed to launch debugger '
fr: Échec du lancement du débogueur '

source: Make sure that you have an open workspace and that the active project is of type 'Executable'
fr: Assurez-vous que votre espace de travail est ouvert et que le projet actif est de type « exécutable ».

source: Could not find project configuration!
fr: Impossible de trouver la configuration du projet !

source: Make sure that everything is set properly in your project settings
fr: Assurez-vous que tout est bien réglé dans les paramètres de votre projet

source: Could not launch terminal for debugger
fr: Impossible de lancer le terminal pour le débogueur

source: Failed to initialize debugger:
fr: Échec de l'initialisation du débogueur :

source: Debug session started successfully!
fr: La session de débogage a démarré avec succès !

source: Program Received signal
fr: Signal du programme reçu

source: Stack trace is available in the 'Call Stack' tab
fr: La trace de la pile est disponible dans l'onglet « Pile d'appel ».

source: Assertion failed! Stack trace is available in the 'Call Stack' tab
fr: L'assertion a échoué ! La trace de la pile est disponible dans l'onglet 'Pile d'appel'.

source: Debugger exited with the following error string: %s
fr: Le débogueur est sorti avec la chaîne d'erreur suivante : %s

source: Continuing...
fr: Poursuivre...

source: This would terminate the current debug session, continue?
fr: Cela mettrait fin à la session de débogage en cours ?

source: Compile Single File
fr: Compilation d'un seul fichier

source: Preprocess File
fr: Prétraitement du fichier

source: Build cancelled. The following compilers referred by the workspace could not be found:
fr: La construction a été annulée. Les compilateurs suivants référencés par l'espace de travail n'ont pas pu être trouvés :

source: Please fix your project settings by selecting a valid compiler
fr: Veuillez corriger les paramètres de votre projet en sélectionnant un compilateur valide

source: Build Aborted
fr: Construction annulée

source: Compilers updated successfully! You can now build your workspace
fr: Mise à jour réussie des compilateurs ! Vous pouvez maintenant construire votre espace de travail

source: What would you like to call the current state?
fr: Comment appelez-vous l'état actuel ?

source: Label current state
fr: Étiqueter l'état actuel

source: Go to line number (1 - %i):
fr: Aller au numéro de ligne (1 - %i) :

source: Go To Line
fr: Aller à la ligne

source: '%s' is not a valid line number
fr: '%s' n'est pas un numéro de ligne valide

source: Please insert a line number in the range of (1 - %i)
fr: Veuillez insérer un numéro de ligne compris entre (1 - %i)

source: Select the file in which to place the function implementation:
fr: Sélectionnez le fichier dans lequel placer l'implémentation de la fonction :

source: Function implementation (you can edit the code below):
fr: Mise en œuvre de la fonction (vous pouvez éditer le code ci-dessous) :

source: Move Function Implementation Preview
fr: Aperçu de la mise en œuvre de la fonction de déplacement

source: File:
fr: Fichier :

source: Configuration Name:
fr: Nom de la configuration :

source: Copy Settings from:
fr: Copier les paramètres de :

source: -- None --
fr: -- Aucun --

source: Configuration Name is empty
fr: Le nom de la configuration est vide

source: Location:
fr: Emplacement :

source: Add New File
fr: Ajouter un nouveau fichier

source: select a folder
fr: choisir un dossier

source: Copy Value to Clipboard
fr: Copier la valeur dans le presse-papiers

source: Create the folder on the file system as well
fr: Créez également le dossier sur le système de fichiers

source: Enter new expression:
fr: Entrer une nouvelle expression :

source: Edit Item
fr: Modifier l'élément

source: Browse for folder
fr: Rechercher un dossier

source: Workspace Name:
fr: Nom de l'espace de travail :

source: Generated File:
fr: Fichier généré :

source: Create the workspace under a separate directory
fr: Créer l'espace de travail dans un répertoire séparé

source: Choose a folder:
fr: Choisissez un dossier :

source: The selected project path '
fr: Le chemin du projet sélectionné '

source: ' Contains some invalid characters Continue anyways?
fr: ' Contient des caractères non valides Continuer quand même ?

source: Invalid path:
fr: Chemin non valide :

source: A workspace file with this name already exists
fr: Un fichier d'espace de travail portant ce nom existe déjà

source: Sort
fr: Tri

source: Caret / Scrolling
fr: Curseur / Déroulement

source: Save Options
fr: Sauvegarder les options

source: Hidden Tabs
fr: Onglets cachés

source: Keep open
fr: Garder ouvert

source: Don't close this pane when an editor gets focus
fr: Ne pas fermer ce volet lorsqu'un éditeur obtient le focus

source: Scroll on Output
fr: Défilement de la sortie

source: Clear All
fr: Tout effacer

source: Fold All Results
fr: Replier tous les résultats

source: Repeat
fr: Répéter

source: Uncheck All
fr: Tout décocher

source: Manage Plugins
fr: Gérer les extensions

source: Author
fr: Auteur

source: Is Loaded?
fr: Est-il chargé ?

source: Project enabled
fr: Projet validé

source: When unchecked, this project will not be built for the current build configuration
fr: Si la case n'est pas cochée, ce projet ne sera pas construit pour la configuration de construction actuelle

source: Dynamic Library
fr: Bibliothèque dynamique

source: Static Library
fr: Bibliothèque statique

source: Executable
fr: Exécutable

source: Sets the type of the project
fr: Définit le type de projet

source: Makefile Generator
fr: Générateur de fichiers de fabrication

source: Select the Makefile generator to use. By default, CodeLite uses its builtin Makefile generator
fr: Sélectionnez le générateur de 'Makefile' à utiliser. Par défaut, 'CodeLite' utilise son générateur de 'Makefile' intégré

source: Set the Makefile generator arguments
fr: Définir les arguments du générateur de 'Makefile'

source: Compiler
fr: Compilateur

source: Select the compiler to use. The compiler controls two aspects of the project: - If the project is _not_ a custom build, then this compiler is used for compilation - CodeLite uses the compiler definition for parsing the output
fr: Sélectionnez le compilateur à utiliser. Le compilateur contrôle deux aspects du projet : - Si le projet n'est _pas_ une construction personnalisée, alors ce compilateur est utilisé pour la compilation - 'CodeLite' utilise la définition du compilateur pour analyser la sortie

source: Intermediate Directory
fr: Répertoire intermédiaire

source: The name of the folder used for the generated objects during compilation
fr: Le nom du dossier utilisé pour les objets générés lors de la compilation

source: Output File
fr: Fichier de sortie

source: The name of the output file (e.g. the executable file name)
fr: Le nom du fichier de sortie (par exemple le nom du fichier exécutable)

source: Execution
fr: Exécution

source: Pause when execution ends
fr: Pause en fin d'exécution

source: After the execution of the program ends, show a console with the message "Hit any key to continue..." This is useful when you wish to view the output printed to stdout before the console terminates
fr: Après la fin de l'exécution du programme, affichez une console avec le message « Appuyez sur n'importe quelle touche pour continuer... » Ceci est utile lorsque vous souhaitez voir la sortie imprimée sur 'stdout' avant que la console ne se termine

source: This program is a GUI application
fr: Ce programme est une application graphique

source: By marking the project as a GUI project, CodeLite will launch the program without any console terminal wrapping the process execution
fr: En marquant le projet comme un projet GUI, 'CodeLite' lancera le programme sans qu'aucun terminal de console n'entoure l'exécution du processus

source: Executable to Run / Debug
fr: Exécutable à exécuter / déboguer

source: The executable to run / debug
fr: L'exécutable à lancer / déboguer

source: Working Directory
fr: Répertoire de travail

source: The working directory to set before executing or debugging the program
fr: Le répertoire de travail à définir avant d'exécuter ou de déboguer le programme

source: Program Arguments
fr: Arguments du programme

source: The command line arguments to pass to the program when executing or debugging it
fr: Les arguments de la ligne de commande à passer au programme lors de son exécution ou de son débogage

source: Debugging
fr: Déboguage

source: Select the debugger type to use for this project
fr: Sélectionnez le type de débogueur à utiliser pour ce projet

source: Use separate debugger args
fr: Utiliser des arguments distincts pour le débogueur

source: When enabled (.e.g. set to True) codelite will pass the arguments set in 'Debug Program Arguments'
fr: Lorsque cette option est activée (par exemple, si elle est réglée sur vrai), 'Codelite' transmet les arguments définis dans « Arguments du programme de débogage ».

source: Debug Program Arguments
fr: Arguments du programme de débogage

source: Arguments to pass to the debugger
fr: Arguments à transmettre au débogueur

source: Compiler is not required for this project
fr: Le compilateur n'est pas nécessaire pour ce projet

source: Copy settings for this page from another project
fr: Copier les paramètres de cette page à partir d'un autre projet

source: Append to global settings
fr: Ajouter aux paramètres globaux

source: Overwrite global settings
fr: Écraser les paramètres globaux

source: Prepend to global settings
fr: Prédisposer aux paramètres globaux

source: Use with Global Settings
fr: Utilisation des paramètres globaux

source: Define how CodeLite will merge the compiler settings defined in the 'Global Settings' with the settings defined on this page
fr: Définir comment 'CodeLite' va fusionner les paramètres du compilateur définis dans les 'Paramètres globaux' avec les paramètres définis sur cette page

source: C++ Compiler Options
fr: Options du compilateur 'C++'

source: Additional compiler options to pass to the compiler provided as a semi-colon delimited list
fr: Options de compilation supplémentaires à transmettre au compilateur, sous la forme d'une liste délimitée par des points-virgules

source: C Compiler Options
fr: Options du compilateur 'C'

source: Additional C compiler options to pass to the compiler provided as a semi-colon delimited list (used for C files only)
fr: Options de compilation C supplémentaires à transmettre au compilateur, sous la forme d'une liste délimitée par des points-virgules (utilisée uniquement pour les fichiers C)

source: Assembler Options
fr: Options de l'assembleur

source: Additional assembler options to pass to the assembler provided as a semi-colon delimited list (used for .s files only)
fr: Options d'assemblage supplémentaires à passer à l'assembleur, sous forme de liste délimitée par des points-virgules. (utilisé pour les fichiers .s uniquement)

source: Include Paths
fr: Inclure les chemins

source: Include path to pass to the compiler (provided as semi-colon delimited list)
fr: Chemin d'inclusion à transmettre au compilateur (fourni sous forme de liste délimitée par des points-virgules)

source: Preprocessors
fr: Préprocesseurs

source: macros ("defines") to pass to the compiler (provided as semi-colon delimited list)
fr: les macros (« defines ») à transmettre au compilateur (fournies sous forme de liste délimitée par des points-virgules)

source: Pre Compiled Header
fr: En-tête pré-compilée

source: Header File
fr: Fichier d'en-tête

source: Pre compiled header
fr: En-tête pré-compilée

source: Explicitly Include PCH
fr: Inclure explicitement le'PCH'

source: Explicitly include the PCH file in the command line using a compiler switch (.e.g -include /path/to/pch)
fr: Inclure explicitement le fichier 'PCH' dans la ligne de commande à l'aide d'un commutateur du compilateur (.e.g -'include /path/to/pch')

source: PCH Compile Flags
fr: Drapeaux de compilation du 'PCH'

source: Use separate compilation flags for the PCH file
fr: Utiliser des drapeaux de compilation distincts pour le fichier 'PCH'

source: Replace
fr: Remplacer

source: Append
fr: Ajouter

source: Just Include
fr: Inclure seulement

source: PCH Compile Flags Policy
fr: Politique des drapeaux de compilation de la 'PCH'

source: When compiling a PCH, use the value set in PCH compile Flags as follows: - Append: append the value - Replace: replace any other compile flags with this value (not recommended) - Just Include: don't attempt to build the PCH, just include it
fr: Lors de la compilation d'un 'PCH', la valeur définie dans les drapeaux de compilation du 'PCH' est utilisée comme suit : - Append : ajouter la valeur - Remplacer : remplacer tous les autres drapeaux de compilation par cette valeur (non recommandé) - Juste Inclure : ne pas essayer de compiler le 'PCH', juste l'inclure

source: Linker is not required for this project
fr: Le lieur n'est pas requis pour ce projet

source: Use with global settings
fr: Utilisation avec les paramètres globaux

source: Define how CodeLite will merge the linker settings defined in the 'Global Settings' with the settings defined on this page
fr: Définir comment 'CodeLite' va fusionner les paramètres de l'éditeur de liens définis dans les 'Paramètres globaux' avec les paramètres définis sur cette page

source: Add additional linker options separated by semi-colon
fr: Ajouter des options supplémentaires pour l'éditeur de liens, séparées par un point-virgule

source: Libraries Search Path
fr: Chemin de recherche des bibliothèques

source: Add additional library search paths separated by semi-colon
fr: Ajouter des chemins de recherche de bibliothèque supplémentaires séparés par un point-virgule

source: Libraries
fr: Bibliothèques

source: Enter any extra library names, separated by';' e.g. Foo or Foo;Bar
fr: Saisissez tout nom de bibliothèque supplémentaire, séparé par « ; », par exemple 'Foo' ou 'Foo;Bar'

source: Select debugger path. Leave empty to use the default:
fr: Sélectionnez le chemin du débogueur. Laisser vide pour utiliser le chemin par défaut :

source: Debugger Search Paths
fr: Chemins de recherche du débogueur

source: &Add..
fr: &Ajouter...

source: &Delete...
fr: &Supprimer...

source: Enter here any commands that should be passed to the debugger on startup:
fr: Saisissez ici les commandes qui doivent être transmises au débogueur au démarrage :

source: Remote Attach Commands
fr: Commandes d'attachement à distance

source: Enter here any commands that should be passed to the debugger after attaching the remote target:
fr: Saisissez ici les commandes qui doivent être transmises au débogueur après l'attachement de la cible distante :

source: Debugging a remote target
fr: Déboguer une cible distante

source: Host / tty:
fr: Hôte / télétype :

source: Extended Protocol
fr: Protocole étendu

source: Enable extended mode. In extended mode, the remote server is made persistent. i.e. it does not go down after the debug session ends
fr: Activer le mode étendu. En mode étendu, le serveur distant est rendu persistant. C'est-à-dire qu'il ne s'éteint pas après la fin de la session de débogage

source: Resources
fr: Ressources

source: Resource Compiler Options
fr: Options du compilateur de ressources

source: Resource compiler options provided as semi-colon list
fr: Options du compilateur de ressources fournies sous la forme d'une liste de points-virgules

source: Additional Search Path
fr: Chemin de recherche additionnel

source: Resource compiler search path, as semi colon list
fr: Chemin de recherche du compilateur de ressources, sous forme de liste de points-virgules

source: Environment variable set to use:
fr: Variable d'environnement à utiliser :

source: Debugger 'PreDefined Types' set to use:
fr: Le débogueur 'PreDefined Types' est activé :

source: Additional environment variables:
fr: Variables d'environnement supplémentaires :

source: Enable custom build
fr: Activer la construction personnalisée

source: Working Directory:
fr: Répertoire de travail :

source: Target
fr: Cible

source: Additional compiler options to pass to the compiler provided as a semi-colon delimited list These settings are used by _all_ build configurations (e.g. Release and Debug)
fr: Options de compilation supplémentaires à passer au compilateur, sous la forme d'une liste délimitée par des points-virgules Ces paramètres sont utilisés par _toutes_ les configurations de compilation (par exemple 'Release' et 'Debug')

source: Additional C compiler options to pass to the compiler provided as a semi-colon delimited list These settings are used by _all_ build configurations (e.g. Release and Debug)
fr: Options supplémentaires du compilateur C à passer au compilateur fournies sous forme de liste délimitée par des points-virgules Ces paramètres sont utilisés par _toutes_ les configurations de compilation (par exemple 'Release' et 'Debug')

source: Additional Include Paths
fr: Chemins supplémentaires d'inclusion

source: Compiler search paths for header files. These settings are used by _all_ build configurations (e.g. Release and Debug)
fr: Chemins de recherche du compilateur pour les fichiers d'en-tête. Ces paramètres sont utilisés par _toutes_ les configurations de compilation (par exemple 'Release' et 'Debug').

source: Additional preprocessors definitions provided as a semi-colon delimited list These settings are used by _all_ build configurations (e.g. Release and Debug)
fr: Définitions de préprocesseurs supplémentaires fournies sous la forme d'une liste délimitée par des points-virgules Ces paramètres sont utilisés par _toutes_ les configurations de compilation (par exemple 'Release' et 'Debug')

source: Additional linker options provided as a semi-colon delimited list These settings are used by _all_ build configurations (e.g. Release and Debug)
fr: Options supplémentaires de l'éditeur de liens fournies sous la forme d'une liste délimitée par des points-virgules Ces paramètres sont utilisés par _toutes_ les configurations de construction (par exemple 'Release' et 'Debug')

source: Library Path
fr: Chemin de la bibliothèque

source: Additional library search path provided as a semi-colon delimited list These settings are used by _all_ build configurations (e.g. Release and Debug)
fr: Chemin de recherche de bibliothèque supplémentaire fourni sous la forme d'une liste délimitée par des points-virgules Ces paramètres sont utilisés par _toutes_ les configurations de compilation (par exemple Release et Debug)

source: Dependencies:
fr: Dépendances :

source: Rule action:
fr: Règle d'action :

source: Define here a custom makefile rule to be executed in the pre-build steps. See the wiki for more help
fr: Définir ici une règle de 'makefile' personnalisée à exécuter dans les étapes de pré-construction. Voir le wiki pour plus d'aide

source: Search paths:
fr: Chemins de recherche :

source: Macros (clang only):
fr: Macros ('clang' uniquement) :

source: Target Name:
fr: Nom de la cible :

source: Project Name:
fr: Nom du projet :

source: Project Settings
fr: Paramètres du projet

source: Build Target
fr: Construire la cible

source: Copy Compiler Settings
fr: Copier les paramètres du compilateur

source: Environment
fr: Environnement

source: Pre / Post Build Commands
fr: Commandes avant et après la construction

source: Pre Build
fr: Pré-construction

source: Post Build
fr: Post-construction

source: Customize
fr: Personnaliser

source: Custom Build
fr: Construction personnalisée

source: Custom Makefile Rules
fr: Règles personnalisées du 'Makefile'

source: Global Settings
fr: Paramètres globaux

source: Save Changes
fr: Enregistrer les modifications

source: Save changes before loading new configuration?
fr: Sauvegarder les modifications avant de charger la nouvelle configuration ?

source: Project Settings
fr: Paramètres du projet

source: This project is disabled
fr: Ce projet est désactivé

source: The settings on this page are ignored during build
fr: Les paramètres de cette page sont ignorés lors de la construction

source: Set the commands to run in the pre build stage
fr: Définir les commandes à exécuter dans la phase de pré-construction

source: Set the commands to run in the post build stage
fr: Définir les commandes à exécuter dans la phase de post-construction

source: Commands starting with the hash sign ('#'), will not be executed
fr: Les commandes commençant par le signe dièse ('#') ne seront pas exécutées

source: Compiler options
fr: Options du compilateur

source: Target '%s' already exist!
fr: La cible '%s' existe déjà !

source: Adjust settings to fit this generator?
fr: Ajuster les paramètres en fonction de ce générateur ?

source: Choose a directory
fr: Choisir un répertoire

source: Linker options
fr: Options de l'éditeur de liens

source: Debugger:
fr: Débogueur :

source: Executable:
fr: Exécutable :

source: Provide an alternate debugger executable to use. This is currently only supported for GDB Leave empty to use the default
fr: Fournir un autre exécutable de débogage à utiliser. Cette option n'est actuellement prise en charge que pour 'GDB' Laisser vide pour utiliser l'exécutable par défaut

source: Select debugger executable
fr: Sélectionner l'exécutable du débogueur

source: Debuggee:
fr: Débogage :

source: Enter the filepath to the program that you want to debug. Alternatively, if you enter the path below, putting just the filename here will suffice.
fr: Saisissez le chemin d'accès au programme que vous souhaitez déboguer. Alternativement, si vous entrez le chemin d'accès ci-dessous, il suffira d'entrer le nom du fichier ici.
