Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Enable Spell Checking
fr: Activer le correcteur orthographique

source: Keep as a class member
fr: Conserver en tant que membre de la classe

source: Invalid XRC! could not save DesignerPreview.xrc
fr: 'XRC' invalide ! Impossible d'enregistrer 'DesignerPreview.xrc'

source: Show Preview
fr: Prévisualisation

source: Show Preview...
fr: Prévisualisation ...

source: Close Preview
fr: Fermer l'aperçu

source: Close Preview...
fr: Fermer l'aperçu...

source: Delete Item
fr: Supprimer l'élément

source: Align Left
fr: Aligner à gauche

source: Align Center
fr: Aligner au centre

source: Align Center Horizontally
fr: Aligner le centre horizontalement

source: Align Right
fr: Aligner à droite

source: Align Top
fr: Aligner en haut

source: Align Middle
fr: Aligner au milieu

source: Align Center Vertically
fr: Aligner le centre verticalement

source: Align Bottom
fr: Aligner en bas

source: All Borders
fr: Toutes les bordures

source: Left Border
fr: Bord gauche

source: Top Border
fr: Bord supérieur

source: Right Border
fr: Bord droit

source: Bottom Border
fr: Bord inférieur

source: Set Sizer Proportion to 1
fr: Régler la proportion du calibreur à 1

source: Expand Item
fr: Développer l'élément

source: Move Left
fr: Déplacer à gauche

source: Move Left into parent sizer
fr: Déplacer la gauche dans le calibreur parent

source: Move Right
fr: Déplacer à droite

source: Move Right into a sibling sizer
fr: Passer à la taille du calibreur voisin

source: Error occurred while opening file '
fr: Erreur lors de l'ouverture du fichier

source: ' for writing
fr: ' pour écriture

source: Current file has been modified Continue?
fr: Le fichier actuel a été modifié Continuer ?

source: Open wxCrafter project
fr: Ouvrir le projet 'wxCrafter'

source: Can't paste it here
fr: Je ne peux pas le coller ici

source: This name is already in use. Try again?
fr: Ce nom est déjà utilisé. Réessayer ?

source: Only one wxAui Manager is allowed
fr: Un seul gestionnaire 'wxAui' est autorisé

source: Can't insert this item here There is already a main sizer
fr: Impossible d'insérer cet élément ici Il y a déjà un calibreur principal

source: Can't insert this item here This item is managed by wxAUI
fr: Impossible d'insérer cet élément ici Cet élément est géré par wxAUI

source: Current file has been modified Close anyway?
fr: Le fichier actuel a été modifié Fermer quand même ?

source: Generate C++ code
fr: Générer un code 'C++'

source: Generate XRC
fr: Générer 'XRC'

source: Choose a control
fr: Choisir un contrôle

source: wxAui Manager can not be placed onto a control with a main sizer
fr: -Le gestionnaire "wxAui" ne peut pas être placé sur un contrôle avec un calibreur principal

source: wxRibbonPanel can only have one direct child
fr: 'wxRibbonPanel' ne peut avoir qu'un seul enfant direct

source: A Main Sizer can not be placed into a wxAui managed window
fr: Un calibreur principal ne peut pas être placé dans une fenêtre gérée par 'wxAui'

source: Can't insert this item here
fr: Impossible d'insérer cet élément ici

source: Rename '
fr: Renommer '

source: Enter the new name:
fr: Veuillez entrer le nouveau nom :

source: You need to enable at least one of 'Generate C++ code' and 'Generate XRC'
fr: Vous devez activer au moins l'une des options suivantes : Générer du code 'C++' et Générer des 'XRC'.

source: Please set the base classes generated files output directory This can be done by selecting the root item of the tree and edit the properties
fr: Veuillez définir le répertoire de sortie des fichiers générés par les classes de base Pour ce faire, sélectionnez l'élément racine de l'arbre et modifiez les propriétés

source: You must save the project before generating code
fr: Vous devez enregistrer le projet avant de générer du code

source: Select wxCrafter files:
fr: Sélectionner les fichiers 'wxCrafter' :

source: Please close the current wxCrafter project before batch generating code
fr: Veuillez fermer le projet 'wxCrafter' en cours avant de générer du code par lots

source: Generating Code...
fr: Génération du code ...

source: Generated Code For the following projects:
fr: Code généré pour les projets suivants :

source: codelite's virtual folder for the generated files
fr: le dossier virtuel de codelite pour les fichiers générés

source: A wxInitDialogEvent is sent as a dialog or panel is being initialised. Handlers for this event can transfer data to the window. The default handler calls wxWindow::TransferDataToWindow
fr: Un événement 'wxInitDialogEvent' est envoyé lors de l'initialisation d'un dialogue ou d'un panneau. Les gestionnaires de cet événement peuvent transférer des données à la fenêtre. Le gestionnaire par défaut appelle 'wxWindow::TransferDataToWindow'

source: Process a close event. This event applies to wxFrame and wxDialog classes
fr: Traite un événement de fermeture. Cet événement s'applique aux classes 'wxFrame' et 'wxDialog'

source: Process a wxEVT_ACTIVATE event
fr: Traitement d'un événement 'wxEVT_ACTIVATE'

source: Process a wxEVT_ACTIVATE_APP event
fr: Traitement d'un événement 'wxEVT_ACTIVATE_APP'

source: Dialog Icons
fr: Icônes de dialogue

source: Select a 16x16 bitmap
fr: Sélectionner une image bitmap 16x16

source: Select a 32x32 bitmap
fr: Sélectionner une image bitmap 32x32

source: Select a 64x64 bitmap
fr: Sélectionner une image bitmap 64x64

source: Select a 128x128 bitmap
fr: Sélectionner une image bitmap 128x128

source: Select a 256x256 bitmap
fr: Sélectionner une image bitmap 256x256

source: Frame Type
fr: Type de cadre

source: Select the wxFrame type you want
fr: Sélectionnez le type de 'wxFrame' souhaité

source: Frame Icons
fr: Icônes de cadre

source: The filenames for the generated files
fr: Les noms des fichiers générés

source: The bitmaps size
fr: La taille des bitmaps

source: True if masks should be created for all images
fr: Vrai si des masques doivent être créés pour toutes les images

source: My Wizard
fr: Mon assistant

source: The default bitmap used in the left side of the wizard.
fr: L'image par défaut utilisée dans la partie gauche de l'assistant.

source: The page has just been changed (this event cannot be vetoed)
fr: La page vient d'être modifiée (cet événement ne peut pas faire l'objet d'un veto)

source: The page is being changed (this event can be vetoed).
fr: La page est en train d'être modifiée (cet événement peut faire l'objet d'un veto).

source: The page was shown and laid out.
fr: La page a été montrée et mise en page.

source: The user attempted to cancel the wizard (this event may also be vetoed).
fr: L'utilisateur a tenté d'annuler l'assistant (cet événement peut également faire l'objet d'un veto).

source: The wizard help button was pressed.
fr: Le bouton d'aide de l'assistant a été actionné.

source: The wizard finished button was pressed.
fr: Le bouton de fin de l'assistant a été actionné.

source: Wizard Icons
fr: Icônes de l'assistant

source: ==> Breakpoints:
fr: ==> Points d'arrêt :

source: Lost connection to dap server
fr: La connexion au serveur 'dap' est perdue

source: Launch
fr: Lancer

source: Attach
fr: Joindre

source: Set Breakpoint...
fr: Définir le point d'arrêt...

source: Debug File Name
fr: Nom du fichier de débogage

source: Stack
fr: Pile

source: Scope Variables
fr: Variables 'Scope'

source: wxFormBuilder path:
fr: chemin d'accès 'wxFormBuilder' :

source: wxFormBuilder Settings...
fr: paramètres 'wxFormBuilder' ...

source: Select wxFormBuilder exe:
fr: Sélectionnez 'wxFormBuilder exe' :

source: Invalid C++ class name
fr: Nom de classe 'C++' invalide

source: wxFormBuilder integration with CodeLite
fr: - Intégration de wxFormBuilder' avec 'CodeLite'

source: New wxDialog...
fr: Nouveau 'wxDialog' ...

source: New wxDialog with Default Buttons...
fr: Nouveau 'wxDialog' avec boutons par défaut...

source: New wxFrame...
fr: Nouveau 'wxFrame' ..

source: New wxPanel...
fr: Nouveau 'wxPanel' ...

source: Can't find wxFormBuilder template file '%s'
fr: Impossible de trouver le fichier modèle 'wxFormBuilder' '%s'

source: Please select a 'fbp' (Form Builder Project) file only
fr: Veuillez sélectionner uniquement un fichier 'fbp' (Form Builder Project)

source: New wxDialog with Default Buttons
fr: Nouveau 'wxDialog' avec boutons par défaut

source: Open with wxFormBuilder...
fr: Ouvrir avec 'wxFormBuilder' ...
