Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Pass --check-config to Cppchecker. This is useful if you get a 'Cppcheck cannot find all the include files' warning: it lets you see which #include aren't being located. However it turns off other checks.
fr: Passer '--check-config' à 'Cppchecker'. Ceci est utile si vous obtenez un avertissement 'Cppcheck cannot find all the include files' : cela vous permet de voir quels inclus ne sont pas localisés. Cependant, cela désactive d'autres vérifications.

source: Exclude
fr: Exclure

source: Files to exclude from CppCheck test:
fr: Fichiers à exclure du test 'CppCheck' :

source: Add file(s) to the excluded files list
fr: Ajouter un ou plusieurs fichiers à la liste des fichiers exclus

source: Remove the selected file from the excluded file list
fr: Supprimer le fichier sélectionné de la liste des fichiers exclus

source: Clear the excluded files list
fr: Effacer la liste des fichiers exclus

source: Types of warnings NOT to display:
fr: Types d'avertissements à NE PAS afficher :

source: Add an extra check to suppress. You'll need to know its id...
fr: Ajoutez une vérification supplémentaire pour la suppression. Vous devrez connaître son identifiant...

source: Remove the selected suppression from the list
fr: Supprimer la suppression sélectionnée de la liste

source: Remember these settings
fr: Se souvenir de ces paramètres

source: If ticked, these settings will be saved and be applied in the future. Otherwise the warnings will be back when you restart CodeLite, which may be what you should want.
fr: Si vous cochez cette case, ces paramètres seront sauvegardés et appliqués à l'avenir. Sinon, les avertissements réapparaîtront lorsque vous redémarrerez 'CodeLite', ce qui peut être souhaitable.

source: Include Dirs
fr: Inclure les répertoires

source: If the 'Missing Includes' check is enabled, add here any extra directories where Cppcheck should search for #includes
fr: Si la vérification 'Inclus manquants' est activée, ajoutez ici les répertoires supplémentaires où 'Cppcheck' doit rechercher les '#includes'. où 'Cppcheck' devrait rechercher des '#includes'

source: Add the full path to a directory to search for #includes
fr: Ajouter le chemin complet d'un répertoire pour rechercher les '#includes'

source: Suppress warnings about 'system' includes
fr: Supprimer les avertissements concernant les inclusions « système

source: If ticked, the 'missingIncludeSystem' suppression is passed to Cppcheck. This stops it complaining about a missing #include <foo>, while still detecting a missing #include "bar"
fr: Si elle est cochée, la suppression de 'missingIncludeSystem' est transmise à 'Cppcheck'. Cela l'empêche de se plaindre d'un '#include <foo>' manquant, tout en détectant un '#include « bar »' manquant

source: If ticked, these settings will be saved and be applied in the future. Otherwise the warnings will be back when you restart CodeLite, which may be what you want.
fr: Si vous cochez cette case, ces paramètres seront sauvegardés et appliqués à l'avenir. Sinon, les avertissements réapparaîtront lorsque vous redémarrerez 'CodeLite', ce qui peut être ce que vous souhaitez.

source: Command-line Definitions
fr: Définitions de la ligne de commande

source: Here you can pass 'configurations' to cppcheck e.g. "Only test code branches where FOO is defined" or "Don't test code branches where the value of FOO is 2"
fr: Ici, vous pouvez passer des « configurations » à 'cppcheck' par exemple : « Ne tester que les branches de code où 'FOO' est défini » ou « Ne pas tester les branches de code où la valeur de FOO est 2 »

source: Defines to pass e.g. FOO or FOO=1:
fr: Définition à transmettre par exemple FOO ou FOO=1 :

source: Add here definitions of code branches you want to be checked e.g. 'FOO' or 'BAR=2'. Each will be passed to Cppcheck as '-DFOO' or -D'BAR=2' (so don't write the -D yourself).
fr: Ajoutez ici les définitions des branches de code que vous souhaitez vérifier, par exemple 'FOO' ou 'BAR=2'. Chacune sera transmise à Cppcheck sous la forme '-DFOO' ou -D'BAR=2' (n'écrivez donc pas le -D vous-même).

source: Undefines to pass:
fr: Indéfinitions pour passer :

source: Here you can add undefines (branches you don't want to be checked) e.g. 'FOO' or 'BAR=2'. Each will be passed to Cppcheck as '-UFOO' or -U'BAR=2' (so don't write the -U yourself).
fr: Ici, vous pouvez ajouter des indéfinitions (branches que vous ne voulez pas voir vérifiées), par exemple 'FOO' ou 'BAR=2'. Chacune sera transmise à Cppcheck sous la forme '-UFOO' ou -U'BAR=2' (n'écrivez donc pas le -U vous-même).

source: Description to show in the dialog
fr: Description à afficher dans le dialogue

source: This is what you'll see in the settings dialog. Put whatever you like here; it's not used internally
fr: C'est ce que vous verrez dans la boîte de dialogue des paramètres. Mettez ce que vous voulez ici ; ce n'est pas utilisé en interne

source: The ID string that cppchecker will recognise
fr: La chaîne d'identification que "cppchecker "reconnaîtra

source: Enter here the unique ID string that cppchecker can recognise. Examples are "operatorEqVarError" and "uninitMemberVar". You can find these by grepping the cppchecker source, or by running cppchecker on your app in a terminal and passing the additional parameter '--xml'.
fr: Saisissez ici la chaîne d'identification unique que "cppchecker" peut reconnaître. Des exemples sont « operatorEqVarError » et « uninitMemberVar ». Vous pouvez les trouver en cherchant dans le source de "cppchecker", ou en lançant "cppchecker" sur votre application dans un terminal et en passant le paramètre supplémentaire '--xml'.

source: CppCheck settings
fr: Paramètres de 'CppCheck'

source: CppChecker add warning suppression
fr: 'CppChecker' ajoute la suppression des avertissements

source: Search scope:
fr: Chercher 'scope' :

source: Update Db if stale
fr: Mise à jour de la base de données si elle est périmée

source: If checked, before executing a command CScope will look for any changed files and, if found, try to update the database. In practice this seems unreliable.
fr: Si cette option est cochée, avant d'exécuter une commande, 'CScope' recherchera les fichiers modifiés et, s'il en trouve, essaiera de mettre à jour la base de données. Dans la pratique, cela semble peu fiable.

source: Create reverted Index
fr: Créer un index inversé

source: Create reverted Index database
fr: Créer une base de données Index inversée

source: &Update
fr: &Actualiser

source: Perform an immediate database update
fr: Effectuer une mise à jour immédiate de la base de données

source: CScope executable:
fr: Exécutable 'CScope' :

source: Set the path to cscope executable
fr: Définir le chemin d'accès à l'exécutable de c'scope'

source: CScope Settings
fr: Paramètres du 'CScope'

source: CScope Integration for CodeLite
fr: Intégration de 'CScope' pour 'CodeLite'

source: Find selected text
fr: Rechercher le texte sélectionné

source: Find this global definition
fr: Trouver cette définition globale

source: Find functions called by this function
fr: Recherche des fonctions appelées par cette fonction

source: Find functions calling this function
fr: Rechercher les fonctions appelant cette fonction

source: Create CScope database
fr: Créer une base de données 'CScope'

source: Find this C symbol
fr: Trouvez ce symbole 'C'

source: Find ...
fr: Trouver ...

source: Find this C global definition
fr: Trouvez cette définition globale 'C'

source: Find files #&including this filename
fr: Trouver les fichiers #&incluant ce nom de fichier

source: Find files #including this filename
fr: Trouver les fichiers #comprenant ce nom de fichier

source: Create/Recreate the cscope database
fr: Créer/recréer la base de données 'cscope'

source: CScope settings
fr: Paramètres du 'CScope'

source: Configure cscope
fr: Configurer 'cscope'

source: &Find this C symbol
fr: &Trouver ce symbole 'C'

source: Find this &global definition
fr: Trouver cette &définition globale

source: Find functions &called by this function
fr: Rechercher les fonctions & appelées par cette fonction

source: Fi&nd functions calling this function
fr: Re&chercher les fonctions appelant cette fonction

source: Create CScope &database
fr: Créer 'CScope' et sa base de données

source: Creating file list...
fr: Créer une liste de fichiers...

source: I can't find 'cscope' anywhere. Please check if it's installed.
fr: Je ne trouve 'cscope' nulle part. Veuillez vérifier s'il est installé.

source: Or tell me where it can be found, from the menu: 'Plugins | CScope | Settings'
fr: Ou dites-moi où vous pouvez le trouver, dans le menu : 'Extensions | CScope | Paramètres'

source: CScope not found
fr: 'CScope' introuvable

source: cscope results for: find global definition of '
fr: résultats de 'cscope' pour : trouver la définition globale de '

source: cscope results for: functions called by '
fr: - Résultats du 'cscope' pour : fonctions appelées par '

source: cscope results for: functions calling '
fr: - Résultats du 'cscope' pour : fonctions appelantes '

source: cscope results for: files that #include '
fr: résultats du 'cscope pour : fichiers qui inclus '

source: Recreated inverted CScope DB
fr: Base de données inversée recrée de CScope

source: Recreated CScope DB
fr: Base de données recrée de 'CScope'

source: Enter the symbol to search for:
fr: Saisissez le symbole à rechercher :

source: cscope: find symbol
fr: 'cscope' : trouver un symbole

source: Executing cscope...
fr: Exécuter de 'cscope' ...

source: Parsing results...
fr: Résultats de l'analyse ...

source: Active Project
fr: Projet actif

source: Entire Workspace
fr: Espace de travail complet

source: Line:
fr: Ligne :

source: File: `
fr: Fichier : `

source: ` is not opened on the server
fr: ` n'est pas ouvert sur le serveur

source: Initialization started...
fr: L'initialisation a commencé...

source: Initialization completed
fr: L'initialisation est terminée

source: unsupported message: `
fr: message non supporté : `

source: Create local branch
fr: Créer une branche locale

source: Switch to local branch
fr: Passer à la branche locale

source: Switch to remote branch
fr: Passer à la branche distante

source: Apply Patch
fr: Appliquer le correctif

source: Start gitk
fr: Démarrer 'gitk'

source: Garbage collect
fr: Collecte des déchets

source: Plugin settings
fr: Paramètres de l'extension

source: Clone a git repository
fr: Cloner un dépôt 'git'

source: Clear Git Log
fr: Effacer le journal 'Git'

source: Terminate Git Process
fr: Terminer le processus 'Git'

source: Add File
fr: Ajouter un fichier

source: Reset File
fr: Réinitialiser le fichier

source: Reset
fr: Réinitialiser

source: Reset repository
fr: Réinitialiser le dépôt

source: Pull
fr: Tirer

source: Pull remote changes
fr: Récupérer les changements distants

source: Commit local changes
fr: Livrer les modifications locales

source: Push
fr: Pousser

source: Push local changes
fr: Pousser les changements locaux

source: Rebase
fr: Rebasage

source: Diffs
fr: Différences

source: Show current diffs
fr: Afficher les différences actuelles

source: Browse commit history
fr: Consulter l'historique des livraisons

source: Git blame
fr: 'Git' faute

source: Open MSYS Git
fr: Ouvrir 'MSYS Git'

source: Open MSYS Git at the current file location
fr: Ouvrir 'MSYS Git' à l'emplacement du fichier actuel

source: Reset file
fr: Réinitialiser le fichier

source: Toggle All
fr: Basculer tout

source: Simple GIT plugin
fr: Extension simple pour 'GIT'

source: GIT plugin
fr: Extension 'GIT'

source: Commit changes
fr: Changements de livraison

source: Push changes
fr: Pousser les modifications

source: Reset current repository
fr: Réinitialiser le dépôt actuel

source: Switch local branch
fr: Changer de branche locale

source: Switch remote branch
fr: Commuter la branche distante

source: List commits
fr: Liste des livraisons

source: Show diffs
fr: Montrer les différences

source: Show blame
fr: Montrer les reproches

source: Show git blame
fr: Montrer le reproche de git

source: List modified files
fr: Liste des fichiers modifiés

source: Clean git database (garbage collection)
fr: Nettoyer la base de données 'gi't (collecte des déchets)

source: Refresh file lists
fr: Actualiser la liste des fichiers

source: Refresh git file list
fr: Rafraîchir la liste de fichiers 'git'

source: GIT plugin settings
fr: Paramètres de l'extension GIT

source: Using git Click to open the git view
fr: Utilisation de git Cliquer pour ouvrir la vue git

source: Modified files found! Commit them first before switching branches...
fr: Fichiers modifiés trouvés ! Commencez par les valider avant de changer de branche...

source: No other local branches found.
fr: Aucune autre branche locale n'a été trouvée.

source: Select branch (current is
fr: Sélectionner une branche (la branche actuelle est

source: Switch branch
fr: Changer de branche

source: No remote branches found.
fr: Aucune branche distante n'a été trouvée.

source: Select remote branch (current is
fr: Sélectionner la branche distante (la branche actuelle est

source: Branch name
fr: Nom de la branche

source: Specify the name for the local branch
fr: Indiquer le nom de la branche locale

source: Specify the name of the new branch
fr: Spécifier le nom de la nouvelle branche

source: Switch to new branch
fr: Passer à une nouvelle branche

source: Switch to new branch once it is created?
fr: Passer à la nouvelle branche une fois qu'elle est créée ?

source: No remotes found, can't push!
fr: Aucune commande distante trouvée, impossible de livrer !

source: Push all local commits?
fr: Pousser toutes les modifications locales ?

source: Save all changes and pull remote changes?
fr: Sauvegarder toutes les modifications et extraire les modifications à distance ?

source: Are you sure that you want to discard all local changes?
fr: Êtes-vous sûr de vouloir annuler toutes les modifications locales ?

source: Jump to modified file
fr: Passer au fichier modifié

source: Modified files
fr: Fichiers modifiés

source: Colouring tracked git files...
fr: Coloration des fichiers de suivis 'git'...

source: Colouring modified git files...
fr: Coloration des fichiers modifiés 'git'...

source: Workspace View [
fr: Vue de l'espace de travail [

source: Do you want to start importing new / updating changed files?
fr: Voulez-vous commencer à importer de nouveaux fichiers ou à mettre à jour des fichiers modifiés ?

source: Import files
fr: Importer des fichiers

source: Error obtaining project
fr: Erreur lors de l'obtention du projet

source: Checking file
fr: Vérification du fichier

source: Adding files...
fr: Ajout de fichiers...

source: Finished adding files...
fr: Fin de l'ajout des fichiers...

source: created
fr: créé

source: Merged after pull. Rebase?
fr: Fusionné après tirage. Refonte ?

source: Rebase with what branch?
fr: Reprise avec quelle branche ?

source: Rebase with
fr: Reprise avec

source: Remote git error (needs to be handled manually on the remote server)
fr: Erreur 'git' distant (doit être traitée manuellement sur le serveur distant)

source: Are you sure you want to continue connecting
fr: Êtes-vous sûr de vouloir continuer à vous connecter

source: Save all changes and rebase?
fr: Sauvegarder tous les changements et rétablir la base ?

source: Add file
fr: Ajouter un fichier

source: Show file diff
fr: Afficher les différences de fichiers

source: Show file Log
fr: Afficher le journal de fichiers

source: Show Git Blame
fr: Montrer la remarque de 'Git'

source: Don't know how to start MSYSGit...
fr: Je ne sais pas comment démarrer 'MSYSGit'...

source: Stash
fr: Réserve

source: Stash pop
fr: Pousser dans la réserve

source: Open git bash
fr: Ouvrir le logiciel 'git bash'

source: ERROR: Failed to write commit message to file:
fr: ERREUR : Echec de l'écriture du message de validation dans le fichier :

source: error: no commit message given, aborting
fr: erreur : aucun message de validation n'a été donné, l'opération est interrompue

source: All files are up-to-date!
fr: Tous les fichiers sont actualisés !

source: Toggle files
fr: Basculer les fichiers

source: Show commit history
fr: Afficher l'historique des livraisons

source: Git requires a commit message
fr: 'Git' exige un message de livraison

source: Copy commit hash to clipboard
fr: Copier le hachage de la livraison dans le presse-papiers

source: Revert this commit
fr: Annuler cette livraison

source: Are you sure you want to revert commit #
fr: Etes-vous sûr de vouloir annuler la livraison #

source: Git executable:
fr: Exécutable 'git' :

source: Gitk executable:
fr: Exécutable 'gitk' :

source: Git Shell command:
fr: Commande ligne 'git' :

source: Global user name:
fr: Nom d'utilisateur global :

source: Set the global user name (this name will tell git who you are)
fr: Définir le nom d'utilisateur global (ce nom indiquera à 'git' qui vous êtes)

source: Global email:
fr: Courriel global :

source: Set the global email
fr: Définir le courriel global

source: Local repository user name:
fr: Nom de l'utilisateur du dépôt local :

source: Set the current repository user name (this name will tell git who you are). If this field left empty, the global one is used
fr: Définit le nom d'utilisateur du référentiel actuel (ce nom indiquera à 'git' qui vous êtes). Si ce champ est vide, le nom global est utilisé

source: Local repository email:
fr: Courriel du dépôt local :

source: Set the current repository email If this field left empty, the global one is used
fr: Définir le courriel du dépôt actuel Si ce champ est vide, l'adresse globale est utilisée

source: Optional - Full path to project's git repo:
fr: Facultatif - Chemin complet vers le dépôt 'git' du projet :

source: Show Terminal
fr: Afficher le terminal

source: Mainly useful for Windows when the password prompt is not accessible via the UI
fr: Principalement utile pour Windows lorsque l'invite de mot de passe n'est pas accessible via l'interface utilisateur. n'est pas accessible via l'interface utilisateur

source: Verbose Logging
fr: Journalisation prolixe

source: Tick this option to enable a verbose logging of git
fr: Cochez cette option pour activer une journalisation prolixe de 'git'

source: Show commit info in the status bar
fr: Afficher les informations relatives à la livraison dans la barre d'état

source: Amend the previous commit
fr: Modifier la précédente livraison

source: The 'git commit --amend' command is a convenient way to fix up the most recent commit. It lets you combine staged changes with the previous commit instead of committing it as an entirely new snapshot. It can also be used to simply edit the previous commit message without changing its snapshot
fr: La commande 'git commit --amend' est un moyen pratique de corriger la dernière livraison. Elle vous permet de combiner les modifications de l'étape avec la livraison précédente au lieu de le livrer comme un nouvel instantané. Elle peut également être utilisée pour éditer simplement le message de la livraison précédente sans modifier son instantané

source: Search for specific text in commits. This uses --grep, and so searches only the text of the commit message. To search by author etc, use the 'Extra arguments' box.
fr: Recherche d'un texte spécifique dans les livraisons. Cette option utilise '--grep', et ne recherche donc que le texte du message de livraison. Pour effectuer une recherche par auteur, etc., utilisez la case « Arguments supplémentaires ».

source: Previous
fr: Précédent

source: Show previous 100 commits
fr: Afficher les 100 dernières livraisons

source: Fetch the next 100 commits
fr: Récupérer les 100 prochaines livraisons

source: Optional extra arguments that you wish passed to git log. An example might be: --since="2 weeks ago" Note that this is _not_ sanity-checked, it's added just as it is
fr: Arguments supplémentaires optionnels que vous souhaitez passer au journal de 'git'. Un exemple pourrait être : '--since= "il y a 2 semaines" ' Notez que ceci n'est pas vérifié, il est ajouté tel quel

source: --regexp-ignore-case Display commits that match the pattern without regard to case
fr: '--regexp-ignore-case' Afficher les livraisons qui correspondent au motif sans tenir compte de la casse

source: Subject
fr: Sujet

source: Modified files:
fr: Fichiers modifiés :

source: Commit message:
fr: Message de la livraison :

source: Unstaged
fr: Sans mise en scène

source: Staged
fr: Mise en scène

source: Both
fr: Les deux

source: Show changes that are:
fr: Montrer les changements qui sont :

source: Ignore if whitespace-only
fr: Ignorer uniquement les espaces

source: Suppress any lines where the change is only to whitespace. This makes it easier to see the interesting parts of the diff.
fr: Supprimez toutes les lignes où le changement ne concerne que les espaces. Cela permet de voir plus facilement les parties intéressantes de la différence.

source: Choose commits
fr: Choisir les livraisons

source: This dialog normally shows only the current difference from HEAD. Click to choose any two commits to diff.
fr: Cette boîte de dialogue n'affiche normalement que la différence actuelle par rapport à 'HEAD'. Cliquez pour choisir deux commits à différencier.

source: Choose two commits to diff
fr: Choisissez deux livraisons à différencier

source: Either select a branch, tag or commit hash, or enter your own commit-ish. Optionally you can then specify the 'n'th parent of each commit, and/or use the triple-dot notation for commits where this makes sense.
fr: Sélectionnez une branche, un tag ou un 'hash' de livraison, ou saisissez votre propre livraison. En option, vous pouvez spécifier le 'n' ème parent de chaque livraison, et/ou utiliser la notation à trois points pour les livraisons où cela a un sens.

source: First
fr: Premier

source: Branch
fr: Branche

source: Here you can choose one of the last 1000 commits to diff against. They will normally be from the currently checked-out branch. However if you select a different branch above, that branch's commits will be shown instead.
fr: Ici, vous pouvez choisir l'un des 1000 derniers livraisons à comparer. Ils proviendront normalement de la branche en cours de vérification. Cependant, si vous sélectionnez une branche différente, les commits de cette branche seront affichés à la place.

source: Enter commit-ish
fr: Entrer 'commit-ish'

source: You can enter any valid commit-ish here. It will not be sanity-checked...
fr: Vous pouvez entrer n'importe quelle livraison valide ici. Elle ne sera pas vérifiée...

source: Second
fr: Seconde

source: Use '...'
fr: Utiliser '...'

source: Check this to use the 'triple-dot' notation. The resulting diff will show the changes between the merge-base and the second commit-ish. So if the first commit-ish is 'master' and the second the branch 'foo', it will show the changes in foo since it split from master. Note that this will not make sense for all commit-ishes.
fr: Cochez cette case pour utiliser la notation « triple point ». Le diff résultant montrera les changements entre la base de fusion et le deuxième 'commit-ish'. Ainsi, si le premier 'commit-ish' est 'master' et le second la branche 'foo', il montrera les changements dans foo depuis qu'il s'est séparé de la branche master. Notez que cela n'a pas de sens pour tous les commit-ish.

source: If you enter a non-zero value here, the diff will use that parent of the commit instead of the commit itself. So if the commit is HEAD, entering 5 will use HEAD~5, the fifth parent.
fr: Si vous entrez une valeur non nulle ici, le différentiel utilisera le parent de la livraison au lieu de la livraison elle-même. Ainsi, si la livraison est 'HEAD', la saisie de 5 utilisera 'HEAD~5', le cinquième parent.

source: Clone URL:
fr: Cloner l'URL :

source: git URL to clone
fr: 'URL git' à cloner

source: Target Directory:
fr: Répertoire cible :
