Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Sets the colour used to print the label of the hyperlink when the mouse is over the control
fr: Définit la couleur utilisée pour imprimer l'étiquette du lien hypertexte lorsque la souris se trouve au-dessus du contrôle

source: My Label
fr: Mon étiquette

source: The label of the button. It may only be empty if the button ID is one of the stock ids in which case the corresponding stock label (see wxGetStockLabel()) will be used
fr: L'étiquette du bouton. Il ne peut être vide que si l'identificateur du bouton est l'un des identificateurs du stock, auquel cas l'étiquette de stock correspondante (voir 'wxGetStockLabel()') sera utilisée

source: Process a wxEVT_COMMAND_LISTBOX_SELECTED event, when an item on the list is selected or the selection changes.
fr: Traite un événement 'wxEVT_COMMAND_LISTBOX_SELECTED' lorsqu'un élément de la liste est sélectionné ou que la sélection change.

source: Process a wxEVT_COMMAND_LISTBOX_DOUBLECLICKED event, when the listbox is double-clicked.
fr: Traite un événement 'wxEVT_COMMAND_LISTBOX_DOUBLECLICKED' lorsque la boîte à liste est double-cliquée.

source: wxListCtrl Column
fr: - Colonne 'wxListCtrl'

source: Column caption
fr: Colonne du titre

source: Column Width Set it to -1 for auto sizing. Or set it to -2 to fit the column width to heading or to extend to fill all the remaining space for the last column Value > 0 will set the width in pixels
fr: Largeur de la colonne Réglez-le à -1 pour un dimensionnement automatique. Ou mettez-le à -2 pour adapter la largeur de la colonne à l'en-tête ou pour l'étendre afin de remplir tout l'espace restant pour la dernière colonne. Une valeur > 0 définit la largeur en pixels

source: The item has been selected
fr: L'élément a été sélectionné

source: The item has been deselected
fr: L'élément a été désélectionné

source: The right mouse button has been clicked on an item
fr: Le bouton droit de la souris a été cliqué sur un élément

source: The middle mouse button has been clicked on an item
fr: Le bouton du milieu de la souris a été cliqué sur un élément

source: The item has been activated (ENTER or double click)
fr: L'élément a été activé (ENTRÉE ou double clic)

source: The currently focused item has changed
fr: L'élément sur lequel porte l'attention a changé

source: A key has been pressed
fr: Une touche a été pressée

source: A column (m_col) has been left-clicked
fr: Une colonne (m_col) a été cliquée avec le bouton gauche de la souris

source: A column (m_col) has been right-clicked
fr: Une colonne (m_col) a fait l'objet d'un clic droit

source: The user started resizing a column - can be vetoed
fr: L'utilisateur a commencé à redimensionner une colonne - il est possible d'opposer un veto

source: The divider between columns is being dragged
fr: Le séparateur entre les colonnes est déplacé

source: A column has been resized by the user
fr: Une colonne a été redimensionnée par l'utilisateur

source: Begin dragging with the left mouse button
fr: Début du tirage par le bouton gauche de la souris

source: Begin dragging with the right mouse button.
fr: Commencez à faire glisser la souris avec le bouton droit.

source: Begin editing a label. This can be prevented by calling Veto()
fr: Commencer à éditer une étiquette. Ceci peut être évité en appelant 'Veto()'

source: Finish editing a label. This can be prevented by calling Veto()
fr: Terminer l'édition d'une étiquette. Ceci peut être évité en appelant 'Veto()'

source: Delete an item
fr: Supprimer un élément

source: Delete all items
fr: Supprimer tous les éléments

source: An item has been inserted
fr: Un élément a été inséré

source: Select the media control backend, leave empty for the default
fr: Sélectionnez le système de contrôle des médias, laissez vide pour le système par défaut

source: Show the player controls
fr: Afficher les commandes du lecteur

source: Sent when a media has loaded enough data that it can start playing
fr: Envoyé lorsqu'un média a chargé suffisamment de données pour pouvoir commencer la lecture

source: Sent when a media has switched to the wxMEDIASTATE_STOPPED state. You may be able to Veto this event to prevent it from stopping, causing it to continue playing - even if it has reached that end of the media (note that this may not have the desired effect - if you want to loop the media, for example, catch the EVT_MEDIA_FINISHED and play there instead).
fr: Envoyé lorsqu'un média est passé à l'état 'wxMEDIASTATE_STOPPED'. Il est possible de mettre un Veto sur cet événement pour éviter qu'il ne s'arrête et pour qu'il continue à jouer, même s'il a atteint la fin du média (notez que cela peut ne pas avoir l'effet désiré - si vous voulez faire tourner le média en boucle, par exemple, attrapez l'EVT_MEDIA_FINISHED' et jouez à ce moment-là).

source: Sent when a media has finished playing in a wxMediaCtrl.
fr: Envoyé lorsqu'un média a fini d'être lu dans un 'wxMediaCtrl'.

source: Sent when a media has switched its state (from any media state)
fr: Envoyé lorsqu'un média a changé d'état (à partir de n'importe quel état du média)

source: Sent when a media has switched to the wxMEDIASTATE_PLAYING state
fr: Envoyé lorsqu'un média est passé à l'état 'wxMEDIASTATE_PLAYING'

source: Sent when a media has switched to the wxMEDIASTATE_PAUSED state
fr: Envoyé lorsqu'un média est passé à l'état 'wxMEDIASTATE_PAUSED'

source: Menu item has been clicked
fr: Un élément de menu a été cliqué

source: C++ variable name
fr: Nom de variable 'C++'

source: Menu Item
fr: Élément de menu

source: The menu item label
fr: Le libellé de l'élément de menu

source: Short help string
fr: Chaîne d'aide abrégée

source: Menu item image
fr: Image de l'élément de menu

source: The type of menu item: normal, radio, checkable or separator
fr: Le type d'élément de menu : normal, radio, à cocher ou séparateur

source: For a checkable menu item, should this be checked
fr: Dans le cas d'un élément de menu à cocher, la case doit être cochée

source: The menu is about to open
fr: Le menu va s'ouvrir

source: A particular menu item has been highlit
fr: Un élément particulier du menu a été mis en évidence

source: The currently selected menu item has changed
fr: L'élément de menu actuellement sélectionné a changé

source: The menu is about to close
fr: Le menu est sur le point de se fermer

source: A title for the popup menu
fr: Un titre pour le menu déroulant

source: The tab's label
fr: Le libellé de l'onglet

source: Tab Image
fr: Image de l'onglet

source: Select this page
fr: Choisir cette page

source: Add a NULL page. This is only makes sense when the notebook is of type wxTreebook
fr: Ajouter une page vide. Cela n'a de sens que si le carnet est de type 'wxTreebook'

source: Expand this node
fr: Développer ce nœud

source: Respond to wxEVT_PG_SELECTED event, generated when a property selection has been changed, either by user action or by indirect program function. For instance, collapsing a parent property programmatically causes any selected child property to become unselected, and may therefore cause this event to be generated.
fr: Répond à l'événement 'wxEVT_PG_SELECTED', généré lorsque la sélection d'une propriété a été modifiée, soit par une action de l'utilisateur, soit par une fonction indirecte du programme. Par exemple, la réduction d'une propriété parentale par programme entraîne la dé-sélection de toute propriété enfant sélectionnée et peut donc entraîner la génération de cet événement.

source: Respond to wxEVT_PG_CHANGED event, generated when property value has been changed by the user
fr: Répond à l'événement 'wxEVT_PG_CHANGED', généré lorsque la valeur d'une propriété a été modifiée par l'utilisateur

source: Respond to wxEVT_PG_CHANGING event, generated when property value is about to be changed by user. Use wxPropertyGridEvent::GetValue() to take a peek at the pending value, and wxPropertyGridEvent::Veto() to prevent change from taking place, if necessary
fr: Répond à l'événement 'wxEVT_PG_CHANGING', généré lorsque la valeur d'une propriété est sur le point d'être modifiée par l'utilisateur. Utilisez 'wxPropertyGridEvent::GetValue()' pour jeter un coup d’œil à la valeur en attente, et 'wxPropertyGridEvent::Veto()' pour empêcher la modification, si nécessaire

source: Respond to wxEVT_PG_HIGHLIGHTED event, which occurs when mouse moves over a property. Event's property is NULL if hovered area does not belong to any property.
fr: Répond à l'événement 'wxEVT_PG_HIGHLIGHTED, qui se produit lorsque la souris passe sur une propriété. La propriété de l'événement est nul si la zone survolée n'appartient à aucune propriété.

source: Respond to wxEVT_PG_RIGHT_CLICK event, which occurs when property is clicked on with right mouse button.
fr: Répond à l'événement 'wxEVT_PG_RIGHT_CLICK', qui se produit lorsque la propriété est cliquée avec le bouton droit de la souris.

source: Respond to wxEVT_PG_DOUBLE_CLICK event, which occurs when property is double-clicked on with left mouse button.
fr: Répond à l'événement 'wxEVT_PG_DOUBLE_CLICK', qui se produit lorsque l'on double-clique sur une propriété avec le bouton gauche de la souris.

source: Respond to wxEVT_PG_ITEM_COLLAPSED event, generated when user collapses a property or category.
fr: Répond à l'événement 'wxEVT_PG_ITEM_COLLAPSED', généré lorsque l'utilisateur réduit une propriété ou une catégorie.

source: Respond to wxEVT_PG_ITEM_EXPANDED event, generated when user expands a property or category.
fr: Répond à l'événement 'wxEVT_PG_ITEM_EXPANDED', généré lorsque l'utilisateur étend une propriété ou une catégorie.

source: Respond to wxEVT_PG_LABEL_EDIT_BEGIN event, generated when user is about to begin editing a property label. You can veto this event to prevent the action.
fr: Répond à l'événement 'wxEVT_PG_LABEL_EDIT_BEGIN', généré lorsque l'utilisateur est sur le point de commencer à modifier une étiquette de propriété. Vous pouvez opposer votre veto à cet événement pour empêcher l'action.

source: Respond to wxEVT_PG_LABEL_EDIT_ENDING event, generated when user is about to end editing of a property label. You can veto this event to prevent the action.
fr: Répond à l'événement 'wxEVT_PG_LABEL_EDIT_ENDING', généré lorsque l'utilisateur est sur le point de terminer l'édition d'une étiquette de propriété. Vous pouvez opposer votre veto à cet événement pour empêcher l'action.

source: Respond to wxEVT_PG_COL_BEGIN_DRAG event, generated when user starts resizing a column - can be vetoed.
fr: Répond à l'événement 'wxEVT_PG_COL_BEGIN_DRAG', généré lorsque l'utilisateur commence à redimensionner une colonne - peut faire l'objet d'un veto.

source: Respond to wxEVT_PG_COL_DRAGGING, event, generated when a column resize by user is in progress. This event is also generated when user double-clicks the splitter in order to recenter it.
fr: Répond à l'événement 'wxEVT_PG_COL_DRAGGING', généré lorsqu'un redimensionnement de colonne par l'utilisateur est en cours. Cet événement est également généré lorsque l'utilisateur double-clique sur le séparateur pour le recentrer.

source: Respond to wxEVT_PG_COL_END_DRAG event, generated after column resize by user has finished.
fr: Répond à l'événement 'wxEVT_PG_COL_END_DRAG', généré après la fin du redimensionnement de la colonne par l'utilisateur.

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, when the custom editor button is clicked.
fr: Traite un événement 'wxEVT_COMMAND_BUTTON_CLICKED', lorsque le bouton de l'éditeur personnalisé est cliqué.

source: Sets x coordinate of the splitter
fr: Définit la coordonnée x du séparateur

source: Moves splitter as left as possible, while still allowing all labels to be shown in full
fr: Déplace le séparateur le plus à gauche possible, tout en permettant à toutes les étiquettes d'être affichées dans leur intégralité

source: The property name
fr: Le nom de la propriété

source: The property label
fr: Le libellé de la propriété

source: The property help string
fr: La chaîne d'aide de la propriété

source: Property background colour
fr: Couleur d'arrière-plan de la propriété

source: Set custom editor control to a property
fr: Définir un contrôle d'éditeur personnalisé pour une propriété

source: The property kind
fr: Le type de la propriété

source: Initial string value
fr: Valeur initiale de la chaîne

source: For properties that accepts array of strings (wxEnumProperty, wxEditEnumProperty and wxFlagsProperty) set the strings display name
fr: Pour les propriétés qui acceptent un tableau de chaînes de caractères ('wxEnumProperty', 'wxEditEnumProperty' et 'wxFlagsProperty'), définir le nom d'affichage des chaînes de caractères

source: For properties that accepts array of strings (wxEnumProperty, wxEditEnumProperty and wxFlagsProperty) set the strings values (optional for wxEnumProperty and wxEditEnumProperty)
fr: Pour les propriétés qui acceptent un tableau de chaînes de caractères ('wxEnumProperty', 'wxEditEnumProperty' et 'wxFlagsProperty'), définir les valeurs des chaînes de caractères (facultatif pour 'wxEnumProperty' et 'wxEditEnumProperty').

source: Initial value, relevant to wxBoolProperty
fr: Valeur initiale, pertinente pour 'wxBoolProperty'

source: wxFileProperty's wildcard
fr: - Caractère de remplacement de 'wxFileProperty'

source: Initial Colour
fr: Couleur initiale

source: My RadioBox
fr: Ma 'RadioBox'

source: An array of choices with which to initialize the radiobox
fr: Un tableau de choix avec lesquels initialiser la 'radiobox'

source: The zero-based position of the selected button
fr: Position en base zéro du bouton sélectionné

source: Specifies the maximum number of rows (if style contains wxRA_SPECIFY_ROWS) or columns (if style contains wxRA_SPECIFY_COLS) for a two-dimensional radiobox
fr: Spécifie le nombre maximum de lignes (si le style contient 'wxRA_SPECIFY_ROWS') ou de colonnes (si le style contient 'wxRA_SPECIFY_COLS') pour une 'radiobox' bidimensionnelle

source: Process a wxEVT_COMMAND_RADIOBOX_SELECTED event, when a radiobutton is clicked.
fr: Traite un événement 'wxEVT_COMMAND_RADIOBOX_SELECTED', lorsqu'un bouton radio est cliqué.

source: My RadioButton
fr: Ma 'RadioButton'

source: Initial value
fr: Valeur initiale

source: Process a wxEVT_COMMAND_RADIOBUTTON_SELECTED event, when the radiobutton is clicked.
fr: Traite un événement 'wxEVT_COMMAND_RADIOBUTTON_SELECTED', lorsque le bouton radio est cliqué.

source: Triggered after the transition from one page being active to a different page being active.
fr: Déclenché après le passage d'une page active à une autre page active.

source: Triggered prior to the transition from one page being active to a different page being active, and can veto the change.
fr: Déclenché avant le passage d'une page active à une autre page active, et peut opposer son veto au changement.

source: Triggered when the middle mouse button is pressed on a tab.
fr: Déclenché lorsque le bouton du milieu de la souris est enfoncé sur un onglet.

source: Triggered when the middle mouse button is released on a tab.
fr: Déclenché lorsque le bouton du milieu de la souris est relâché sur un onglet.

source: Triggered when the right mouse button is pressed on a tab.
fr: Déclenché lorsque le bouton droit de la souris est enfoncé sur un onglet.

source: Triggered when the right mouse button is released on a tab.
fr: Déclenché lorsque le bouton droit de la souris est relâché sur un onglet.

source: Triggered when the left mouse button is double clicked on a tab.
fr: Déclenché lorsque le bouton gauche de la souris est doublement cliqué sur un onglet.

source: Select the ribbon bar theme
fr: Sélectionner le thème de la barre de ruban

source: Button
fr: Bouton

source: Help string
fr: Chaîne d'aide

source: The button type
fr: Le type de bouton

source: Triggered when the normal (non-dropdown) region of a button on the button bar is clicked.
fr: Déclenché lorsque l'on clique sur la région normale (non déroulante) d'un bouton de la barre de boutons.

source: Triggered when the dropdown region of a button on the button bar is clicked. wxRibbonButtonBarEvent::PopupMenu() should be called by the event handler if it wants to display a popup menu (which is what most dropdown buttons should be doing).
fr: Déclenché lorsque la région déroulante d'un bouton de la barre de boutons est cliqué. 'wxRibbonButtonBarEvent::PopupMenu()' doit être appelé par le gestionnaire de l'événement s'il souhaite afficher un menu déroulant (ce qui est le cas de la plupart des boutons déroulants).

source: Triggered when the normal (non-dropdown) region of a tool on the toolbar is clicked.
fr: Déclenché lorsque l'on clique sur la région normale (non déroulante) d'un outil de la barre d'outils.

source: Triggered when the dropdown region of a tool on the toolbar is clicked. wxRibbonToolBarEvent::PopupMenu() should be called by the event handler if it wants to display a popup menu (which is what most dropdown buttons should be doing).
fr: Déclenché lorsque la région déroulante d'un outil de la barre d'outils est cliqué. 'wxRibbonToolBarEvent::PopupMenu()' doit être appelé par le gestionnaire de l'événement s'il souhaite afficher un menu déroulant (ce qui est le cas de la plupart des boutons déroulants).

source: Triggered when the user selects an item from the gallery. Note that the ID is that of the gallery, not of the item.
fr: Déclenché lorsque l'utilisateur sélectionne un élément de la galerie. Notez que l'identificateur est celui de la galerie et non de l'élément.

source: Similar to EVT_RIBBONGALLERY_SELECTED but triggered every time a gallery item is clicked, even if it is already selected. Note that the ID of the event is that of the gallery, not of the item, just as above. This event is available since wxWidgets 2.9.2.
fr: Similaire à 'EVT_RIBBONGALLERY_SELECTED' mais déclenché à chaque fois qu'un élément de la galerie est cliqué, même s'il est déjà sélectionné. Notez que l'ID de l'événement est celui de la galerie, et non de l'élément, comme ci-dessus. Cet événement est disponible depuis 'wxWidgets 2.9.2'.

source: Triggered when the item being hovered over by the user changes. The item in the event will be the new item being hovered, or NULL if there is no longer an item being hovered. Note that the ID is that of the gallery, not of the item.
fr: Déclenché lorsque l'élément survolé par l'utilisateur change. L'élément dans l'événement sera le nouvel élément survolé, ou 'NULL' s'il n'y a plus d'élément survolé. Notez que l'ID est celui de la galerie et non de l'élément.

source: Triggered when the "extension" button of the gallery is pressed
fr: Déclenché lorsque le bouton « extension » de la galerie est pressé

source: Page Icon
fr: Icône de page

source: Page Label
fr: Étiquette de la page

source: Selected
fr: Sélectionné

source: The Label
fr: L'étiquette

source: Icon to be used in place of the panel's children when the panel is minimised
fr: Icône à utiliser à la place des enfants du panneau lorsque celui-ci est réduit

source: Triggered when the user activate the panel extension button
fr: Déclenché lorsque l'utilisateur active le bouton d'extension du panneau

source: Set the minimum number of rows to distribute tool groups over
fr: Définir le nombre minimum de lignes sur lesquelles répartir les groupes d'outils

source: Set the maximum number of rows to distribute tool groups over. Use -1 as default value
fr: Définir le nombre maximum de lignes sur lesquelles répartir les groupes d'outils. La valeur par défaut est -1

source: wxRibbonToolBar Separator
fr: - Séparateur 'wxRibbonToolBar'

source: Process a wxEVT_COMMAND_RICHTEXT_CHARACTER event, generated when the user presses a character key. Valid event functions: GetFlags, GetPosition, GetCharacter.
fr: Traite un événement 'wxEVT_COMMAND_RICHTEXT_CHARACTER', généré lorsque l'utilisateur appuie sur une touche de caractère. Fonctions d'événement valides : 'GetFlags, GetPosition, GetCharacter'.

source: Process a wxEVT_COMMAND_RICHTEXT_DELETE event, generated when the user presses the backspace or delete key. Valid event functions: GetFlags, GetPosition
fr: Traite un événement 'wxEVT_COMMAND_RICHTEXT_DELETE', généré lorsque l'utilisateur appuie sur la touche d'effacement ou de suppression. Fonctions d'événement valides : 'GetFlags, GetPosition'

source: Process a wxEVT_COMMAND_RICHTEXT_RETURN event, generated when the user presses the return key. Valid event functions: GetFlags, GetPosition.
fr: Traite un événement 'wxEVT_COMMAND_RICHTEXT_RETURN', généré lorsque l'utilisateur appuie sur la touche retour. Fonctions d'événement valides : 'GetFlags, GetPosition'.

source: Process a wxEVT_COMMAND_RICHTEXT_STYLE_CHANGED event, generated when styling has been applied to the control. Valid event functions: GetPosition, GetRange.
fr: Traite un événement 'wxEVT_COMMAND_RICHTEXT_STYLE_CHANGED', généré lorsque le style a été appliqué au contrôle. Fonctions d'événement valides : 'GetPosition, GetRange'.

source: Process a wxEVT_COMMAND_RICHTEXT_STYLESHEET_CHANGING event, generated when the control's stylesheet has changed, for example the user added, edited or deleted a style. Valid event functions: GetRange, GetPosition.
fr: Traite un événement 'wxEVT_COMMAND_RICHTEXT_STYLESHEET_CHANGING', généré lorsque la feuille de style du contrôle a changé, par exemple, l'utilisateur a ajouté, modifié ou supprimé un style. Fonctions d'événement valides : 'GetRange, GetPosition'.

source: Process a wxEVT_COMMAND_RICHTEXT_STYLESHEET_REPLACING event, generated when the control's stylesheet is about to be replaced for example when a file is loaded into the control. Valid event functions: Veto, GetOldStyleSheet, GetNewStyleSheet.
fr: Traite les événements de défilement de 'wxEVT_SCROLL_BOTTOM' vers le bas (position maximale).

source: Process a wxEVT_COMMAND_RICHTEXT_STYLESHEET_REPLACED event, generated when the control's stylesheet has been replaced for example when a file is loaded into the control Valid event functions: GetOldStyleSheet, GetNewStyleSheet.
fr: Traite un événement 'wxEVT_COMMAND_RICHTEXT_STYLESHEET_REPLACED', généré lorsque la feuille de style du contrôle a été remplacée, par exemple lors du chargement d'un fichier dans le contrôle. par exemple lorsqu'un fichier est chargé dans le contrôle Fonctions d'événement valides : 'GetOldStyleSheet, GetNewStyleSheet'.

source: Process a wxEVT_COMMAND_RICHTEXT_CONTENT_INSERTED event generated when content has been inserted into the control. Valid event functions: GetPosition, GetRange.
fr: Traite un événement 'wxEVT_COMMAND_RICHTEXT_CONTENT_INSERTED' généré lorsqu'un contenu a été inséré dans le contrôle. Fonctions d'événement valides : 'GetPosition, GetRange'.

source: Process a wxEVT_COMMAND_RICHTEXT_CONTENT_DELETED event, generated when content has been deleted from the control Valid event functions: GetPosition, GetRange.
fr: Traite un événement 'wxEVT_COMMAND_RICHTEXT_CONTENT_DELETED', généré lorsque le contenu a été supprimé du contrôle. Fonctions d'événement valides : 'GetPosition, GetRange'.

source: Process a wxEVT_COMMAND_RICHTEXT_BUFFER_RESET event, generated when the buffer has been reset by deleting all content. You can use this to set a default style for the first new paragraph.
fr: Traite un événement 'wxEVT_COMMAND_RICHTEXT_BUFFER_RESET', généré lorsque le tampon a été réinitialisé en supprimant tout le contenu. Vous pouvez l'utiliser pour définir un style par défaut pour le premier nouveau paragraphe.
