Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: CodeLite built-in terminal emulator
fr: Émulateur de terminal intégré à 'CodeLite'

source: Clear screen Ctrl-L
fr: Effacer l'écran Ctrl-L

source: Preferences...
fr: Préférences...

source: Text Colour:
fr: Couleur du texte :

source: Font:
fr: Police de caractères :

source: Enable vim mode
fr: Activer le mode 'vim'

source: Vim Settings
fr: Paramètres de 'Vim'

source: vim bindings for CodeLite
fr: liens 'vim' pour 'CodeLite'

source: Searching:
fr: Recherche :

source: Unbalanced Parentesis
fr: Parenthèse déséquilibrée

source: Saving
fr: Sauvegarde

source: Closing
fr: Fermeture

source: Saving and Closing
fr: Sauvegarde et fermeture

source: Unknown Error
fr: Erreur inconnue

source: Updating workspace...
fr: Actualisation de l'espace de travail...

source: ' to: '
fr: ' à : '

source: Failed to rename workspace file: '
fr: Échec du renommage du fichier de l'espace de travail : '

source: Workspace file modified externally. Would you like to reload the workspace?
fr: Fichier de l'espace de travail modifié en externe. Souhaitez-vous recharger l'espace de travail ?

source: A project with similar name already exists in the workspace
fr: Un projet portant un nom similaire existe déjà dans l'espace de travail

source: Path '
fr: Chemin '

source: Unable to create a project at the selected path
fr: Impossible de créer un projet au chemin sélectionné

source: ' is already part of project '
fr: ' fait déjà partie du projet '

source: Project '
fr: Projet '

source: ' is located under this path
fr: ' se trouve sous ce chemin

source: Another process is already running
fr: Un autre processus est déjà en cours

source: Please set an index file to execute in the project settings
fr: Veuillez définir un fichier d'index à exécuter dans les paramètres du projet

source: Could not find any PHP binary to execute. Please set one in from: 'PHP | Settings'
fr: Impossible de trouver un binaire 'PHP' à exécuter. Veuillez en définir un à partir de : 'PHP | Paramètres'

source: Place each parent in a separate line
fr: Placez chaque parent sur une ligne séparée

source: Edit Class Extends
fr: Modifier la classe d'extension

source: Edit Class Interfaces
fr: Modifier les interfaces des classes

source: Delete the selected breakpoints
fr: Supprimer les points d'arrêt sélectionnés

source: Delete all breakpoints
fr: Supprimer tous les points d'arrêt

source: Failed to locate SSH account:
fr: Échec de la localisation du compte 'SSH' :

source: This project has no file mapping defined. This may result in breakpoints not applied
fr: Ce projet n'a pas de correspondance de fichiers définie. Cela peut entraîner la non-application des points d'arrêt

source: To fix this, set file mapping from Project Settings -> Debug
fr: Pour remédier à ce problème, définissez le mappage des fichiers à partir de Paramètres projet -> Debogue

source: Remember my answer and don't show this message again
fr: Souvenez-vous de ma réponse et n'affichez plus ce message

source: OK, Continue to Debug
fr: OK, continuer à déboguer

source: Stop the debugger
fr: Arrêter le débogueur

source: Could not open file:
fr: Impossible d'ouvrir le fichier :

source: XDebug did not connect in a timely manner
fr: 'XDebug' ne s'est pas connecté en temps voulu

source: Run XDebug Test
fr: Lancer le test 'XDebug'

source: Error evaluating expression
fr: Erreur d'évaluation de l'expression

source: Failed to map remote file:
fr: Échec de la conversion du fichier distant :

source: Check your project settings->Debug to define folder mapping
fr: Vérifiez les paramètres de votre 'Projet->Deboguer' pour définir le mappage des dossiers

source: *** Error evaluating expression:
fr: *** Erreur d'évaluation de l'expression :

source: Copy Value
fr: Copier la valeur

source: Choose the object type
fr: Choisir le type d'objet

source: The name
fr: Le nom

source: If set, the generated code will be placed inside this namespace
fr: Si l'option est activée, le code généré sera placé dans cet espace de noms

source: Extends:
fr: Extension :

source: A comma separated list of parents for this class
fr: Une liste de parents séparés par des virgules pour cette classe

source: Edit in a small text editor...
fr: Éditer avec un petit éditeur de texte...

source: Implements:
fr: Implémentation :

source: A comma separated list of interfaces for this class
fr: Une liste d'interfaces séparées par des virgules pour cette classe

source: Generate consturctor
fr: Générer un constructeur

source: Generate desctructor
fr: Générer un destructeur

source: Create folder per namespace
fr: Créer un dossier par espace de noms

source: Make singleton (available for classes only)
fr: Faire un singleton (disponible pour les classes uniquement)

source: The generated class will be generated as a singleton class
fr: La classe générée sera générée en tant que classe unique classe

source: Enable PHP support for codelite IDE
fr: Activer le support PHP pour l'IDE' Codelite'

source: PHP Plugin for the codelite IDE
fr: Extension 'PHP' pour l'IDE 'Codelite'

source: Could not create workspace folder: %s
fr: Impossible de créer le dossier de l'espace de travail : %s

source: Failed to open workspace: corrupted workspace file
fr: Échec de l'ouverture de l'espace de travail : fichier de l'espace de travail corrompu

source: PHP Settings...
fr: Paramètres 'PHP'...

source: Run XDebug Setup Wizard...
fr: Lancer l'assistant d'installation de 'XDebug'...

source: Can't create PHP project. Close your current workspace first
fr: Impossible de créer un projet 'PHP'. Fermez d'abord votre espace de travail actuel

source: Goto definition
fr: Définition de Goto

source: Insert Doxygen Comment
fr: Insérer un commentaire Doxygen

source: Generate Setters / Getters
fr: Générer les méthodes d'écriture / lecture

source: Code Generation
fr: Génération de code

source: Open '%s'
fr: Ouvrir '%s'

source: Select folder
fr: Sélectionner un dossier

source: The workspace path. This path must exist
fr: Le chemin d'accès à l'espace de travail. Ce chemin doit exister

source: Set here the workspace name
fr: Définir ici le nom de l'espace de travail

source: Type the resource name (file, variable, class, function, constant or define):
fr: Tapez le nom de la ressource (fichier, variable, classe, fonction, constante ou définition) :

source: PHP Executable:
fr: Exécutable 'PHP' :

source: Select the PHP executable to use when debugging / running command line scripts
fr: Sélectionnez l'exécutable PHP à utiliser lors du débogage ou de l'exécution de scripts en ligne de commande

source: Set the PHP error reporting level (affects command line only)
fr: Définir le niveau de rapport d'erreur de 'PHP' (concerne uniquement la ligne de commande)

source: Add include path:
fr: Ajouter un chemin d'accès d'inclusion :

source: Add include path for PHP
fr: Ajouter un chemin d'accès d'inclusion pour 'PHP'

source: Add include path for code completion:
fr: Ajout d'un chemin d'accès pour l'achèvement du code :

source: Paths added here will only be used for code completion and NOT during runtime. If you want to add search paths for runtime (CLI mode only), Use the 'PHP CLI' tab
fr: Les chemins ajoutés ici ne seront utilisés que pour l'achèvement du code et PAS pendant l'exécution. Si vous souhaitez ajouter des chemins de recherche pour l'exécution (mode 'CLI' uniquement), utilisez l'onglet 'PHP CLI'

source: Listen host:
fr: Écouter l'hôte :

source: Wait for connection from XDebug on this host
fr: Attendre la connexion de 'XDebug' sur cet hôte

source: The port on which codelite is accepting debug sessions from XDebug This value must be the same as the value set in the 'xdebug.remote_port' directive
fr: Le port sur lequel 'Codelite' accepte les sessions de débogage de 'XDebug'. Cette valeur doit être la même que celle définie dans la directive 'xdebug.remote_port' de la directive

source: IDE Key:
fr: Clé 'IDE :

source: This field defines the session name between CodeLite and XDebug
fr: Ce champ définit le nom de la session entre 'CodeLite' et 'XDebug'

source: The XDebug session name
fr: Le nom de la session 'XDebug'

source: Select the project execution mode:
fr: Sélectionnez le mode d'exécution du projet :

source: Run project as command line
fr: Exécuter le projet en ligne de commande

source: PHP executable:
fr: Exécutable 'PHP' :

source: Select the PHP interperter to use for running this project
fr: Sélectionnez l'interpréteur 'PHP' à utiliser pour exécuter ce projet

source: Select PHP INI file:
fr: Sélectionnez le fichier 'PHP INI' :

source: Select the PHP INI file to use with PHP (leave empty for default)
fr: Sélectionnez le fichier 'PHP INI' à utiliser avec 'PHP' (laissez vide pour la valeur par défaut).

source: Index File:
fr: Fichier d'index :

source: Select the project index file
fr: Sélectionner le fichier d'index du projet

source: Program arguments
fr: Arguments du programme

source: Insert the program arguments here Place each argument on a separate line
fr: Insérer ici les arguments du programme Placer chaque argument sur une ligne séparée

source: Run project as web site
fr: Exécuter le projet en tant que site internet

source: Project URL:
fr: Adresse internet du projet :

source: Use system default browser
fr: Utiliser le navigateur par défaut du système

source: Include path
fr: Chemin des inclus

source: When running project with PHP CLI tool, pass the following include paths
fr: Lors de l'exécution du projet avec l'outil 'PHP CLI', passez les éléments suivants chemins d'inclusion

source: Project file types
fr: Types de fichiers de projet

source: Set the file extensions to include in this project CodeLite will only display these file types in the project view
fr: Définir les extensions de fichiers à inclure dans ce projet 'CodeLite' n'affichera que ces types de fichiers dans la vue du projet

source: Exclude folders
fr: Dossiers exclus

source: Set a list of folders to exclude from the project. If the last part of the folder path is equal to one of the entries in this exclude list, it will not be shown in the project view
fr: Définit une liste de dossiers à exclure du projet. Si la dernière partie du chemin du dossier est égale à l'une des entrées de cette liste d'exclusion, le dossier ne sera pas affiché dans la vue du projet. sera pas affiché dans la vue du projet

source: File mapping
fr: Correspondance des fichiers

source: Source folder
fr: Dossier source

source: Target folder
fr: Dossier cible

source: Local folder:
fr: Dossier local :

source: The source folder usually points to the location where you develop your code
fr: Le dossier source pointe généralement vers l'endroit où vous développez votre code

source: Eval
fr: Évaluer

source: Type an expression and hit the 'Send' button This works best when wrapping the command inside a print_r function, e.g. print_r( $mystr, true )
fr: Tapez une expression et appuyez sur le bouton « Envoyer ». Cela fonctionne mieux lorsque la commande est intégrée à une fonction 'print_r,' par exemple 'print_r( $mystr, true )'

source: XDebug Console
fr: Console 'XDEBUG'

source: Run / Debug URL
fr: Adresse internet d'exécution / de débogage

source: Run / Debug with PHP command line
fr: Lancer / déboguer avec la ligne de commande 'PHP'

source: Select the debugging method
fr: Sélectionner la méthode de débogage

source: URL to Run / Debug:
fr: Adresse internet d'exécution / de débogage :

source: Enter the URL to debug
fr: Entrez l'adresse internet à déboguer

source: File to Run / Debug:
fr: Fichier à exécuter / déboguer :

source: Use the active file opened in the editor
fr: Utiliser le fichier actif ouvert dans l'éditeur

source: Project Creation
fr: Création de projet

source: Select the project creation method
fr: Sélectionner la méthode de création du projet

source: Create an empty PHP project
fr: Créer un projet 'PHP' vide

source: Create a project from an existing source files
fr: Créer un projet à partir d'un fichier source existant

source: Project Details
fr: Détails du projet

source: Set the project name and path
fr: Définir le nom et le chemin du projet

source: Set the project name
fr: Définir le nom du projet

source: Select the project path
fr: Sélectionner le chemin du projet

source: Create the project under a separate folder
fr: Créer le projet dans un dossier séparé

source: Preview:
fr: Aperçu :

source: PHP Execution
fr: Exécution 'PHP'

source: Set PHP execution method
fr: Définir la méthode d'exécution de 'PHP'

source: Project type:
fr: Type de projet :

source: Select the project type from the list
fr: Sélectionnez le type de projet dans la liste

source: Select the PHP command line executable to use
fr: Sélectionnez l'exécutable de ligne de commande 'PHP' à utiliser

source: Add include paths for Code Completion
fr: Ajouter des chemins d'accès pour l'achèvement du code

source: Browse for code completion folder...
fr: Rechercher le dossier d'achèvement du code...

source: You can add folders here for better code completion. CodeLite will scan these folder for any PHP files for better code complete There is no need to add the project folders, these are parsed automatically
fr: Vous pouvez ajouter des dossiers ici pour une meilleure complétion du code. 'CodeLite' scrutera ces dossiers à la recherche de fichiers PHP pour une meilleure complétion du code. Il n'est pas nécessaire d'ajouter les dossiers du projet, ils sont analysés automatiquement

source: XDebug Port
fr: Port de 'XDEBUG'

source: Setup XDebug port number CodeLite will listen on this port for new incoming messages from XDebug
fr: Configurer le numéro de port 'XDebug' 'CodeLite' écoutera sur ce port les nouveaux messages entrants en provenance de 'XDebug'

source: Port number:
fr: Numéro de port :

source: Set the port on which CodeLite will be listening for new connections from XDebug. The default port is 9000
fr: Définit le port sur lequel 'CodeLite' écoutera les nouvelles connexions en provenance de 'XDebug'. Le port par défaut est 9000

source: CodeLite IP address
fr: Adresse 'IP' de 'CodeLite'

source: Set the IP address on which CodeLite is running
fr: Définir l'adresse 'IP' sur laquelle 'CodeLite' s'exécute

source: IP address:
fr: Adresse IP :

source: Set the IP address on which CodeLite is listening. This IP needs to be visible to the machine where XDebug is running.
fr: Définissez l'adresse IP sur laquelle 'CodeLite' écoute. Cette adresse IP doit être visible par la machine sur laquelle 'XDebug' s'exécute.

source: IDE Key
fr: Clé 'IDE'

source: Set the IDE key between CodeLite and XDebug
fr: Définir la clé de l'IDE entre 'CodeLite' et 'XDebug'

source: Setup XDebug INI settings
fr: Configuration des paramètres 'INI' de 'XDebug'

source: XDebug INI Settings
fr: Paramètres 'INI' de 'XDebug'

source: Copy the below text and paste it in your php.ini file:
fr: Copiez le texte ci-dessous et collez-le dans votre fichier 'php.ini' :

source: Functions start with lowercase
fr: Les fonctions commencent par une minuscule

source: Generated functions start with lowercase letter
fr: Les fonctions générées commencent par une lettre minuscule

source: Prefix getter with 'get' or 'is'
fr: Préfixe des méthodes de lecture avec « get » ou « is ».

source: When checked, the getter function is prefixed with 'get', otherwise, the getter is same as the variable name (without the $ sign)
fr: Si la case est cochée, la fonction de lecture est préfixée par « get », sinon, la fonction 'getter' est identique au nom de la variable (sans le signe $).

source: Setter returns $this
fr: Les méthode d'écriture renvoie '$this'

source: The setter returns $this object
fr: Les méthodes d'écriture renvoient l'objet '$this'

source: New PHP Workspace
fr: Nouvel espace de travail 'PHP'

source: PHP General Settings
fr: Paramètres généraux de 'PHP'

source: File Mapping
fr: Correspondance des fichiers

source: PHP Run / Debug
fr: Exécution / débogage 'PHP'

source: New PHP Project
fr: Nouveau projet 'PHP'

source: XDebug Setup
fr: Réglages 'SXDEBUG'

source: Open active project settings
fr: Ouvrir les paramètres du projet actif

source: Setup automatic upload
fr: Configurer le téléchargement automatique

source: Sync workspace with file system
fr: Synchronisation de l'espace de travail avec le système de fichiers

source: Sync workspace with file system...
fr: Synchronisation de l'espace de travail avec le système de...

source: Wait for Debugger Connection
fr: Attendre la connexion du débogueur

source: Can only import one folder at a time
fr: Ne peut importer qu'un seul dossier à la fois

source: Failed to create workspace '
fr: Échec de la création de l'espace de travail '

source: Permission denied.
fr: Autorisation refusée.

source: Failed to open workspace '
fr: Échec de l'ouverture de l'espace de travail '

source: File exists
fr: Le fichier existe

source: The folder already contains a workspace file Please close the current workspace before continuing
fr: Le dossier contient déjà un fichier d'espace de travail Veuillez fermer l'espace de travail actuel avant de continuer

source: Open with Default Application
fr: Ouvrir avec l'application par défaut

source: Create a new project...
fr: Créer un nouveau projet...

source: Add an existing project...
fr: Ajouter un projet existant...

source: Parse workspace
fr: Analyser l'espace de travail

source: Find In Folder...
fr: Rechercher dans le dossier...

source: Set as active project
fr: Définir comme projet actif

source: Remove project
fr: Supprimer le projet

source: New Class...
fr: Nouvelle classe...

source: New Folder...
fr: Nouveau dossier...

source: New File...
fr: Nouveau fichier...

source: Sync project with file system...
fr: Synchroniser le projet avec le système de fichiers...

source: Run project...
fr: Lancer un projet...

source: Project settings...
fr: Paramètres du projet...

source: Sync folder with file system...
fr: Synchronisation des dossiers avec le système de...

source: Building workspace tree view
fr: Arborescence de l'espace de travail

source: Are you sure you want to remove project '
fr: Êtes-vous sûr de vouloir supprimer le projet '

source: New Folder Name:
fr: Nouveau nom de dossier :

source: ' and its content?
fr: et son contenu ?

source: Are you sure you want to delete folder '
fr: Êtes-vous sûr de vouloir supprimer le dossier '

source: Rename file
fr: Renommer le fichier

source: This operation will delete the selected items. Continue?
fr: Cette opération supprime les éléments sélectionnés. Poursuivre ?

source: '%s' is a folder. This operation will delete the folder and its content. Continue?
fr: '%s' est un dossier. Cette opération supprimera le dossier et son contenu. Poursuivre ?

source: No active project is set !? Please set an active project and try again
fr: Aucun projet actif n'est défini ! Veuillez définir un projet actif et réessayer

source: New workspace name:
fr: Nouveau nom de l'espace de travail :

source: Rename workspace
fr: Renommer l'espace de travail

source: Enable automatic upload
fr: Activer le téléchargement automatique

source: Select the remote folder corrseponding to the current workspace file
fr: Sélectionner le dossier distant correspondant au fichier de l'espace de travail actuel

source: Folder name:
fr: Nom de dossier :

source: Scanning for PHP files...
fr: Recherche de fichiers 'PHP.'..

source: Scanning for PHP files completed
fr: L'analyse des fichiers 'PHP' est terminée

source: A file with this name already exists in the target folder Overwrite it?
fr: Un fichier portant ce nom existe déjà dans le dossier cible L'écraser ?

source: Do this for all files
fr: Faire cela pour tous les fichiers

source: CppChecker integration for CodeLite IDE
fr: Intégration de 'CppChecker' dans l'IDE 'CodeLite'

source: CppCheck integration for CodeLite IDE
fr: Intégration de 'CppCheck' dans l'IDE 'CodeLite'

source: Check current file
fr: Vérifier le fichier actuel

source: Check current file's project
fr: Vérifier le projet du fichier courant

source: Check workspace
fr: Vérifier l'espace de travail

source: Run CppCheck
fr: Lancer 'CppCheck'

source: CppCheckPlugin: CppCheck is currently busy please wait for it to complete the current check
fr: 'CppCheckPlugin : CppCheck' est actuellement occupé, veuillez attendre qu'il termine la vérification en cours

source: Starting cppcheck: %s
fr: Démarrage de 'cppcheck' : %s

source: Failed to launch codelite_cppcheck process!
fr: Échec du lancement du processus 'codelite_cppcheck' !

source: No files to check
fr: Aucun fichier à vérifier

source: Failed to open temporary file
fr: Échec à l'ouverture du fichier temporaire

source: Clear the CppCheck report view
fr: Effacer la vue du rapport 'CppCheck'

source: Stop the current analysis
fr: Arrêter l'analyse en cours

source: Move to previous error
fr: Passer à l'erreur précédente

source: Move to next error
fr: Passer à l'erreur suivante

source: possible errors
fr: erreurs possibles

source: cppcheck analysis ended. Found
fr: - L'analyse de 'cppcheck' est terminée. Trouvé

source: C/C++ Files
fr: Fichiers 'C/C++'

source: All Files
fr: Tous Fichiers

source: Add File(s):
fr: Ajouter fichier(s) :

source: There is already an entry with ID string. Try again?
fr: Il existe déjà une entrée avec l'ID chaîne de caractères. Essayez à nouveau ?

source: Really remove this warning suppression, rather than just unticking it?
fr: La suppression de l'avertissement doit-elle vraiment être supprimée, au lieu d'être simplement décochée ?

source: Select the path containing include files
fr: Sélectionner le chemin contenant les fichiers d'inclusion

source: Enter a definition e.g. 'FOO' or 'BAR=1' (not '-DFoo')
fr: Entrez une définition, par exemple « FOO » ou « BAR=1 » (pas « -DFoo »).

source: Enter a definition NOT to check e.g. 'FOO' or 'BAR=1' (not '-UFoo')
fr: Saisir une définition à NE PAS vérifier, par exemple « FOO » ou « BAR=1 » (et non « -UFoo »).

source: Missing includes
fr: Inclus manquants

source: Checks
fr: Vérifications

source: Run the following extra checks:
fr: Lancez les contrôles supplémentaires suivants :

source: Coding style
fr: Style de codage

source: Portability
fr: Portabilité

source: Unused functions
fr: Fonctions non utilisées

source: Output informative messages
fr: Édition de messages informatifs

source: Posix standards
fr: Normes Posix

source: C99 standards
fr: Normes 'C99'

source: C++11 standards
fr: Normes 'C++11'

source: Tick All
fr: Tout cocher

source: Tick all the boxes
fr: Cochez toutes les cases

source: Untick All
fr: Tout décocher

source: Untick all the boxes
fr: Décocher toutes les cases

source: Force checking unlimited numbers of configurations
fr: Vérification forcée d'un nombre illimité de configurations

source: By default the maximum number of configurations checked per file is 12. If that might not be enough, tick this box.
fr: Par défaut, le nombre maximum de configurations vérifiées par fichier est de 12. Si cela ne suffit pas, cochez cette case.

source: Multiple jobs (-j)
fr: Travaux multiples (-j)

source: Tell Cppcheck to use 'n' CPUs. NB this is incompatible with 'unusedFunction', and may give false-positive warnings for e.g. 'Unmatched suppression' .
fr: Indique à 'Cppcheck' d'utiliser 'n' 'CPUs'. NB : ceci est incompatible avec 'unusedFunction', et peut donner des avertissements faussement positifs pour, par exemple, 'Unmatched suppression'.

source: Number of jobs to try to run in parallel
fr: Nombre de travaux à lancer en parallèle

source: Check configuration (turns off other checks)
fr: Configuration des contrôles (désactive les autres contrôles)
