Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: The functions will be placed into this file
fr: Les fonctions seront placées dans ce fichier

source: Recently opened workspaces
fr: Espaces de travail récemment ouverts

source: C++ Workspace
fr: Espace de travail 'C++'

source: Save Ctrl-S
fr: Sauvegarder Ctrl-S

source: Reload File Ctrl-R
fr: Recharger le fichier Ctrl-R

source: Close Ctrl-W
fr: Fermer Ctrl-W

source: Find Ctrl-F
fr: Trouver 'Ctrl-F'

source: Goto Folder:
fr: Aller au dossier :

source: Type the folder path
fr: Tapez le chemin du dossier

source: DRAG AND DROP A FOLDER HERE
fr: DÉPLACER ET DÉPOSER UN DOSSIER ICI

source: Choose the view to use for this folder from the list below
fr: Choisissez la vue à utiliser pour ce dossier dans la liste ci-dessous

source: Select View
fr: Choisir la vue

source: Add function implementation
fr: Ajouter la mise en œuvre de la fonction

source: EditorFrame
fr: Cadre de l'éditeur

source: Open Folder
fr: Ouvrir un dossier

source: Failed to load image
fr: Échec de chargement de l'image

source: Choose the icon file
fr: Choisir le fichier d'icônes

source: Mac Bundler Configuration
fr: Configuration du 'Mac Bundler'

source: Choose which target(s) to "bundle-ize"
fr: Choisir la ou les cible(s) à « regrouper »

source: Generate Info.plist file
fr: Générer le fichier 'Info.plist'

source: Copy the following icon into the project
fr: Copiez l'icône suivante dans le projet

source: Warning : applying these changes cannot be undone automatically
fr: Attention : l'application de ces changements ne peut pas être annulée automatiquement

source: Apply changes
fr: Appliquer les changements

source: Get Info Version String
fr: Prendre la chaîne de la version

source: Version Number
fr: Numéro de version

source: Icon File
fr: Fichier d'icône

source: Bundle Identifier
fr: Identifiant de l'ensemble

source: 4-Character Signature
fr: Signature à 4 caractères

source: Cannot access or create file!
fr: Impossible d'accéder au fichier ou de le créer !

source: Failed to write Info.plist file!
fr: Échec de l'écriture du fichier 'Info.plist' !

source: MacBundler : manage OS X app bundles
fr: 'MacBundler' : gérer les packs d'applications 'OS X'

source: Manage OS X app bundles
fr: Gérer les paquets d'applications 'OS X'

source: No project is active, cannot continue.
fr: Aucun projet n'est actif, impossible de continuer.

source: Cannot retrieve active project, cannot continue.
fr: Impossible de récupérer le projet actif, impossible de continuer.

source: This menu item can only be invoked when right-clicking a project.
fr: Cet élément de menu ne peut être invoqué qu'en cliquant avec le bouton droit de la souris sur un projet.

source: Cannot continue, impossible to access project settings.
fr: Impossible de continuer, impossible d'accéder aux paramètres du projet.

source: The following file: %s already exists, overwrite it?
fr: Le fichier suivant : %s existe déjà, l'écraser ?

source: Could not create Info.plist file
fr: Impossible de créer le fichier 'Info.plist'

source: Sorry, could not copy icon
fr: Désolé, je n'ai pas pu copier l'icône

source: Sorry, could not convert selected icon to icns format
fr: Désolé, il n'a pas été possible de convertir l'icône sélectionnée au format 'icns'

source: Make active project output a bundle
fr: Faire de la sortie d'un projet actif un paquet

source: Make this project output a bundle
fr: Faire de ce projet un paquet

source: MemCheck plugin detects memory leaks. Uses Valgrind (memcheck tool) as backend.
fr: L'extension 'MemCheck' détecte les fuites de mémoire. Utilise 'Valgrind' (outil de vérification de la mémoire) comme 'backend'.

source: Detects memory management problems. Uses Valgrind - memcheck skin.
fr: Détecte les problèmes de gestion de la mémoire. Utilise le masque 'Valgrind - memcheck'.

source: &Run MemCheck
fr: &Lancer 'MemCheck'

source: &Load MemCheck log from file...
fr: & Charger le journal 'MemCheck' du fichier...

source: &Settings...
fr: &Paramètres...

source: Another instance is already running. Please stop it before executing another one
fr: Une autre instance est déjà en cours d'exécution. Veuillez l'arrêter avant d'en exécuter une autre

source: Launching MemCheck...
fr: Lancement de 'MemCheck'...

source: MemCheck command:
fr: Commande 'MemCheck' :

source: Open log file
fr: Ouvrir le fichier journal

source: Output log file cannot be properly loaded.
fr: Le fichier journal de sortie ne peut pas être correctement chargé.

source: Processing error.
fr: Erreur de traitement.

source: -- MemCheck process completed
fr: -- Le processus 'MemCheck' est terminé

source: Please wait, working...
fr: Veuillez patienter, nous travaillons...

source: Label
fr: Texte

source: Search string
fr: Chaîne à rechercher

source: Search 'nonworkspace'
fr: Recherche 'nonworkspace'

source: Current
fr: Actuel

source: Suppress
fr: Supprimer

source: Jump to location
fr: Sauter à l'emplacement

source: Mark all
fr: Marquer tout

source: Unmark all
fr: Tout démarquer

source: Suppress this error
fr: Supprimer cette erreur

source: Suppress all marked errors
fr: Supprimer toutes les erreurs marquées

source: Copy line as string to clipboard
fr: Copier la ligne en tant que chaîne dans le presse-papiers

source: Copy error as string to clipboard
fr: Copier l'erreur sous forme de chaîne dans le presse-papiers

source: Copy marked errors to clipboard
fr: Copier les erreurs marquées dans le presse-papiers

source: Total: %lu Filtered: %lu Selected: %d
fr: Total : %lu Filtré : %lu Sélectionné : %d

source: Add suppression file(s)
fr: Ajouter le(s) fichier(s) de suppression

source: Add suppression file(s)...
fr: Ajouter le(s) fichier(s) de suppression...

source: Remove suppression file(s)
fr: Supprimer le(s) fichier(s) de suppression

source: Run check
fr: Vérification de l'exécution

source: Load MemCheck log from file.
fr: Chargement du journal 'MemCheck' à partir d'un fichier.

source: Stop Process
fr: Arrêt du processus

source: Expand all
fr: Tout développer

source: Jump to next error
fr: Passer à l'erreur suivante

source: Jump to previous error
fr: Sauter à l'erreur précédente

source: Clear output
fr: Effacer la sortie

source: Open plain output in editor window.
fr: Ouvrir la sortie en clair dans la fenêtre de l'éditeur.

source: Errors
fr: Erreurs

source: First result page.
fr: Première page de résultats.

source: of
fr: de

source: Choose suppression file to use.
fr: Choisissez le fichier de suppression à utiliser.

source: Clear filter
fr: Nettoyer les filtres

source: Invert
fr: Inverser

source: Total: 0 Filtered: 0 Selected: 0
fr: Total : 0 Filtré : 0 Sélectionné : 0

source: Suppress all
fr: Supprimer tous les

source: Suppress selected
fr: Supprimer la sélection

source: Engine:
fr: Moteur :

source: At this time (1Q 2014) only valgrind supported - development state.
fr: A ce jour (1er trimestre 2014), seul 'valgrind' est supporté - état de développement.

source: Errors on page:
fr: Erreurs sur la page :

source: Show locations only from my workspace.
fr: Afficher uniquement les emplacements de mon espace de travail.

source: Remove duplicate records.
fr: Supprimez les doublons.

source: Remove suppressed errors.
fr: Supprimer les erreurs supprimées.

source: Remove errors only if suppression rule was added without any change.
fr: Supprimer les erreurs uniquement si la règle de suppression a été ajoutée sans aucune modification.

source: Command Line
fr: Ligne de commande

source: Valgrind executable:
fr: Exécutable 'Valgrind' :

source: Select valgrind executable
fr: Choisir l'exécutable 'valgrind'

source: Command line options
fr: Options de la ligne de commande

source: Mandatory:
fr: Obligatoire :

source: Please do not use these options again and do not change their values! Plugin won't work.
fr: Veuillez ne plus utiliser ces options et ne pas modifier leurs valeurs ! L'extension ne fonctionnera pas.

source: Reload defaults
fr: Recharge des valeurs par défaut

source: Temporary output file
fr: Fichier de sortie temporaire

source: Use log file in workspace private folder.
fr: Utiliser le fichier journal dans le dossier privé de l'espace de travail.

source: It is used internally by this plugin. Valgrind outputs to this file and afterwards the plugin processes this file and shows result.
fr: Il est utilisé en interne par ce plugin. 'Valgrind' produit des sorties dans ce fichier et ensuite le plugin traite ce fichier et affiche le résultat.

source: Suppression files
fr: Suppression des fichiers

source: Use workspace specific supp file as default.
fr: Utiliser par défaut le fichier 'supp' spécifique à l'espace de travail.

source: This file is located in workspace private folder. If you don't like this option, you have to add at least one file to list below.
fr: Ce fichier est situé dans le dossier privé de l'espace de travail. Si vous n'aimez pas cette option, vous devez ajouter au moins un fichier à la liste ci-dessous.

source: MemCheck Settings
fr: Paramètres 'MemCheck'

source: Show Current the Layout of the current file
fr: Afficher le fichier courant la mise en page du fichier courant

source: Outline Plugin
fr: Extension d'aperçu

source: Outline
fr: Contour

source: Run code style checking on PHP source files
fr: Vérifier le style du code sur les fichiers source 'PHP'

source: PHPLint: can not lint file. Missing PHP executable path
fr: 'PHPLint' : Impossible d'analyser le fichier. Chemin de l'exécutable 'PHP' manquant

source: When saving a file, automatically lint it
fr: Lors de l'enregistrement d'un fichier, le mettre en charpie automatiquement l

source: Lint on file save
fr: Pointilleux sur l'enregistrement des fichiers

source: Code Sniffer
fr: Renifleur de code

source: Select the PHP_CodeSniffer phar file location
fr: Sélectionner l'emplacement du fichier de 'PHP_CodeSniffer phar'

source: Mess Detector
fr: Détecteur de messages

source: Select the PHPMD phar file location
fr: Sélectionner l'emplacement du fichier 'PHPMD phar'

source: Select the xml rules file to use with PHPMD
fr: Sélectionner le fichier de règles 'xml' à utiliser avec 'PHPMD'

source: Select the Phpstan phar file location
fr: Sélectionner l'emplacement du fichier 'Phpstan phar'

source: Uses PHP Refactoring Browser to provide refactoring capabilities for php
fr: Utilise le navigateur de refonte 'PHP' pour fournir des capacités de refonte pour 'php'

source: PHP Refactoring
fr: Refonte de PHP'

source: Extract Method
fr: Méthode d'extraction

source: Rename Local Variable
fr: Renommer une variable locale

source: Rename Class Property
fr: Renommer une propriété de classe

source: Convert Local to Instance Variable
fr: Convertir une variable locale en variable d'instance

source: Optimize use statements
fr: Optimiser les déclarations d'usage

source: Refactoring
fr: Remaniement

source: Name the new method
fr: Nommez la nouvelle méthode

source: Method name may not contain spaces
fr: Le nom de la méthode ne doit pas contenir d'espaces

source: This will sync namespaces and classes with folder and filenames, for all files in the selected folder, to comply with psr-0 Continue?
fr: Cette opération synchronisera les espaces de noms et les classes avec les noms de dossiers et de fichiers, pour tous les fichiers du dossier sélectionné, afin de se conformer à la norme psr-0. Poursuivre ?

source: Can not refactor file: Failed to write temporary file
fr: Impossible de remanier le fichier : Échec de l'écriture du fichier temporaire

source: Can not refactor file: failed to read temporary file content
fr: Impossible de remanier le fichier : échec de la lecture du contenu du fichier temporaire

source: Can not refactor file: Missing PHP executable path
fr: Impossible de remanier le fichier : Chemin d'exécution PHP manquant

source: Can not refactor file: Missing PHP Refactoring Browser path
fr: Impossible de refondre le fichier : Chemin du navigateur de refonte 'PHP' manquant

source: on line
fr: en ligne

source: Can only refactor well formed code:
fr: Il ne peut que remanier un code bien formé :

source: Expected patch format. Received:
fr: Format du correctif attendu. Reçu :

source: Rename Class and Namespaces
fr: Renommer les classes et les espaces de noms

source: PHP Refactoring PHAR file:
fr: 'PHP' Remanier le fichier 'PHAR' :

source: Select the PHP Refactoring Browser phar file location
fr: Sélectionnez l'emplacement du fichier 'phar PHP' navigateur de refonte

source: Apply changes without previewing
fr: Appliquer les modifications sans prévisualisation

source: Please review the changes before applying them:
fr: Veuillez examiner les modifications avant de les appliquer :

source: PHP Refactoring Options
fr: Options de remaniement en 'PHP'

source: PHP Refcatoring Preview
fr: Aperçu du référencement en P'HP'

source: Successfully connected to host!
fr: Connexion à l'hôte réussie !

source: Default folder must be set to full path (i.e. it should start with a '/')
fr: Le dossier par défaut doit être défini comme un chemin complet (c'est-à-dire qu'il doit commencer par un « / »).

source: Importing syntax highlight file will override any duplicate syntax highlight settings. Continue?
fr: L'importation d'un fichier de mise en évidence de la syntaxe remplacera tous les paramètres de mise en évidence de la syntaxe dupliqués. Poursuivre ?

source: Generating
fr: Génération

source: Could not locate any MinGW compiler installed on your machine, would you like to install one now?
fr: Aucun compilateur 'MinGW' n'a pu être installé sur votre machine, souhaitez-vous en installer un maintenant ?

source: After the installation process is done Click the 'Scan' button
fr: Une fois le processus d'installation terminé Cliquez sur le bouton 'Scruter'

source: Continue
fr: Continuer

source: Restart debugger
fr: Relancer le débogueur

source: Show Current Line
fr: Montrer la ligne actuelle

source: Step In
fr: Entrer

source: Toggle Rewind Commands
fr: Commandes de rembobinage

source: Start Reverse Debug Recording
fr: Démarrer l'enregistrement de débogage inversé

source: New comparison
fr: Nouvelle comparaison

source: Show similar files only
fr: Ne montrer que les fichiers similaires

source: Copy from Right to Left
fr: Copie de droite à gauche

source: Copy from Left to Right
fr: Copie de gauche à droite

source: Diff
fr: Différences

source: Next Diff
fr: Différence suivante

source: Previous Diff
fr: Différence précédente

source: Copy Right
fr: Copie à droite

source: Copy Left
fr: Copie à gauche

source: Copy All
fr: Tout Copier

source: View Type
fr: Afficher le type

source: does not exist!
fr: n'existe pas !

source: Left Side File:
fr: Dossier latéral gauche :

source: Right Side File:
fr: Dossier latéral droit :

source: Failed to load file content:
fr: Échec du chargement du contenu du fichier :

source: Refreshing the view will lose all your changes Do you want to continue?
fr: Si vous actualisez la vue, toutes vos modifications seront perdues. Voulez-vous continuer ?

source: Failed to save content to file:
fr: Échec de l'enregistrement du contenu dans le fichier :

source: Closing the diff viewer, will lose all your changes. Continue?
fr: En fermant le visualiseur de différences, vous perdrez toutes vos modifications. Poursuivre ?

source: Copy all: left <- right
fr: Copier tout : gauche <- droite

source: Copy all: left -> right
fr: Copier tout : gauche -> droite

source: Single View
fr: Vue unique

source: Horizontal Split
fr: Fractionnement horizontal

source: Vertical Split
fr: Fractionnement vertical

source: Ignore Whitespace
fr: Ignorer les espaces

source: Show Line Numbers
fr: Afficher les numéros de ligne

source: Show Overview Bar
fr: Afficher la barre d'aperçu

source: Select folders for comparison:
fr: Sélectionner les dossiers à comparer :

source: Left
fr: Gauche

source: Right
fr: Droite

source: Diff Folders
fr: Différences des dossiers

source: Delete environment variables set '%s' ?
fr: Supprimer les variables d'environnement définies '%s' ?

source: Failed to open file: '%s' for write
fr: Échec de l'ouverture du fichier : '%s' en écriture

source: Environment exported to: '%s' successfully
fr: Environnement exporté vers : '%s' avec succès

source: Define here set of environment variables which will be applied by CodeLite before launching processes. Variables are defined in the format of NAME=VALUE
fr: Définissez ici un ensemble de variables d'environnement qui seront appliquées par 'CodeLite' avant le lancement des processus. Les variables sont définies dans le format suivant : NOM=VALEUR

source: Available environment sets:
fr: Jeux d'environnement disponibles :

source: &New Set...
fr: &Nouveau jeu ...

source: Delete Set
fr: Supprimer l'ensemble

source: &Export
fr: &Exporter

source: Export the current set to a platform specific environment file
fr: Exporter l'ensemble actuel vers un fichier d'environnement spécifique à la plate-forme

source: Environment Variables
fr: Variables d'environnement

source: -- Open SSH Account Manager --
fr: -- Gestionnaire de compte 'SSH' ouvert --

source: Choose folder
fr: Choisir un dossier

source: Select a directory
fr: Choisir un répertoire

source: Wrong account selected!
fr: Mauvais compte sélectionné !

source: Select debugger executable:
fr: Choisir l'exécutable du débogueur :

source: Search...
fr: Rechercher...

source: Matches
fr: Correspondances

source: Shortcut
fr: Raccourci

source: Method: `
fr: Méthode : `

source: ` is not supported
fr: ` n'est pas pris en charge

source: Key:
fr: Clé :

source: Hit any keyboard key. Don't use the modifier keys (e.g. 'Shift') here, use the checkboxes below
fr: Appuyez sur n'importe quelle touche du clavier. N'utilisez pas les touches de modification (par exemple 'Shift'), mais plutôt les cases à cocher ci-dessous

source: Modifiers:
fr: Modificateurs :

source: Clear the keyboard shortcut
fr: Effacer le raccourci clavier

source: Suggest...
fr: Proposer...

source: Show list of all un-assigned keyboard shortcuts
fr: Afficher la liste de tous les raccourcis clavier non attribués

source: Set New Key Accelerator
fr: Définir un nouvel accélérateur de touches

source: Project name must not contain spaces
fr: Le nom du projet ne doit pas contenir d'espaces

source: MSYS based compiler requires a UNIX Makefile Generator Would like CodeLite to fix this for you?
fr: Le compilateur basé sur 'MSYS' nécessite un générateur de 'Makefile UNIX' Vous souhaitez que 'CodeLite' corrige ce problème pour vous ?

source: Visual C++ compiler requires an NMake generator Would like CodeLite to fix this for you?
fr: Le compilateur 'Visual C++' nécessite un générateur 'NMake' Vous souhaitez que 'CodeLite' corrige ce problème pour vous ?

source: Create the project in its own folder
fr: Créer le projet dans son propre dossier

source: Category:
fr: Catégorie :

source: Compiler:
fr: Compilateur :

source: New Project
fr: Nouveau projet

source: Create new folder
fr: Créer un nouveau dossier

source: Open SSH account manager
fr: Ouvrir le gestionnaire de compte 'SSH'

source: Could not find account:
fr: Impossible de trouver le compte :

source: Are you sure you want to delete the selected accounts?
fr: Êtes-vous sûr de vouloir supprimer les comptes sélectionnés ?

source: My Column
fr: Ma colonne

source: Select language:
fr: Sélectionner un langage :

source: Workspace file:
fr: Fichier de l'espace de travail :

source: Switch to workspace
fr: Passer à l'espace de travail

source: Open workspace
fr: Ouvrir un espace de travail

source: Item
fr: Élément

source: Customise
fr: Personnaliser

source: Select Virtual Folder:
fr: Sélectionnez Dossier virtuel :

source: Create new virtual folder...
fr: Créer un nouveau dossier virtuel...

source: Virtual Directory Selector
fr: Sélecteur de répertoire virtuel

source: New Virtual Folder Name:
fr: Nouveau nom de dossier virtuel :

source: Error occurred while creating virtual folder:
fr: Une erreur s'est produite lors de la création d'un dossier virtuel :

source: Static Text Label
fr: Étiquette de texte statique

source: Please define the value of the following variables:
fr: Veuillez définir la valeur des variables suivantes :

source: Skip
fr: Sauter

source: Import - Environment variable
fr: Importation - Variable d'environnement

source: Line to add:
fr: Ligne à ajouter :

source: File's full path:
fr: Chemin complet du fichier :

source: Add a missing header file
fr: Ajouter un fichier d'en-tête manquant

source: Current working directory:
fr: Répertoire de travail actuel :

source: Running program:
fr: Programme en cours :

source: Program exited with return code:
fr: Le programme s'est arrêté avec un code de retour :

source: Change Active Bookmark Type...
fr: Modifier le type de signet actif...

source: More...
fr: Plus...

source: Normal bookmark
fr: Signet normal

source: Find bookmark
fr: Trouver un signet

source: Bookmark Type
fr: Type de signet

source: Cant open project '
fr: Impossible d'ouvrir le projet '

source: Cant find build configuration for project '
fr: Impossible de trouver la configuration de construction pour le projet '

source: Cant find proper compiler for project '
fr: Impossible de trouver le compilateur approprié pour le projet '

source: ' which is required
fr: ' qui est nécessaire

source: CodeLite can not find project '
fr: 'CodeLite' ne trouve pas le projet '

source: for building project '
fr: pour la construction du projet '

source: '. Would you like to remove it from the dependency list?
fr: '. Souhaitez-vous le supprimer de la liste des dépendances ?

source: Eran Ifrah (author & project admin)
fr: 'Eran Ifrah' (auteur et administrateur du projet)

source: Contributors:
fr: Collaborateurs :

source: About
fr: À propos

source: Author:
fr: Auteur :

source: 2007 - 2023, by Eran Ifrah
fr: 2007 - 2023, par 'Eran Ifrah'

source: Home Page:
fr: Page d'accueil :

source: License
fr: Licence

source: Credits
fr: Crédits

source: Welcome to the setup wizard
fr: Bienvenue dans l'assistant de configuration

source: This wizard will help you setup CodeLite to fit your coding style. Click Next to continue
fr: Cet assistant vous aidera à configurer 'CodeLite' en fonction de votre style de codage. Cliquez sur Suivant pour continuer

source: Not this time!
fr: Pas cette fois-ci !

source: If your CodeLite is already configured the way you like it, click to skip the Wizard
fr: Si votre 'CodeLite' est déjà configuré comme vous le souhaitez, cliquez sur pour ignorer l'assistant

source: Development Profile
fr: Profil de développement

source: Select the profile that best describes you
fr: Choisissez le profil qui vous décrit le mieux

source: C/C++ development
fr: Développement 'C/C++'

source: Web development (PHP, JS etc)
fr: Développement internet ('PHP, JS', etc.)

source: C/C++ development (Blockchain using EOSIO)
fr: Développement 'C/C++' (chaîne de blocs utilisant 'EOSIO')

source: Setup compilers
fr: Mise en place des compilateurs

source: Let CodeLite configure your installed compilers or help you install one
fr: Laissez 'CodeLite' configurer les compilateurs installés ou vous aider à en installer un

source: Click to scan your computer for installed compilers
fr: Cliquez sur pour scruter votre ordinateur à la recherche de compilateurs installés

source: Click to download a MinGW compiler
fr: Cliquez pour télécharger un compilateur 'MinGW'

source: Install
fr: Installer

source: Compiler Name
fr: Nom du compilateur

source: Installation Path
fr: Chemin d'installation

source: Customise colours
fr: Personnaliser les couleurs

source: Select the editor theme from the list below. You can always change this from the menu: Settings -> Colours and fonts...
fr: Sélectionnez le thème de l'éditeur dans la liste ci-dessous. Vous pouvez toujours le modifier à partir du menu : Paramètres -> Couleurs et polices...

source: Theme:
fr: Thème :
