Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Column Caption
fr: Colonne du titre

source: Column Width (in pixels) -1 - special value for column width meaning unspecified/default -2 - size the column automatically to fit all values
fr: Largeur de la colonne (en pixels) -1 - valeur spéciale pour la largeur de la colonne, c'est-à-dire non spécifiée/par défaut -2 - dimensionne automatiquement la colonne pour qu'elle corresponde à toutes les valeurs

source: Column Type
fr: Colonne du type

source: Choices strings Relevant only for column of type 'choice'
fr: Choix des chaînes Ne concerne que les colonnes de type « choix ».

source: Cell Alignment
fr: Alignement des cellules

source: Cell mode (can be editable, activatable or inert)
fr: Mode des cellule (peut être modifiable, activable ou inerte)

source: One or more flags of the wxDataViewColumnFlags enumeration
fr: Un ou plusieurs fanions de l'énumération 'wxDataViewColumnFlags'

source: Process a wxEVT_COMMAND_DATAVIEW_SELECTION_CHANGED event
fr: Traitement d'un événement 'wxEVT_COMMAND_DATAVIEW_SELECTION_CHANGED'

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_ACTIVATED event. This event is triggered by double clicking an item or pressing some special key (usually "Enter") when it is focused
fr: Traite un événement 'wxEVT_COMMAND_DATAVIEW_ITEM_ACTIVATED'. Cet événement est déclenché en double-cliquant sur un élément ou en appuyant sur une touche spéciale (généralement « Entrée ») lorsque l'élément est focalisé

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_START_EDITING event. This event can be vetoed in order to prevent editing on an item by item basis
fr: Traite un événement 'wxEVT_COMMAND_DATAVIEW_ITEM_START_EDITING'. Cet événement peut faire l'objet d'un veto afin d'empêcher l'édition article par article

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_EDITING_STARTED event
fr: Traitement d'un événement 'wxEVT_COMMAND_DATAVIEW_ITEM_EDITING_STARTED'

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_EDITING_DONE event
fr: Traitement d'un événement 'wxEVT_COMMAND_DATAVIEW_ITEM_EDITING_DONE'

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_COLLAPSING event
fr: Traitement d'un événement 'wxEVT_COMMAND_DATAVIEW_ITEM_COLLAPSING'

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_COLLAPSED event
fr: Traitement d'un événement 'wxEVT_COMMAND_DATAVIEW_ITEM_COLLAPSED'

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_EXPANDED event
fr: Traitement d'un événement wxEVT_COMMAND_DATAVIEW_ITEM_EXPANDED

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_VALUE_CHANGED event
fr: Traitement d'un événement wxEVT_COMMAND_DATAVIEW_ITEM_VALUE_CHANGED

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_CONTEXT_MENU event generated when the user right clicks inside the control. Notice that this menu is generated even if the click didn't occur on any valid item, in this case wxDataViewEvent::GetItem() simply returns an invalid item.
fr: Traite un événement wxEVT_COMMAND_DATAVIEW_ITEM_CONTEXT_MENU généré lorsque l'utilisateur effectue un clic droit à l'intérieur du contrôle. Notez que ce menu est généré même si le clic ne s'est pas produit sur un élément valide, dans ce cas wxDataViewEvent::GetItem() renvoie simplement un élément invalide.

source: Process a wxEVT_COMMAND_DATAVIEW_COLUMN_HEADER_CLICK event
fr: Traitement d'un événement wxEVT_COMMAND_DATAVIEW_COLUMN_HEADER_CLICK

source: Process a wxEVT_COMMAND_DATAVIEW_COLUMN_HEADER_RIGHT_CLICK event
fr: Traitement d'un événement wxEVT_COMMAND_DATAVIEW_COLUMN_HEADER_RIGHT_CLICK

source: Process a wxEVT_COMMAND_DATAVIEW_COLUMN_SORTED event
fr: Traitement d'un événement wxEVT_COMMAND_DATAVIEW_COLUMN_SORTED

source: Process a wxEVT_COMMAND_DATAVIEW_COLUMN_REORDERED event
fr: Traitement d'un événement wxEVT_COMMAND_DATAVIEW_COLUMN_REORDERED

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_BEGIN_DRAG event
fr: Traitement d'un événement wxEVT_COMMAND_DATAVIEW_ITEM_BEGIN_DRAG

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_DROP_POSSIBLE event
fr: Traitement d'un événement wxEVT_COMMAND_DATAVIEW_ITEM_DROP_POSSIBLE

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_DROP event
fr: Traitement d'un événement wxEVT_COMMAND_DATAVIEW_ITEM_DROP

source: Inherited C++ Class Properties
fr: Propriétés des classes héritées en 'C++'

source: The generated model class name
fr: Le nom de la classe du modèle généré

source: wxCrafter will generate a TreeListCtrl model like 'Tree-List-Ctrl
fr: 'wxCrafter' génère un modèle 'TreeListCtrl' comme 'Tree-List-Ctrl'

source: ** Leave this field empty if you do not want wxCrafter to generate a model class for you
fr: ** Laissez ce champ vide si vous ne voulez pas que 'wxCrafter' génère une classe de modèle pour vous

source: Indicate if a container item merely acts as a headline (or for categorisation) or if it also acts a normal item with entries for further columns
fr: Indiquer si un élément du conteneur sert simplement de titre (ou de catégorie) ou s'il sert également d'élément normal avec des entrées pour d'autres colonnes

source: This event fires when the user changes the current selection in the control.
fr: Cet événement se déclenche lorsque l'utilisateur modifie la sélection en cours dans le contrôle.

source: Message to show to the user
fr: Message à montrer à l'utilisateur

source: The user changed the directory selected in the control either using the button or using text control (see wxDIRP_USE_TEXTCTRL; note that in this case the event is fired only if the user's input is valid, e.g. an existing directory path).
fr: L'utilisateur a modifié le répertoire sélectionné dans le contrôle, soit en utilisant le bouton, soit en utilisant le contrôle de texte (voir 'wxDIRP_USE_TEXTCTRL' ; notez que dans ce cas, l'événement n'est déclenché que si l'entrée de l'utilisateur est valide, par exemple un chemin de répertoire existant).

source: Default value
fr: Valeur par défaut

source: Wildcard
fr: Joker

source: The user changed the file selected in the control either using the button or using text control (see wxFLP_USE_TEXTCTRL; note that in this case the event is fired only if the user's input is valid, e.g. an existing file path if wxFLP_FILE_MUST_EXIST was given).
fr: L'utilisateur a modifié le fichier sélectionné dans le contrôle, soit en utilisant le bouton, soit en utilisant le contrôle de texte (voir 'wxFLP_USE_TEXTCTRL' ; notez que dans ce cas, l'événement est déclenché seulement si l'entrée de l'utilisateur est valide, par exemple un chemin de fichier existant si 'wxFLP_FILE_MUST_EXIST' a été donné).

source: Generated whenever the selected font changes.
fr: Généré chaque fois que la police sélectionnée change.

source: Initial font
fr: Police de caractères initiale

source: Integer range (maximum value) of the gauge. It is ignored when the gauge is used in indeterminate mode.
fr: Plage d'entiers (valeur maximale) de la jauge. Il est ignoré lorsque la jauge est utilisée en mode indéterminé.

source: Sets the position of the gauge
fr: Fixe la position de la jauge

source: Sets the default path
fr: Définit le chemin par défaut

source: Sets the filter string. The syntax is similar to the one used in wxFileDialog
fr: Définit la chaîne de filtrage. La syntaxe est similaire à celle utilisée dans 'wxFileDialog'

source: Sets the current filter index (zero-based).
fr: Définit l'indice du filtre actuel (basé sur zéro).

source: The user has started dragging an item with the left mouse button. The event handler must call wxTreeEvent::Allow() for the drag operation to continue.
fr: L'utilisateur a commencé à faire glisser un élément avec le bouton gauche de la souris. Le gestionnaire d'événement doit appeler 'wxTreeEvent::Allow()' pour que l'opération de glissement se poursuive.

source: The user has started dragging an item with the right mouse button. The event handler must call wxTreeEvent::Allow() for the drag operation to continue.
fr: L'utilisateur a commencé à faire glisser un élément avec le bouton droit de la souris. Le gestionnaire d'événement doit appeler 'wxTreeEvent::Allow()' pour que l'opération de glissement se poursuive.

source: The user has released the mouse after dragging an item.
fr: L'utilisateur a relâché la souris après avoir fait glisser un élément.

source: Begin editing a label. This can be prevented by calling Veto().
fr: Commencer à éditer une étiquette. Ceci peut être évité en appelant 'Veto()'.

source: The user has finished editing a label. This can be prevented by calling Veto().
fr: L'utilisateur a fini de modifier une étiquette. Ceci peut être évité en appelant 'Veto()'.

source: A tree item has been deleted.
fr: Un élément de l'arbre a été supprimé.

source: The item has been expanded.
fr: L'élément a été développé.

source: The item is being expanded. This can be prevented by calling Veto().
fr: L'élément est en cours d'extension. Ceci peut être évité en appelant 'Veto()'.

source: The item has been collapsed.
fr: L'élément a été réduit.

source: The item is being collapsed. This can be prevented by calling Veto().
fr: L'élément est en train d'être réduit. Ceci peut être évité en appelant 'Veto()'.

source: Selection has changed.
fr: La sélection a changé.

source: Selection is changing. This can be prevented by calling Veto().
fr: La sélection change. Ceci peut être évité en appelant 'Veto()'.

source: A key has been pressed.
fr: Une touche a été enfoncée.

source: An item has been activated (e.g. double clicked).
fr: Un élément a été activé (par exemple, double-clic).

source: The user has clicked the item with the right mouse button.
fr: L'utilisateur a cliqué sur l'élément avec le bouton droit de la souris.

source: The user has clicked the item with the middle mouse button.
fr: L'utilisateur a cliqué sur l'élément avec le bouton du milieu de la souris.

source: The state image has been clicked. Windows only.
fr: L'image de l'état a été cliquée. 'Windows' uniquement.

source: The opportunity to set the item tooltip is being given to the application (call wxTreeEvent::SetToolTip). Windows only.
fr: La possibilité de définir l'info-bulle de l'élément est donnée à l'application (appeler' wxTreeEvent::SetToolTip'). Windows uniquement.

source: The context menu for the selected item has been requested, either by a right click or by using the menu key.
fr: Le menu contextuel de l'élément sélectionné a été demandé, soit par un clic droit, soit en utilisant la touche menu.

source: wxGLCanvas Attribute List
fr: - Liste des attributs de 'wxGLCanvas'

source: Use true color palette (on if no attrs specified)
fr: Utiliser une palette de couleurs réelles (activée si aucun attribut n'est spécifié)

source: bits for buffer if not WX_GL_RGBA
fr: bits pour le tampon s'il ne s'agit pas de 'WX_GL_RGBA'

source: 0 for main buffer, >0 for overlay, <0 for underlay
fr: 0 pour la mémoire tampon principale, >0 pour la mémoire tampon superposée, <0 pour la mémoire tampon sous-jacente

source: use double buffering (on if no attrs specified)
fr: utiliser la double mise en mémoire tampon (activée si aucun attribut n'est spécifié)

source: use stereoscopic display
fr: utiliser l'affichage stéréoscopique

source: number of auxiliary buffers
fr: nombre de tampons auxiliaires

source: use red buffer with most bits (> MIN_RED bits)
fr: utiliser le tampon rouge avec le plus grand nombre de bits (> 'MIN_RED bits')

source: use green buffer with most bits (> MIN_GREEN bits)
fr: utiliser le tampon vert avec le plus grand nombre de bits (> 'MIN_GREEN' bits)

source: use blue buffer with most bits (> MIN_BLUE bits)
fr: utiliser le tampon bleu avec le plus grand nombre de bits (> 'MIN_BLUE' bits)

source: use alpha buffer with most bits (> MIN_ALPHA bits)
fr: utiliser le tampon alpha avec le plus grand nombre de bits (> 'MIN_ALPHA' bits)

source: bits for Z-buffer (0,16,32)
fr: bits pour le tampon Z (0,16,32)

source: bits for stencil buffer
fr: bits pour le tampon du pochoir

source: use red accum buffer with most bits (> MIN_ACCUM_RED bits)
fr: utiliser le tampon d'accumulation rouge avec le plus grand nombre de bits (> 'MIN_ACCUM_RED' bits)

source: use green buffer with most bits (> MIN_ACCUM_GREEN bits)
fr: utiliser le tampon vert avec le plus grand nombre de bits (> 'MIN_ACCUM_GREEN' bits)

source: use blue buffer with most bits (> MIN_ACCUM_BLUE bits)
fr: utiliser le tampon bleu avec le plus grand nombre de bits (> 'MIN_ACCUM_BLUE' bits)

source: use alpha buffer with most bits (> MIN_ACCUM_ALPHA bits)
fr: utiliser le tampon alpha avec le plus grand nombre de bits (> 'MIN_ACCUM_ALPHA' bits)

source: 1 for multisampling support (antialiasing)
fr: 1 pour la prise en charge du multi-échantillonnage (anticrénelage)

source: 4 for 2x2 antialiasing supersampling on most graphics cards
fr: 4 pour le sur-échantillonnage anti-crénelage 2x2 sur la plupart des cartes graphiques

source: wxGrid Column
fr: - Colonne 'wxGrid'

source: The Column Label
fr: L'intitulé de la colonne

source: Sets the width of the specified column. The new column width in pixels, 0 to hide the column or -1 to fit the column width to its label width
fr: Définit la largeur de la colonne spécifiée. La nouvelle largeur de la colonne en pixels, 0 pour masquer la colonne ou -1 pour adapter la largeur de la colonne à celle de l'étiquette.

source: wxGrid Row
fr: - Ligne de 'wxGrid'

source: My Row
fr: Ma ligne

source: The Row Label
fr: L'étiquette de la ligne

source: Sets the height of the row Default -1 fits to the label height
fr: Définit la hauteur de la ligne La valeur par défaut -1 correspond à la hauteur de l'étiquette

source: wxGrid Header
fr: - En-tête 'wxGrid'

source: Auto size column content to fit the column header
fr: Taille automatique du contenu de la colonne en fonction de l'en-tête de la colonne

source: Enable the use of native header window for column labels
fr: Activer l'utilisation de la fenêtre d'en-tête native pour les étiquettes de colonne

source: wxGrid Columns Labels
fr: - Étiquettes des colonnes de 'wxGrid'

source: Sets the height of the column label
fr: Définit la hauteur de l'étiquette de la colonne

source: Sets the horizontal alignment of the label
fr: Fixe l'alignement horizontal de l'étiquette

source: Sets the vertical alignment of the label
fr: Définit l'alignement vertical de l'étiquette

source: wxGrid Rows Labels
fr: - Étiquettes des lignes 'wxGrid'

source: Sets the width of the row labels
fr: Définit la largeur des étiquettes de ligne

source: wxGrid Cells
fr: - Cellules 'wxGrid'

source: Allow editing grid content
fr: Permettre l'édition du contenu de la grille

source: The user is about to change the data in a cell. The new cell value as string is available from GetString() event object method. This event can be vetoed if the change is not allowed. Processes a wxEVT_GRID_CELL_CHANGING event type
fr: L'utilisateur est sur le point de modifier les données d'une cellule. La nouvelle valeur de la cellule sous forme de chaîne de caractères est disponible grâce à la méthode de l'objet d'événement 'GetString()'. Cet événement peut faire l'objet d'un veto si la modification n'est pas autorisée. Traite un événement de type 'wxEVT_GRID_CELL_CHANGING'

source: The user changed the data in a cell. The old cell value as string is available from GetString() event object method. Notice that vetoing this event still works for backwards compatibility reasons but any new code should only veto EVT_GRID_CELL_CHANGING event and not this one. Processes a wxEVT_GRID_CELL_CHANGED event type.
fr: L'utilisateur a modifié les données d'une cellule. L'ancienne valeur de la cellule sous forme de chaîne de caractères est disponible à partir de la méthode 'GetString()' de l'objet d'événement. Notez que le veto sur cet événement fonctionne toujours pour des raisons de compatibilité ascendante, mais que tout nouveau code ne doit opposer son veto qu'à l'événement 'EVT_GRID_CELL_CHANGING' et non à celui-ci. Traite un type d'événement 'wxEVT_GRID_CELL_CHANGED'.

source: The user clicked a cell with the left mouse button. Processes a wxEVT_GRID_CELL_LEFT_CLICK.
fr: L'utilisateur a cliqué sur une cellule avec le bouton gauche de la souris. Traite un 'wxEVT_GRID_CELL_LEFT_CLICK'.

source: The user double-clicked a cell with the left mouse button. Processes a wxEVT_GRID_CELL_LEFT_DCLICK
fr: L'utilisateur a double-cliqué sur une cellule avec le bouton gauche de la souris. Traite un 'wxEVT_GRID_CELL_LEFT_DCLICK'

source: The user clicked a cell with the right mouse button. Processes a wxEVT_GRID_CELL_RIGHT_CLICK.
fr: L'utilisateur a cliqué sur une cellule avec le bouton droit de la souris. Traite un 'wxEVT_GRID_CELL_RIGHT_CLICK'.

source: The user double-clicked a cell with the right mouse button. Processes a wxEVT_GRID_CELL_RIGHT_DCLICK.
fr: L'utilisateur a double-cliqué sur une cellule avec le bouton droit de la souris. Traite un 'wxEVT_GRID_CELL_RIGHT_DCLICK'.

source: The editor for a cell was hidden. Processes a wxEVT_GRID_EDITOR_HIDDEN event type.
fr: L'éditeur d'une cellule a été caché. Traite un type d'événement 'wxEVT_GRID_EDITOR_HIDDEN'.

source: The editor for a cell was shown. Processes a wxEVT_GRID_EDITOR_SHOWN event type
fr: L'éditeur d'une cellule a été affiché. Traite un événement de type 'wxEVT_GRID_EDITOR_SHOWN'

source: The user clicked a label with the left mouse button. Processes a wxEVT_GRID_LABEL_LEFT_CLICK.
fr: L'utilisateur a cliqué sur une étiquette avec le bouton gauche de la souris. Traite un 'wxEVT_GRID_LABEL_LEFT_CLICK'.

source: The user double-clicked a label with the left mouse button. Processes a wxEVT_GRID_LABEL_LEFT_DCLICK.
fr: L'utilisateur a double-cliqué sur une étiquette avec le bouton gauche de la souris. Traite un 'wxEVT_GRID_LABEL_LEFT_DCLICK'.

source: The user clicked a label with the right mouse button. Processes a wxEVT_GRID_LABEL_RIGHT_CLICK.
fr: L'utilisateur a cliqué sur une étiquette avec le bouton droit de la souris. Traite un wxEVT_GRID_LABEL_RIGHT_CLICK.

source: The user double-clicked a label with the right mouse button. Processes a wxEVT_GRID_LABEL_RIGHT_DCLICK.
fr: L'utilisateur a double-cliqué sur une étiquette avec le bouton droit de la souris. Traite un 'wxEVT_GRID_LABEL_RIGHT_DCLICK'.

source: The user moved to, and selected a cell. Processes a wxEVT_GRID_SELECT_CELL.
fr: L'utilisateur s'est déplacé et a sélectionné une cellule. Traite un 'wxEVT_GRID_SELECT_CELL'.

source: The user tries to change the order of the columns in the grid by dragging the column specified by GetCol(). This event can be vetoed to either prevent the user from reordering the column change completely (but notice that if you don't want to allow it at all, you simply shouldn't call wxGrid::EnableDragColMove() in the first place), vetoed but handled in some way in the handler, e.g. by really moving the column to the new position at the associated table level, or allowed to proceed in which case wxGrid::SetColPos() is used to reorder the columns display order without affecting the use of the column indices otherwise. This event macro corresponds to wxEVT_GRID_COL_MOVE event type.
fr: L'utilisateur essaie de changer l'ordre des colonnes dans la grille en faisant glisser la colonne spécifiée par 'GetCol()'. Cet événement peut faire l'objet d'un veto pour empêcher l'utilisateur de modifier complètement l'ordre des colonnes (mais notez que si vous ne voulez pas du tout l'autoriser, vous ne devez tout simplement pas appeler 'wxGrid::EnableDragColMove()' en premier lieu), d'un veto mais géré d'une certaine manière dans le gestionnaire, par exemple en déplaçant réellement la colonne à la nouvelle position au niveau de la table associée, ou d'une autorisation de procéder, auquel cas la colonne sera déplacée à la nouvelle position au niveau de la table associée. par exemple en déplaçant réellement la colonne vers la nouvelle position au niveau de la table associée, ou autorisé à continuer, auquel cas 'wxGrid::SetColPos()' est utilisé pour réorganiser l'ordre d'affichage des colonnes sans affecter l'utilisation des indices de colonne par ailleurs. Cette macro d'événement correspond au type d'événement 'wxEVT_GRID_COL_MOVE'.

source: This event is generated when a column is clicked by the user and its name is explained by the fact that the custom reaction to a click on a column is to sort the grid contents by this column. However the grid itself has no special support for sorting and it's up to the handler of this event to update the associated table. But if the event is handled (and not vetoed) the grid supposes that the table was indeed resorted and updates the column to indicate the new sort order and refreshes itself. This event macro corresponds to wxEVT_GRID_COL_SORT event type.
fr: Cet événement est généré lorsque l'utilisateur clique sur une colonne et son nom s'explique par le fait que la réaction habituelle à un clic sur une colonne est de trier le contenu de la grille en fonction de cette colonne. Cependant, la grille elle-même n'a pas de support spécial pour le tri et c'est au gestionnaire de cet événement de mettre à jour la table associée. Mais si l'événement est traité (et n'est pas bloqué), la grille suppose que le tableau a effectivement été trié et met à jour la colonne pour indiquer le nouvel ordre de tri et se rafraîchit. Cette macro d'événement correspond au type d'événement 'wxEVT_GRID_COL_SORT'.

source: This event is generated when the user presses TAB or Shift-TAB in the grid. It can be used to customize the simple default TAB handling logic, e.g. to go to the next non-empty cell instead of just the next cell. See also wxGrid::SetTabBehaviour(). This event is new since wxWidgets 2.9.5.
fr: Cet événement est généré lorsque l'utilisateur appuie sur 'TAB' ou 'Shift-TAB' dans la grille. Il peut être utilisé pour personnaliser la logique de gestion par défaut de la touche 'TAB', par exemple pour passer à la prochaine cellule non vide au lieu de la cellule suivante. Voir aussi 'wxGrid::SetTabBehaviour()'. Cet événement est nouveau depuis 'wxWidgets 2.9.5'.

source: HTML code to load
fr: Code 'HTML' à charger

source: URL to load
fr: Adresse internet à charger

source: A wxHtmlCell was clicked.
fr: Une cellule 'wxHtmlCell' a été cliquée.

source: The mouse passed over a wxHtmlCell.
fr: La souris passe au dessus d'un 'wxHtmlCell'.

source: A wxHtmlCell which contains an hyperlink was clicked.
fr: Une cellule wxHtmlCell contenant un lien hypertexte a été cliquée.

source: The hyperlink was (left) clicked. If this event is not handled in user's code (or it's skipped; see wxEvent::Skip) then a call to wxLaunchDefaultBrowser is done with the hyperlink's URL.
fr: Le lien hypertexte a été cliqué (à gauche). Si cet événement n'est pas géré dans le code de l'utilisateur (ou s'il est ignoré ; voir wxEvent::Skip) alors un appel à wxLaunchDefaultBrowser est fait avec l'URL de l'hyperlien.

source: The label of the hyperlink
fr: L'étiquette du lien hypertexte

source: The URL associated with the given label
fr: L'URL associée à l'étiquette donnée

source: Sets the colour used to print the label when the link has never been clicked before (i.e. the link has not been visited) and the mouse is not over the control.
fr: Définit la couleur utilisée pour imprimer l'étiquette lorsque le lien n'a jamais été cliqué auparavant (c'est-à-dire que le lien n'a pas été visité) et que la souris n'est pas au-dessus du contrôle. (c'est-à-dire que le lien n'a pas été visité) et que la souris n'est pas au-dessus du contrôle.

source: Sets the colour used to print the label when the mouse is not over the control and the link has already been clicked before (i.e. the link has been visited)
fr: Définit la couleur utilisée pour imprimer l'étiquette lorsque la souris n'est pas au-dessus du contrôle et que le lien a déjà été cliqué auparavant (c'est-à-dire que le lien a été visité). (c'est-à-dire que le lien a été visité)
