Repository: eranif/codelite
Catalog: translations/*/codelite.po
Languages: fr

source: Multiple candidates found. Select a file to open:
fr: Plusieurs candidats trouvés. Sélectionnez un fichier à ouvrir :

source: Swap Header/Source Implementation
fr: Mise en œuvre de l'en-tête et de la source d'échange

source: No matched file was found, would you like to create one?
fr: Aucun fichier correspondant n'a été trouvé, souhaitez-vous en créer un ?

source: Create
fr: Créer

source: Don't Create
fr: Ne pas créer

source: Remember my answer and don't ask me again
fr: Souvenez-vous de ma réponse et ne me demandez plus rien

source: Seems like you have all the getters/setters you need...
fr: Il semble que vous ayez tous les 'getters/setters' dont vous avez besoin...

source: Could not locate implementation file!
fr: Impossible de localiser le fichier de mise en œuvre !

source: Could not read file:
fr: Impossible de lire le fichier :

source: No prototypes were found
fr: Aucun prototype n'a été trouvé

source: 'Add Functions Implementation' can only work inside valid scope, got (
fr: L'option « Ajouter une implémentation de fonctions » ne peut fonctionner qu'à l'intérieur d'un champ d'application valide, obtenu (

source: No un-implemented functions found
fr: Aucune fonction non implémentée trouvée

source: Symbol renamed
fr: Symbole renommé

source: Please save the file before retagging it
fr: Veuillez sauvegarder le fichier avant de l'étiqueter à nouveau

source: Select file to open:
fr: Sélectionner le fichier à ouvrir :

source: Create File
fr: Création du fichier

source: New File Name:
fr: Nouveau nom de fichier :

source: Find Symbol
fr: Trouver un symbole

source: Go to Declaration
fr: Aller à la déclaration

source: Go to Implementation
fr: Aller à la mise en œuvre

source: Select core dump:
fr: Sélectionner le vidage du noyau :

source: Core dump to be opened:
fr: Vidage du noyau à ouvrir :

source: Enter the full filepath of the core dump to be examined. Or, if you enter the correct working directory below, just the filename will suffice.
fr: Saisissez le chemin d'accès complet du fichier 'core dump' à examiner. Ou, si vous entrez le répertoire de travail correct ci-dessous, le nom du fichier suffira.

source: Corresponding executable:
fr: Exécutable correspondant :

source: Enter the full filepath of the executable that crashed to cause the core dump. Or, if you enter the correct working directory below, just the filename will suffice.
fr: Saisissez le chemin d'accès complet de l'exécutable qui s'est écrasé pour provoquer le vidage du noyau. Ou, si vous entrez le répertoire de travail correct ci-dessous, le nom du fichier suffira.

source: Working directory (optional):
fr: Répertoire de travail (facultatif) :

source: Select debugger:
fr: Sélectionnez le débogueur :

source: Debug
fr: Déboguer

source: Debug a core dump
fr: Débogage d'un vidage de noyau

source: Debugger Command
fr: Commande du débogueur

source: A Debugger type with that name already exists
fr: Un type de débogueur portant ce nom existe déjà

source: Displaying:
fr: Affichage :

source: &Clear
fr: &Effacer

source: Locals
fr: Locaux

source: Call Stack
fr: Pile d'appel

source: Ascii Viewer
fr: Visualiseur 'Ascii'

source: Disassemble
fr: Désassembler

source: &New...
fr: &Nouveau...

source: Copy Values From:
fr: Copier les valeurs de :

source: Make this 'PreDefined Types' set active
fr: Activez le jeu « Types prédéfinis »

source: Debugger path:
fr: Chemin du débogueur :

source: Enable pending breakpoints
fr: Activer les points d'arrêt en attente

source: Some breakpoints can't be applied before the program is run, or even later. This is especially a problem when trying to debug inside a library that is dynamically loaded (CodeLite itself contains examples of this). gdb has an option to 'remember' any breakpoints that it can't initially set, and automatically to set them when it becomes possible. It doesn't always work! However, tick this box to tell gdb to try.
fr: Certains points d'arrêt ne peuvent pas être appliqués avant l'exécution du programme, ou même plus tard. C'est notamment un problème lorsque l'on essaie de déboguer à l'intérieur d'une bibliothèque qui est chargée dynamiquement ('CodeLite' lui-même contient des exemples de ce type). 'gdb' dispose d'une option qui lui permet de « mémoriser » les points d'arrêt qu'il ne peut pas définir initialement, et de les définir automatiquement lorsque cela devient possible. Cela ne fonctionne pas toujours ! Cependant, cochez cette case pour demander à gdb d'essayer.

source: Apply breakpoints after main function is hit
fr: Appliquer des points d'arrêt après l'exécution de la fonction principale

source: Sometimes, some breakpoints won't apply cleanly until after main() has been reached. If this box is ticked, CodeLite won't try to apply them earlier.
fr: Parfois, certains points d'arrêt ne s'appliqueront proprement qu'après que main() ait été atteint. Si cette case est cochée, 'CodeLite' n'essaiera pas de les appliquer plus tôt.

source: Automatically set breakpoint at main
fr: Mise en place automatique d'un point d'arrêt au niveau de la ligne principale

source: Every time the debugger runs, set a breakpoint at main(). You may wish to stop then anyway; but it's especially useful when you want to set breakpoints that won't 'take' earlier (however, first try enabling Pending breakpoints, or 'Apply breakpoints after main is hit'
fr: Chaque fois que le débogueur s'exécute, placez un point d'arrêt à main(). Il se peut que vous souhaitiez vous arrêter à ce moment-là de toute façon, mais c'est particulièrement utile lorsque vous souhaitez définir des points d'arrêt qui ne seront pas « pris » plus tôt (cependant, essayez d'abord d'activer les points d'arrêt en attente, ou « Appliquer des points d'arrêt après que main soit frappé »).

source: Break when a C++ exception is thrown
fr: Interruption lorsqu'une exception 'C++' est levée

source: Raise CodeLite when a breakpoint is hit
fr: Lancer 'CodeLite' lorsqu'un point d'arrêt est atteint

source: Normally, when a breakpoint is hit, you'll want CodeLite to be raise to the top of the window z-order, so that you can examine values of variables etc. However you won't always want that to happen; in particular, not if the breakpoint has commands, which end in 'continue'. If so untick this box to stop it happening.
fr: Normalement, lorsqu'un point d'arrêt est atteint, vous voudrez que 'CodeLite' remonte en haut de l'ordre z de la fenêtre, afin que vous puissiez examiner les valeurs des variables, etc. Cependant, vous ne voudrez pas toujours que cela se produise ; en particulier, pas si le point d'arrêt a des commandes qui se terminent par « continue ». Dans ce cas, décochez cette case pour éviter que cela ne se produise.

source: On platforms that support it, run gdb as superuser
fr: Sur les plates-formes qui le permettent, exécutez 'gdb' en tant que super-utilisateur

source: On platforms that support it, run gdb as superuser. This is done by running gdb with 'sudo'
fr: Sur les plateformes qui le supportent, lancez 'gdb' en tant que super-utilisateur. Pour ce faire, lancez 'gdb' avec 'sudo'

source: Use default Hex Display
fr: Utiliser l'affichage hexagonal par défaut

source: Tooltip
fr: Info-bulle

source: Use CTRL key to evaluate expressions under the cursor
fr: Utiliser la touche 'CTRL' pour évaluer les expressions sous le curseur

source: When enabled, codelite will evaluate the expression under the cursor only if the CTRL key is down. Otherwise, it will evaluate it automatically
fr: Lorsque cette option est activée, 'Codelite' évalue l'expression sous le curseur uniquement si la touche 'CTRL' est enfoncée. Sinon, il l'évalue automatiquement

source: Auto expand items under the cursor
fr: Développement automatique des éléments sous le curseur

source: Display
fr: Afficheur

source: Max string size:
fr: Taille maximale de la chaîne :

source: For no limit, set it to 0
fr: Pour l'absence de limite, la valeur est fixée à 0

source: Max number of elements:
fr: Nombre maximum d'éléments :

source: Use 'PreDefined types for the 'Locals' view
fr: Utiliser les « types prédéfinis » pour la vue « Locaux »

source: Auto cast 'char[]' into 'char*'
fr: Transformer automatiquement 'char[]' en 'char*'

source: Enable GDB Pretty Printing
fr: Activer l'impression "GDB Pretty"

source: If ticked, examining the contents of e.g. std::string, wxString, wxArrayString will be much easier
fr: Si la case est cochée, l'examen du contenu de 'std::string, wxString, wxArrayString', par exemple, sera beaucoup plus facile

source: Print object ON
fr: Impression des objets activée

source: When displaying a pointer to an object, identify the actual (derived) type of the object rather than the declared type, using the virtual function table.
fr: Lors de l'affichage d'un pointeur sur un objet, identifiez le type réel (dérivé) de l'objet plutôt que le type déclaré, en utilisant la table des fonctions virtuelles.

source: Use file name only for breakpoints (NO full paths)
fr: Utiliser uniquement le nom du fichier pour les points d'arrêt (PAS de chemin d'accès complet)

source: Enable full debugger logging
fr: Activer la journalisation complète du débogueur

source: Show debugger terminal
fr: Afficher le terminal du débogueur

source: Max number of frames to allow in a call-stack
fr: Nombre maximal de trames à autoriser dans une pile d'appels

source: The maximum number of frames that CodeLite will display in the Call Stack tab. This protects against a very long hang while trying to show 100,000 frames in an infinite recursion situation.
fr: Le nombre maximum d'images que 'CodeLite' affichera dans l'onglet Pile d'appel. Cela permet de se prémunir contre un blocage très long en essayant d'afficher 100 000 images dans une situation de récursivité infinie.

source: Break at assertion failure (MinGW only)
fr: Rupture à l'échec de l'affirmation ('MinGW' uniquement)

source: Cygwin path conversion command:
fr: Commande de conversion de chemin 'Cygwin' :

source: Set here the command to use in order to convert cygwin paths into native Windows paths (use $(File) as a place holder for the file name)
fr: Définissez ici la commande à utiliser pour convertir les chemins d'accès 'cygwin' en chemins d'accès Windows natifs (utilisez $(File) comme substitut pour le nom du fichier).

source: &New
fr: &Nouveau

source: Create new 'PreDefined' set
fr: Créer un nouvel ensemble 'Prédéfini'

source: Delete the currently selected set
fr: Supprimer l'ensemble sélectionné

source: Available sets:
fr: Jeux disponibles :

source: Current function:
fr: Fonction actuelle :

source: Register
fr: Registre

source: Debugger Settings
fr: Paramètres du débogueur

source: Create a new 'PreDefined Types' set...
fr: Créer un nouveau jeu de « Types prédéfinis »...

source: You are about to delete 'PreDefined Types' set '%s' Continue ?
fr: Vous êtes sur le point de supprimer l'ensemble 'Types prédéfinis' '%s' Continuer ?

source: Confirm deleting 'PreDefined Types' set
fr: Confirmer la suppression de l'ensemble « Types prédéfinis »

source: A set with this name already exist
fr: Un jeu portant ce nom existe déjà

source: Name Already Exists
fr: Le nom existe déjà

source: GNU gdb debugger
fr: Débogueur 'GNU gdb'

source: Startup Commands
fr: Commandes de démarrage

source: Pre-Defined Types
fr: Types prédéfinis

source: Below is a list of the 'annoying' dialogs answers, you can modify the answer of a dialog by checking / unchecking the saved answer
fr: Vous trouverez ci-dessous une liste des réponses aux dialogues 'gênants', vous pouvez modifier la réponse d'un dialogue en cochant / décochant la réponse sauvegardée. la réponse d'un dialogue en cochant / décochant la réponse sauvegardée

source: &Rename
fr: &Renommer

source: Enter New Name:
fr: Saisir un nouveau nom :

source: Rename
fr: Renommer

source: Remove configuration '
fr: Supprimer la configuration '

source: Edit Configurations
fr: Modifier la configuration

source: &Close
fr: &Fermer

source: Remove workspace configuration '
fr: Supprimer la configuration de l'espace de travail '

source: New Configuration Name:
fr: Nom de la nouvelle configuration :

source: Edit Workspace Configuration
fr: Modifier la configuration de l'espace de travail

source: Find
fr: Trouver

source: Indentation settings
fr: Paramètres d'indentation

source: Disable Smart Indentation
fr: Désactiver l'indentation intelligente

source: Use tabs
fr: Utiliser les &tabulations

source: Columns per indentation level
fr: Colonnes par niveau d'indentation

source: Tab width
fr: Largeur de tabulation

source: Trim lines
fr: Tailler les lignes

source: Enable trim on save
fr: Activer le calibrage lors de l'enregistrement

source: Do not trim the caret line
fr: Ne pas couper la ligne de curseur

source: Trim modified lines only
fr: Ne tailler que les lignes modifiées

source: If missing, append EOL at the end of file
fr: En cas d'absence, ajouter 'EOL' à la fin du fichier

source: Symbol margin
fr: Symbole de la marge

source: Display the symbol margin
fr: Afficher le symbole de la marge

source: Shape
fr: Forme

source: Bookmark #
fr: Signet #

source: colour
fr: couleur

source: label
fr: étiquette

source: Highlight matches
fr: Mettre en évidence les correspondances

source: Colour
fr: Couleur

source: Find/Find Next clears highlit matching words
fr: 'Rechercher / Rechercher suivant' efface les mots correspondants mis en surbrillance

source: Caret blink period
fr: Période de clignotement du curseur

source: Caret width
fr: Largeur du curseur

source: Use block caret
fr: Utiliser le curseur du bloc

source: Allow caret to scroll beyond end of file
fr: Permettre au curseur de défiler au-delà de la fin du fichier

source: Allow caret to be placed beyond the end of line
fr: Permet de placer le curseur au-delà de la fin de la ligne

source: Caret jumps between word segments
fr: Le curseur saute entre les segments de mots

source: Auto-adjust horizontal scrollbar width
fr: Ajustement automatique de la largeur de la barre de défilement horizontale

source: Comments
fr: Commentaires

source: Hitting ENTER in C comment, adds `*`
fr: En appuyant sur ENTER dans un commentaire C, on ajoute `*`

source: Hitting ENTER in C++ comment, adds `//`
fr: En appuyant sur ENTER dans un commentaire C++, on ajoute `//`

source: Code navigation shortcut is: Mouse left button and:
fr: Le raccourci de navigation du code est : Bouton gauche de la souris et :

source: Control Key
fr: Touche de contrôle

source: Alt Key
fr: Touche 'Alt'

source: Generated doc comments
fr: Commentaires générés sur les documents

source: Class template
fr: Modèle de classe

source: Function template
fr: Modèle de fonction

source: Auto generate on ENTER
fr: Génération automatique lors de l'ENTRÉE

source: Use Qt style docs
fr: Utiliser des documents de type 'Qt'

source: Tabs
fr: Tabulations

source: Height
fr: Hauteur

source: Workspace tabs orientation
fr: Orientation des onglets de l'espace de travail

source: Output tabs orientation
fr: Orientation des onglets de sortie

source: Show close button on tabs
fr: Afficher le bouton de fermeture sur les onglets

source: Show file path on tab label
fr: Afficher le chemin d'accès au fichier sur l'étiquette de l'onglet

source: Mouse scroll switch bewtween tabs
fr: Passage d'un onglet à l'autre avec la souris

source: Sort tab file list
fr: Onglet de tri de la liste des fichiers

source: Use Ctrl+TAB to switch tabs
fr: Utiliser 'Ctrl+TAB' pour changer d'onglet

source: Hide main tab bar
fr: Cacher la barre d'onglets principale

source: Find in files
fr: Rechercher dans les fichiers

source: Don't automatically fold search results
fr: Ne pas plier automatiquement les résultats de recherche

source: When searching, don't override search string with current selection
fr: Lors d'une recherche, ne pas remplacer la chaîne de recherche par la sélection actuelle

source: Folding
fr: Repliement

source: Show folding margin
fr: Montrer la marge de pliage

source: Appearance
fr: Apparence

source: Folding options
fr: Options de repliement

source: Underline folded line
fr: Souligner la ligne repliée

source: Fold `else` blocks
fr: Replier les blocs 'else'

source: Fold pre-processor blocks
fr: Replier les blocs du préprocesseur

source: Fold compact
fr: Pliage compact

source: Highlight active fold block
fr: Mettre en évidence le bloc de pliage actif

source: Workspace local editor preferences
fr: Préférences de l'éditeur local de l'espace de travail

source: Project local editor preferences
fr: Préférences locales de l'éditeur du projet

source: Indentation only
fr: Indentation seulement

source: Local Preferences
fr: Préférences locales

source: Use global setting
fr: Utiliser la configuration globale

source: Use tabs in indentation
fr: Utiliser les tabulations pour l'indentation

source: If clear, only spaces will be used for indentation. If set, a mixture of tabs and spaces will be used.
fr: Si cette option n'est pas activée, seuls les espaces seront utilisés pour l'indentation. S'il est défini, un mélange de tabulations et d'espaces sera utilisé.

source: Columns per tab character in document:
fr: Colonnes par caractère de tabulation dans le document :

source: Columns per indentation level:
fr: Colonnes par niveau d'indentation :

source: Margins
fr: Marges

source: Display Breakpoints / Bookmarks margin
fr: Afficher la marge des points d'arrêt / signets

source: Display Folding margin
fr: Affichage la marge de pliage

source: Display the margin that lets you 'fold' individual functions, or sections of functions, to hide their contents
fr: Afficher la marge qui vous permet de « replier » des fonctions individuelles ou des sections de fonctions pour en masquer le contenu

source: Track modified lines in the editor
fr: Suivi des lignes modifiées dans l'éditeur

source: Track modified lines in the editor by colouring them with a distinct colour
fr: Suivre les lignes modifiées dans l'éditeur en les colorant d'une couleur distincte

source: Display line numbers margin
fr: Affichage de la marge des numéros de ligne

source: Show indentation guidelines
fr: Montrer les règles d'indentation

source: Display horizontal guides for matching braces "{"
fr: Afficher les guides horizontaux pour les accolades correspondantes « { »

source: Highlight caret line
fr: Mettre en évidence la ligne du curseur

source: Set a different background colour for the line containing the caret
fr: Définir une couleur d'arrière-plan différente pour la ligne contenant le curseur

source: When saving files, trim empty lines
fr: Lors de l'enregistrement des fichiers, tailler les lignes vides

source: If missing, append EOL at end of file
fr: En cas d'absence, ajouter 'EOL' à la fin du fichier

source: Make sure the file finishes with an end-of-line
fr: Assurez-vous que le fichier se termine par une fin de ligne

source: Whitespace visibility:
fr: Visibilité des espaces :

source: EOL Mode:
fr: Mode fin de ligne (EOL) :

source: Set the editor's EOL mode (End Of Line). When set to 'Default' CodeLite will set the EOL according to the hosting OS
fr: Définit le mode 'EOL (End Of Line)' de l'éditeur. Lorsqu'il est réglé sur « Défaut », 'CodeLite' règle l'EOL' en fonction du système d'exploitation de l'hébergeur

source: File font encoding
fr: Encodage des polices de caractères du fichier

source: Allow only single instance
fr: Autoriser une seule instance

source: Web search URL
fr: Recherche 'URL' sur Internet

source: Use Direct2D editor drawings
fr: Utiliser les dessins de l'éditeur 'Direct2D'

source: Frame title
fr: Titre du cadre

source: Startup
fr: Démarrage

source: Check for new version on startup
fr: Vérifier la présence d'une nouvelle version au démarrage

source: Only prompt for stable releases
fr: Ne s'affiche que pour les versions stables

source: Load last session on startup
fr: Chargement de la dernière session au démarrage

source: Show splashscreen
fr: Afficher l'écran d'accueil

source: Status bar
fr: Barre d'état

source: Show current line number
fr: Afficher le numéro de la ligne actuelle

source: Show current column
fr: Afficher la colonne actuelle

source: Show current position
fr: Montrer la position actuelle

source: Show file length
fr: Montrer la longueur du fichier

source: Show number of selected chars
fr: Afficher le nombre de caractères sélectionnés

source: Tool bar
fr: Barre d'outils

source: Space between button groups
fr: Espace entre les groupes de boutons

source: Locale
fr: Localisation

source: File text encoding
fr: Encodage du texte du fichier

source: Enable localization
fr: Activer la localisation

source: Locale to use
fr: Localisation à utiliser

source: Log file verbosity
fr: Verbosité du fichier journal

source: Redirect stdout/stderr to file
fr: Redirection de stdout/stderr vers un fichier

source: History
fr: Historique

source: Clear
fr: Effacer

source: Forget recent workspaces and files
fr: Oublier les espaces de travail et les fichiers récents

source: Success!
fr: Succès !

source: Reset annoying dialogs answers
fr: Réinitialiser les réponses aux dialogues gênants

source: Terminals
fr: Terminaux

source: Choose your terminal
fr: Choisir votre terminal

source: C&lear All
fr: Tout &Nettoyer

source: Some files were modified outside of the editor. What would you like to do?
fr: Certains fichiers ont été modifiés en dehors de l'éditeur. Que souhaitez-vous faire ?

source: Reload all the externally modified files
fr: Recharger tous les fichiers modifiés de l'extérieur

source: Reload.
fr: Recharger.

source: Choose.
fr: Choisir.

source: Let me choose which file or files to reload
fr: Laissez-moi choisir le ou les fichiers à recharger

source: Don't reload any the externally modified files
fr: Ne pas recharger les fichiers modifiés de l'extérieur

source: Ignore.
fr: Ignorer.

source: Remember my answer
fr: Souvenez-vous de ma réponse

source: Select Files
fr: Sélectionner les fichiers

source: Files were modified outside the editor
fr: Les fichiers ont été modifiés en dehors de l'éditeur

source: Open folder
fr: Ouvrir le dossier

source: File Explorer
fr: Explorateur de fichiers

source: Select folder to open
fr: Sélectionner le dossier à ouvrir

source: Set Custom Background Colour...
fr: Définir une couleur d'arrière-plan personnalisée...

source: Add Existing Item
fr: Ajouter un élément existant

source: New Item
fr: Nouvel élément

source: Are you sure you want remove '
fr: Êtes-vous sûr de vouloir supprimer '

source: Remember my answer and apply it all files
fr: Souvenez-vous de ma réponse et appliquez-la à tous les dossiers

source: Are you sure?
fr: Êtes-vous sûr(e) ?

source: ' from disc?
fr: ' à partir du disque ?

source: Do you also want to delete the file '
fr: Voulez-vous également supprimer le fichier '

source: No
fr: Non

source: Yes
fr: Oui

source: An error occurred during file removal. Maybe it has been already deleted or you don't have the necessary permissions
fr: Une erreur s'est produite lors de la suppression du fichier. Il a peut-être déjà été supprimé ou vous ne disposez pas des autorisations nécessaires

source: and all its contents will be removed from the project.
fr: et tout son contenu seront supprimés du projet.

source: You are about to remove project '
fr: Vous êtes sur le point de supprimer le projet '

source: from the workspace, click 'Yes' to proceed or 'No' to abort.
fr: de l'espace de travail, cliquez sur « Oui » pour continuer ou sur « Non » pour abandonner.

source: of project
fr: du projet

source: Compiling file:
fr: Compilation du fichier :

source: Preprocessing file:
fr: Prétraitement du fichier :

source: in FileView.
fr: dans 'FileView'.

source: Failed to find file:
fr: Échec de la recherche du fichier :

source: Importing files ...
fr: Importation de fichiers ...

source: Adding file:
fr: Ajout de fichier :
