Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: The user changed the colour selected in the control either using the button or using text control (see wxCLRP_USE_TEXTCTRL; note that in this case the event is fired only if the user's input is valid, i.e. recognizable).
ru_ru: Пользователь изменил цвет, выбранный в элементе управления, либо с помощью кнопки, либо с помощью текстового элемента управления (смотрите wxCLRP_USE_TEXTCTRL; обратите внимание, что в этом случае событие создаётся, только если пользователем введены допустимые, т.е. распознаваемые данные).

source: Sets a hint shown in an empty unfocused text control
ru_ru: Устанавливает подсказку в пустом текстовом элементе управления без фокуса

source: Control Specific Settings
ru_ru: Параметры элементов управления

source: First line of text on the button, typically the label of an action that will be made when the button is pressed
ru_ru: Первая строка текста на кнопке, обычно метка действия, которое будет выполнено при нажатии кнопки

source: Second line of text describing the action performed when the button is pressed
ru_ru: Вторая строка текста, описывающего действие, выполняемое при нажатии кнопки

source: wxDataViewListCtrl Column
ru_ru: Столбец wxDataViewListCtrl

source: Column Caption
ru_ru: Заголовок столбца

source: Column Width (in pixels) -1 - special value for column width meaning unspecified/default -2 - size the column automatically to fit all values
ru_ru: Ширина столбца (в пикселях) -1 — специальное значение для ширины столбца, означающее «не указано» или «поумолчанию» -2 — автоматическое изменение размера столбца для размещения всех значений

source: Column Type
ru_ru: Тип столбца

source: Choices strings Relevant only for column of type 'choice'
ru_ru: Строки выбора. Применимо только к столбцу типа «выбор»

source: Cell Alignment
ru_ru: Выравнивание в ячейке

source: Cell mode (can be editable, activatable or inert)
ru_ru: Режим ячейки (может быть редактируемой, активируемой и нейтральной)

source: One or more flags of the wxDataViewColumnFlags enumeration
ru_ru: Один или несколько флагов перечисления wxDataViewColumnFlags

source: Process a wxEVT_COMMAND_DATAVIEW_SELECTION_CHANGED event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_SELECTION_CHANGED

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_ACTIVATED event. This event is triggered by double clicking an item or pressing some special key (usually "Enter") when it is focused
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_ACTIVATED. Это событие активируется двойным щелчком по элементу или нажатием определённой клавиши (обычно «Ввод») при наличии фокуса на этом элементе

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_START_EDITING event. This event can be vetoed in order to prevent editing on an item by item basis
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_START_EDITING. Можно запретить это событие, чтобы предотвратить поэлементное редактирование

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_EDITING_STARTED event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_EDITING_STARTED

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_EDITING_DONE event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_EDITING_DONE

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_COLLAPSING event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_COLLAPSING

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_COLLAPSED event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_COLLAPSED

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_EXPANDING event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_EXPANDING

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_EXPANDED event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_EXPANDED

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_VALUE_CHANGED event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_VALUE_CHANGED

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_CONTEXT_MENU event generated when the user right clicks inside the control. Notice that this menu is generated even if the click didn't occur on any valid item, in this case wxDataViewEvent::GetItem() simply returns an invalid item.
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_CONTEXT_MENU, создаваемое щелчком правой кнопкой мыши внутри элемента управления. Обратите внимание, что меню создаётся, даже если щелчок сделан не по какому-либо из допустимых элементов. В этом случае wxDataViewEvent::GetItem() просто возвращает недопустимый элемент.

source: Process a wxEVT_COMMAND_DATAVIEW_COLUMN_HEADER_CLICK event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_COLUMN_HEADER_CLICK

source: Process a wxEVT_COMMAND_DATAVIEW_COLUMN_HEADER_RIGHT_CLICK event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_COLUMN_HEADER_RIGHT_CLICK

source: Process a wxEVT_COMMAND_DATAVIEW_COLUMN_SORTED event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_COLUMN_SORTED

source: Process a wxEVT_COMMAND_DATAVIEW_COLUMN_REORDERED event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_COLUMN_REORDERED

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_BEGIN_DRAG event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_BEGIN_DRAG

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_DROP_POSSIBLE event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_DROP_POSSIBLE

source: Process a wxEVT_COMMAND_DATAVIEW_ITEM_DROP event
ru_ru: Обрабатывать событие wxEVT_COMMAND_DATAVIEW_ITEM_DROP

source: Inherited C++ Class Properties
ru_ru: Свойства унаследованного класса C++

source: The generated model class name
ru_ru: Имя создаваемого класса модели

source: wxCrafter will generate a TreeListCtrl model like 'Tree-List-Ctrl
ru_ru: wxCrafter создаст модель TreeListCtrl как «Tree-List-Ctrl»

source: ** Leave this field empty if you do not want wxCrafter to generate a model class for you
ru_ru: ** Оставьте это поле пустым, если вам не требуется, чтобы wxCrafter создавал класс модели для вас

source: Indicate if a container item merely acts as a headline (or for categorisation) or if it also acts a normal item with entries for further columns
ru_ru: Укажите, используется ли элемент контейнера только в качестве заголовка (или для классификации) или также является обычным элементом с записями для других столбцов

source: This event fires when the user changes the current selection in the control.
ru_ru: Это событие создаётся при изменении пользователем текущего выбора в элементе управления.

source: Message to show to the user
ru_ru: Сообщение, показываемое пользователю

source: The user changed the directory selected in the control either using the button or using text control (see wxDIRP_USE_TEXTCTRL; note that in this case the event is fired only if the user's input is valid, e.g. an existing directory path).
ru_ru: Пользователь изменил каталог, выбранный в элементе управления, либо с помощью кнопки, либо с помощью текстового элемента управления (смотрите wxDIRP_USE_TEXTCTRL; обратите внимание, что в этом случае событие создаётся, только если пользователем введены допустимые данные, например существующий путь к каталогу).

source: Default value
ru_ru: Значение по умолчанию

source: Wildcard
ru_ru: Подстановочный знак

source: The user changed the file selected in the control either using the button or using text control (see wxFLP_USE_TEXTCTRL; note that in this case the event is fired only if the user's input is valid, e.g. an existing file path if wxFLP_FILE_MUST_EXIST was given).
ru_ru: Пользователь изменил файл, выбранный в элементе управления, либо с помощью кнопки, либо с помощью текстового элемента управления (смотрите wxFLP_USE_TEXTCTRL; обратите внимание, что в этом случае событие создаётся, только если пользователем введены допустимые данные, например существующий путь к файлу, если задан wxFLP_FILE_MUST_EXIST).

source: Generated whenever the selected font changes.
ru_ru: Создаётся при изменении выбранного шрифта.

source: Initial font
ru_ru: Первоначальный шрифт

source: Integer range (maximum value) of the gauge. It is ignored when the gauge is used in indeterminate mode.
ru_ru: Диапазон целых чисел (максимальное значение) индикатора выполнения. Игнорируется, если индикатор выполнения работает в режиме без указания количества.

source: Sets the position of the gauge
ru_ru: Устанавливает положение индикатора выполнения

source: Sets the default path
ru_ru: Устанавливает путь по умолчанию

source: Sets the filter string. The syntax is similar to the one used in wxFileDialog
ru_ru: Устанавливает строку фильтра. Синтаксис аналогичен синтаксису, используемому в wxFileDialog

source: Sets the current filter index (zero-based).
ru_ru: Устанавливает текущий индекс фильтра (начинающийся с нуля).

source: The user has started dragging an item with the left mouse button. The event handler must call wxTreeEvent::Allow() for the drag operation to continue.
ru_ru: Пользователь начал перетаскивание элемента с помощью левой кнопки мыши. Обработчик событий должен вызвать wxTreeEvent::Allow(), чтобы продолжить перетаскивание.

source: The user has started dragging an item with the right mouse button. The event handler must call wxTreeEvent::Allow() for the drag operation to continue.
ru_ru: Пользователь начал перетаскивание элемента с помощью правой кнопки мыши. Обработчик событий должен вызвать wxTreeEvent::Allow(), чтобы продолжить перетаскивание.

source: The user has released the mouse after dragging an item.
ru_ru: Пользователь отпустил кнопку мыши после перетаскивания элемента.

source: Begin editing a label. This can be prevented by calling Veto().
ru_ru: Начать изменение метки. Это можно предотвратить, вызвав Veto().

source: The user has finished editing a label. This can be prevented by calling Veto().
ru_ru: Пользователь завершил изменение метки. Это можно предотвратить, вызвав Veto().

source: A tree item has been deleted.
ru_ru: Элемент дерева был удалён.

source: The item has been expanded.
ru_ru: Элемент был развёрнут.

source: The item is being expanded. This can be prevented by calling Veto().
ru_ru: Выполняется развёртывание элемента. Это можно предотвратить, вызвав Veto().

source: The item has been collapsed.
ru_ru: Элемент был свёрнут.

source: The item is being collapsed. This can be prevented by calling Veto().
ru_ru: Выполняется свёртывание элемента. Это можно предотвратить, вызвав Veto().

source: Selection has changed.
ru_ru: Выбор изменён.

source: Selection is changing. This can be prevented by calling Veto().
ru_ru: Выполняется изменение выбора. Это можно предотвратить, вызвав Veto().

source: A key has been pressed.
ru_ru: Клавиша была нажата.

source: An item has been activated (e.g. double clicked).
ru_ru: Элемент был активирован (например, двойным щелчком).

source: The user has clicked the item with the right mouse button.
ru_ru: Пользователь выполнил щелчок по элементу правой кнопкой мыши.

source: The user has clicked the item with the middle mouse button.
ru_ru: Пользователь выполнил щелчок по элементу средней кнопкой мыши.

source: The state image has been clicked. Windows only.
ru_ru: Выполнен щелчок по изображению состояния. Только для Windows.

source: The opportunity to set the item tooltip is being given to the application (call wxTreeEvent::SetToolTip). Windows only.
ru_ru: Приложению предоставляется возможность установить всплывающую подсказку элемента (вызов wxTreeEvent::SetToolTip). Только для Windows.

source: The context menu for the selected item has been requested, either by a right click or by using the menu key.
ru_ru: Выполнен запрос контекстного меню для выбранного элемента (либо щелчком правой кнопкой мыши, либо с помощью клавиши меню).

source: wxGLCanvas Attribute List
ru_ru: Список атрибутов wxGLCanvas

source: Use true color palette (on if no attrs specified)
ru_ru: Использовать палитру True Color (включено, если не указаны атрибуты)

source: bits for buffer if not WX_GL_RGBA
ru_ru: бит для буфера, если не используется WX_GL_RGBA

source: 0 for main buffer, >0 for overlay, <0 for underlay
ru_ru: 0 для главного буфера, >0 для наложения, <0 для подложки

source: use double buffering (on if no attrs specified)
ru_ru: использовать двойной буфер (включено, если не указаны атрибуты)

source: use stereoscopic display
ru_ru: использовать стереоскопический дисплей

source: number of auxiliary buffers
ru_ru: количество вспомогательных буферов

source: use red buffer with most bits (> MIN_RED bits)
ru_ru: использовать буфер красного с наибольшим количеством битов (> MIN_RED бит)

source: use green buffer with most bits (> MIN_GREEN bits)
ru_ru: использовать буфер зелёного с наибольшим количеством битов (> MIN_GREEN бит)

source: use blue buffer with most bits (> MIN_BLUE bits)
ru_ru: использовать буфер синего с наибольшим количеством битов (> MIN_BLUE бит)

source: use alpha buffer with most bits (> MIN_ALPHA bits)
ru_ru: использовать буфер прозрачности с наибольшим количеством битов (> MIN_ALPHA бит)

source: bits for Z-buffer (0,16,32)
ru_ru: бит для Z-буфера (0,16,32)

source: bits for stencil buffer
ru_ru: бит для буфера шаблонов

source: use red accum buffer with most bits (> MIN_ACCUM_RED bits)
ru_ru: использовать буфер накопления красного с наибольшим количеством битов (> MIN_ACCUM_RED бит)

source: use green buffer with most bits (> MIN_ACCUM_GREEN bits)
ru_ru: использовать буфер накопления зелёного с наибольшим количеством битов (> MIN_ACCUM_GREEN бит)

source: use blue buffer with most bits (> MIN_ACCUM_BLUE bits)
ru_ru: использовать буфер накопления синего с наибольшим количеством битов (> MIN_ACCUM_BLUE бит)

source: use alpha buffer with most bits (> MIN_ACCUM_ALPHA bits)
ru_ru: использовать буфер накопления прозрачности с наибольшим количеством битов (> MIN_ACCUM_ALPHA бит)

source: 1 for multisampling support (antialiasing)
ru_ru: 1 для поддержки множественной выборки (сглаживания)

source: 4 for 2x2 antialiasing supersampling on most graphics cards
ru_ru: 4 для избыточной выборки сглаживания 2x2 на большинстве видеокарт

source: wxGrid Column
ru_ru: Столбец wxGrid

source: The Column Label
ru_ru: Метка столбца

source: Sets the width of the specified column. The new column width in pixels, 0 to hide the column or -1 to fit the column width to its label width
ru_ru: Устанавливает ширину указанного столбца. Ширина нового столбца в пикселях, 0 для скрытия столбца или -1 для подгонки ширины столбца под ширину метки

source: wxGrid Row
ru_ru: Строка wxGrid

source: My Row
ru_ru: Моя строка

source: The Row Label
ru_ru: Метка строки

source: Sets the height of the row Default -1 fits to the label height
ru_ru: Устанавливает высоту строки. -1 по умолчанию обеспечивает подгонку по высоте метки

source: wxGrid Header
ru_ru: Заголовок wxGrid

source: Auto size column content to fit the column header
ru_ru: Автоподбор размера содержимого столбца в соответствии с размером заголовка

source: Enable the use of native header window for column labels
ru_ru: Включить использование собственного окна заголовка для меток столбцов

source: wxGrid Columns Labels
ru_ru: Метки столбцов wxGrid

source: Sets the height of the column label
ru_ru: Устанавливает высоту метки столбца

source: Sets the horizontal alignment of the label
ru_ru: Устанавливает выравнивание метки по горизонтали

source: Sets the vertical alignment of the label
ru_ru: Устанавливает выравнивание метки по вертикали

source: wxGrid Rows Labels
ru_ru: Метки строк wxGrid

source: Sets the width of the row labels
ru_ru: Устанавливает ширину меток строк

source: wxGrid Cells
ru_ru: Ячейки wxGrid

source: Allow editing grid content
ru_ru: Разрешить редактирование содержимого таблицы

source: The user is about to change the data in a cell. The new cell value as string is available from GetString() event object method. This event can be vetoed if the change is not allowed. Processes a wxEVT_GRID_CELL_CHANGING event type
ru_ru: Пользователь собирается изменить дату в ячейке. Новое значение ячейки в виде строки доступно из метода объекта события GetString(). Это событие можно запретить, если изменение не допускается. Обрабатывается тип события wxEVT_GRID_CELL_CHANGING.

source: The user changed the data in a cell. The old cell value as string is available from GetString() event object method. Notice that vetoing this event still works for backwards compatibility reasons but any new code should only veto EVT_GRID_CELL_CHANGING event and not this one. Processes a wxEVT_GRID_CELL_CHANGED event type.
ru_ru: Пользователь изменил данные в ячейке. Старое значение в виде строки доступно из метода объекта события GetString(). Обратите внимание, что запрет на это событие всё ещё работает по причине обратной совместимости, но любой новый код должен запрещать только событие EVT_GRID_CELL_CHANGING, а не это событие. Обрабатывается тип события wxEVT_GRID_CELL_CHANGED.

source: The user clicked a cell with the left mouse button. Processes a wxEVT_GRID_CELL_LEFT_CLICK.
ru_ru: Пользователь выполнил щелчок левой кнопкой мыши по ячейке. Обрабатывается wxEVT_GRID_CELL_LEFT_CLICK.

source: The user double-clicked a cell with the left mouse button. Processes a wxEVT_GRID_CELL_LEFT_DCLICK
ru_ru: Пользователь выполнил двойной щелчок левой кнопкой мыши по ячейке. Обрабатывается wxEVT_GRID_CELL_LEFT_DCLICK.

source: The user clicked a cell with the right mouse button. Processes a wxEVT_GRID_CELL_RIGHT_CLICK.
ru_ru: Пользователь выполнил щелчок правой кнопкой мыши по ячейке. Обрабатывается wxEVT_GRID_CELL_RIGHT_CLICK.

source: The user double-clicked a cell with the right mouse button. Processes a wxEVT_GRID_CELL_RIGHT_DCLICK.
ru_ru: Пользователь выполнил двойной щелчок правой кнопкой мыши по ячейке. Обрабатывается wxEVT_GRID_CELL_RIGHT_DCLICK.

source: The editor for a cell was hidden. Processes a wxEVT_GRID_EDITOR_HIDDEN event type.
ru_ru: Редактор ячейки был скрыт. Обрабатывается тип события wxEVT_GRID_EDITOR_HIDDEN.

source: The editor for a cell was shown. Processes a wxEVT_GRID_EDITOR_SHOWN event type
ru_ru: Редактор ячейки был показан. Обрабатывается тип события wxEVT_GRID_EDITOR_SHOWN.

source: The user clicked a label with the left mouse button. Processes a wxEVT_GRID_LABEL_LEFT_CLICK.
ru_ru: Пользователь выполнил щелчок левой кнопкой мыши по метке. Обрабатывается wxEVT_GRID_LABEL_LEFT_CLICK.

source: The user double-clicked a label with the left mouse button. Processes a wxEVT_GRID_LABEL_LEFT_DCLICK.
ru_ru: Пользователь выполнил двойной щелчок левой кнопкой мыши по метке. Обрабатывается wxEVT_GRID_LABEL_LEFT_DCLICK.

source: The user clicked a label with the right mouse button. Processes a wxEVT_GRID_LABEL_RIGHT_CLICK.
ru_ru: Пользователь выполнил щелчок правой кнопкой мыши по метке. Обрабатывается wxEVT_GRID_LABEL_RIGHT_CLICK.

source: The user double-clicked a label with the right mouse button. Processes a wxEVT_GRID_LABEL_RIGHT_DCLICK.
ru_ru: Пользователь выполнил двойной щелчок правой кнопкой мыши по метке. Обрабатывается wxEVT_GRID_LABEL_RIGHT_DCLICK.

source: The user moved to, and selected a cell. Processes a wxEVT_GRID_SELECT_CELL.
ru_ru: Пользователь перешёл к ячейке и выбрал её. Обрабатывается wxEVT_GRID_SELECT_CELL.

source: The user tries to change the order of the columns in the grid by dragging the column specified by GetCol(). This event can be vetoed to either prevent the user from reordering the column change completely (but notice that if you don't want to allow it at all, you simply shouldn't call wxGrid::EnableDragColMove() in the first place), vetoed but handled in some way in the handler, e.g. by really moving the column to the new position at the associated table level, or allowed to proceed in which case wxGrid::SetColPos() is used to reorder the columns display order without affecting the use of the column indices otherwise. This event macro corresponds to wxEVT_GRID_COL_MOVE event type.
ru_ru: Пользователь пытается изменить порядок столбцов в сетке путём перетаскивания столбца, указанного GetCol(). Можно запретить это событие, чтобы пользователь вообще не смог изменить порядок столбцов (но обратите внимание, что для такого запрета можно просто не вызывать wxGrid::EnableDragColMove()); можно запретить, но обработать каким-либо образом в обработчике, например, действительно переместив столбец на новую позицию на уровне связанной таблицы, или разрешить продолжить, в случае чего wxGrid::SetColPos() используется для изменения порядка отображения столбцов без влияния на использование индексов столбцов в других случаях. Макрос этого события соответствует типу события wxEVT_GRID_COL_MOVE.

source: This event is generated when a column is clicked by the user and its name is explained by the fact that the custom reaction to a click on a column is to sort the grid contents by this column. However the grid itself has no special support for sorting and it's up to the handler of this event to update the associated table. But if the event is handled (and not vetoed) the grid supposes that the table was indeed resorted and updates the column to indicate the new sort order and refreshes itself. This event macro corresponds to wxEVT_GRID_COL_SORT event type.
ru_ru: Это событие создаётся при выполнении пользователем щелчка по столбцу, и его название объясняется тем фактом, что пользовательская реакция на щелчок по столбцу предполагает сортировку содержимого сетки по этому столбцу. Однако сама сетка не имеет специальной поддержки сортировки, поэтому обновить связанную таблицу должен обработчик этого события. Но если событие обработано (и не запрещено), сетка предполагает, что таблица действительно пересортирована, обновляет столбец, указывая новый порядок сортировки, и обновляется сама. Макрос этого события соответствует типу события wxEVT_GRID_COL_SORT.

source: This event is generated when the user presses TAB or Shift-TAB in the grid. It can be used to customize the simple default TAB handling logic, e.g. to go to the next non-empty cell instead of just the next cell. See also wxGrid::SetTabBehaviour(). This event is new since wxWidgets 2.9.5.
ru_ru: Это событие создаётся при нажатии пользователем клавиш TAB или Shift-TAB в сетке таблицы. Его можно использовать для настройки простой логики обработки TAB по умолчанию, например, для перехода к следующей непустой ячейке, а не просто к следующей ячейке. Смотрите также wxGrid::SetTabBehaviour(). Это событие появилось с выходом версии 2.9.5 wxWidgets.

source: HTML code to load
ru_ru: HTML-код для загрузки

source: URL to load
ru_ru: URL-адрес для загрузки

source: A wxHtmlCell was clicked.
ru_ru: Выполнен щелчок по wxHtmlCell.

source: The mouse passed over a wxHtmlCell.
ru_ru: Указатель мыши наведён на wxHtmlCell.

source: A wxHtmlCell which contains an hyperlink was clicked.
ru_ru: Выполнен щелчок по wxHtmlCell с гиперссылкой.

source: The hyperlink was (left) clicked. If this event is not handled in user's code (or it's skipped; see wxEvent::Skip) then a call to wxLaunchDefaultBrowser is done with the hyperlink's URL.
ru_ru: Выполнен щелчок левой кнопкой мыши по гиперссылке. Если это событие не обрабатывается в коде пользователя (или оно пропущено; см. wxEvent::Skip), то вызов wxLaunchDefaultBrowser выполняется с помощью URL-адреса гиперссылки.

source: The label of the hyperlink
ru_ru: Метка гиперссылки

source: The URL associated with the given label
ru_ru: URL-адрес, связанный с указанной меткой

source: Sets the colour used to print the label when the link has never been clicked before (i.e. the link has not been visited) and the mouse is not over the control.
ru_ru: Устанавливает цвет, используемый для отображения метки, если щелчок по ссылке ещё ни разу не выполнялся (т.е. не выполнялся переход по ссылке) и указатель мыши не наведён на элемент управления.
