Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Tell Cppcheck to use 'n' CPUs. NB this is incompatible with 'unusedFunction', and may give false-positive warnings for e.g. 'Unmatched suppression' .
ru_ru: Укажите CppСheck использовать «n» центральных процессоров. Обратите внимание, что эту возможность нельзя использовать вместе с флажком «Неиспользованные функции» и её использование может привести к выдаче ложных предупреждений, например «Несопоставленное подавление».

source: Number of jobs to try to run in parallel
ru_ru: Число параллельно выполняемых заданий

source: Check configuration (turns off other checks)
ru_ru: Проверять конфигурацию (отключает другие проверки)

source: Pass --check-config to Cppchecker. This is useful if you get a 'Cppcheck cannot find all the include files' warning: it lets you see which #include aren't being located. However it turns off other checks.
ru_ru: Передайте --check-config CppСhecker. Это полезно, если вы получаете предупреждение «CppСheck не может найти все включаемые файлы»: это позволит увидеть, расположение каких #include не установлено. Однако это отключает другие проверки.

source: Exclude
ru_ru: Исключения

source: Files to exclude from CppCheck test:
ru_ru: Файлы, которые следует исключить из проверки CppCheck:

source: Add file(s) to the excluded files list
ru_ru: Добавить файл(ы) в список исключённых файлов

source: Remove the selected file from the excluded file list
ru_ru: Удалить выбранный файл из списка исключённых файлов

source: Clear the excluded files list
ru_ru: Очистить список исключённых файлов

source: Types of warnings NOT to display:
ru_ru: Типы предупреждений, которые не следует отображать:

source: Add an extra check to suppress. You'll need to know its id...
ru_ru: Добавить дополнительную проверку для подавления. Вам потребуется знать её идентификатор...

source: Remove the selected suppression from the list
ru_ru: Удалить выбранное подавление из списка

source: Remember these settings
ru_ru: Запомнить эти настройки

source: If ticked, these settings will be saved and be applied in the future. Otherwise the warnings will be back when you restart CodeLite, which may be what you should want.
ru_ru: Если флажок установлен, эти настройки будут сохранены и применены в будущем. В противном случае предупреждения вернутся после перезапуска CodeLite, что, возможно, вам и требуется.

source: Include Dirs
ru_ru: Каталоги включаемых файлов

source: If the 'Missing Includes' check is enabled, add here any extra directories where Cppcheck should search for #includes
ru_ru: Если флажок «Отсутствующие включаемые файлы» установлен, добавьте здесь любые дополнительные каталоги, в которых CppСheck следует искать #includes

source: Add the full path to a directory to search for #includes
ru_ru: Добавить полный путь к каталогу для поиска #includes

source: Suppress warnings about 'system' includes
ru_ru: Подавлять предупреждения о «системных» включаемых файлах

source: If ticked, the 'missingIncludeSystem' suppression is passed to Cppcheck. This stops it complaining about a missing #include <foo>, while still detecting a missing #include "bar"
ru_ru: Если флажок установлен, подавление «missingIncludeSystem» передаётся CppСheck. Благодаря этому программа перестанет сообщать об отсутствии #include <foo>, при этом продолжая обнаруживать отсутствующие включения «bar»

source: If ticked, these settings will be saved and be applied in the future. Otherwise the warnings will be back when you restart CodeLite, which may be what you want.
ru_ru: Если флажок установлен, эти настройки будут сохранены и применены в будущем. В противном случае предупреждения вернутся после перезапуска CodeLite, что, возможно, вам и требуется.

source: Command-line Definitions
ru_ru: Определения командной строки

source: Here you can pass 'configurations' to cppcheck e.g. "Only test code branches where FOO is defined" or "Don't test code branches where the value of FOO is 2"
ru_ru: Здесь вы можете передать «конфигурации» СppСheck Например, «Тестировать только те ветви кода, где определён FOO» или «Не тестировать те ветви кода, где значение FOO равно 2»

source: Defines to pass e.g. FOO or FOO=1:
ru_ru: Определения для передачи, например FOO или FOO=1:

source: Add here definitions of code branches you want to be checked e.g. 'FOO' or 'BAR=2'. Each will be passed to Cppcheck as '-DFOO' or -D'BAR=2' (so don't write the -D yourself).
ru_ru: Добавьте здесь определения ветвей кода, которые необходимо проверить, например «FOO» или «BAR=2». Каждое из них будет передано CppСheck как «-DFOO» или «-DBAR=2» (поэтому не следует писать -D самостоятельно).

source: Undefines to pass:
ru_ru: Отмены определений для передачи:

source: Here you can add undefines (branches you don't want to be checked) e.g. 'FOO' or 'BAR=2'. Each will be passed to Cppcheck as '-UFOO' or -U'BAR=2' (so don't write the -U yourself).
ru_ru: Здесь вы можете добавить отмены определений (ветви, которые не требуют проверки), например «FOO» или «BAR=2». Каждое из них будет передано CppСheck как «-UFOO» или «-UBAR=2» (поэтому не следует писать -U самостоятельно).

source: Description to show in the dialog
ru_ru: Описание для показа в диалоговом окне

source: This is what you'll see in the settings dialog. Put whatever you like here; it's not used internally
ru_ru: Это — то, что вы будете видеть в диалоговом окне параметров. Можно ввести любой текст; содержимое этого поля не используется программой для внутренних целей

source: The ID string that cppchecker will recognise
ru_ru: Строка идентификатора, которую будет распознавать СppСhecker

source: Enter here the unique ID string that cppchecker can recognise. Examples are "operatorEqVarError" and "uninitMemberVar". You can find these by grepping the cppchecker source, or by running cppchecker on your app in a terminal and passing the additional parameter '--xml'.
ru_ru: Введите здесь строку уникального идентификатора, которую сможет распознать СppСhecker. Примеры — «operatorEqVarError» и «uninitMemberVar». Вы можете найти их, обработав исходный код СppСhecker с помощью команды grep или запустив СppСhecker для вашего приложения в терминале с дополнительным параметром «--xml».

source: CppCheck settings
ru_ru: Параметры CppCheck

source: CppChecker add warning suppression
ru_ru: Добавить подавление предупреждения в CppChecker

source: Search scope:
ru_ru: Область поиска:

source: Update Db if stale
ru_ru: Обновлять базу данных, если устарела

source: If checked, before executing a command CScope will look for any changed files and, if found, try to update the database. In practice this seems unreliable.
ru_ru: Если флажок установлен, то перед выполнением команды CScope будет искать все изменённые файлы и, если они найдены, попытается обновить базу данных. На практике такой способ является ненадёжным.

source: Create reverted Index
ru_ru: Создать обратный индекс

source: Create reverted Index database
ru_ru: Создать базу данных обратных индексов

source: &Update
ru_ru: &Обновить

source: Perform an immediate database update
ru_ru: Выполнить незамедлительное обновление базы данных

source: CScope executable:
ru_ru: Исполняемый файл CScope:

source: Set the path to cscope executable
ru_ru: Укажите путь к исполняемому файлу CScope

source: CScope Settings
ru_ru: Параметры CScope

source: CScope Integration for CodeLite
ru_ru: Интеграция CScope для CodeLite

source: Find selected text
ru_ru: Найти выбранный текст

source: Find this global definition
ru_ru: Найти это глобальное определение

source: Find functions called by this function
ru_ru: Найти функции, вызываемые этой функцией

source: Find functions calling this function
ru_ru: Найти функции, вызывающие эту функцию

source: Create CScope database
ru_ru: Создать базу данных CScope

source: Find this C symbol
ru_ru: Найти этот символ C

source: Find ...
ru_ru: Найти...

source: Find this C global definition
ru_ru: Найти это глобальное определение C

source: Find files #&including this filename
ru_ru: Найти файлы, &включающие это имя файла

source: Find files #including this filename
ru_ru: Найти файлы, включающие это имя файла

source: Create/Recreate the cscope database
ru_ru: Создать или воссоздать базу данных CScope

source: CScope settings
ru_ru: Параметры CScope

source: Configure cscope
ru_ru: Настроить CScope

source: &Find this C symbol
ru_ru: &Найти этот символ C

source: Find this &global definition
ru_ru: Найти это &глобальное определение

source: Find functions &called by this function
ru_ru: Найти функции, &вызванные этой функцией

source: Fi&nd functions calling this function
ru_ru: Най&ти функции, вызывающие эту функцию

source: Create CScope &database
ru_ru: Создать базу данных &CScope

source: Creating file list...
ru_ru: Создание списка файлов...

source: I can't find 'cscope' anywhere. Please check if it's installed.
ru_ru: Не удалось найти «CScope». Проверьте, установлен ли он.

source: Or tell me where it can be found, from the menu: 'Plugins | CScope | Settings'
ru_ru: Или укажите его расположение с помощью меню: «Модули | CScope | Параметры»

source: CScope not found
ru_ru: CScope не найден

source: cscope results for: find global definition of '
ru_ru: Результаты CScope для: найти глобальное определение '

source: cscope results for: functions called by '
ru_ru: Результаты CScope для: функции, вызванные '

source: cscope results for: functions calling '
ru_ru: Результаты CScope для: функции, вызывающие '

source: cscope results for: files that #include '
ru_ru: Результаты CScope для: файлы, включающие '

source: Recreated inverted CScope DB
ru_ru: Воссоздана инвертированная база данных CScope

source: Recreated CScope DB
ru_ru: Воссоздана база данных CScope

source: Enter the symbol to search for:
ru_ru: Введите символ для поиска:

source: cscope: find symbol
ru_ru: CScope: найти символ

source: Executing cscope...
ru_ru: Выполнение CScope...

source: Parsing results...
ru_ru: Анализ результатов...

source: Active Project
ru_ru: Активный проект

source: Entire Workspace
ru_ru: Всё рабочее пространство

source: Line:
ru_ru: Строка:

source: File: `
ru_ru: Файл: `

source: ` is not opened on the server
ru_ru: ` не открыт на сервере

source: Initialization started...
ru_ru: Инициализация начата…

source: Initialization completed
ru_ru: Инициализация завершена

source: unsupported message: `
ru_ru: неподдерживаемое сообщение: `

source: Create local branch
ru_ru: Создать локальную ветвь

source: Switch to local branch
ru_ru: Переключить на локальную ветвь

source: Switch to remote branch
ru_ru: Переключить на удалённую ветвь

source: Apply Patch
ru_ru: Применить исправление

source: Start gitk
ru_ru: Запустить gitk

source: Garbage collect
ru_ru: Собрать мусор

source: Plugin settings
ru_ru: Параметры модуля

source: Clone a git repository
ru_ru: Клонировать репозиторий Git

source: Clear Git Log
ru_ru: Очистить журнал Git

source: Terminate Git Process
ru_ru: Завершить процесс Git

source: Add File
ru_ru: Добавить файл

source: Reset File
ru_ru: Сбросить файл

source: Reset
ru_ru: Сброс

source: Reset repository
ru_ru: Сброс репозитория

source: Pull
ru_ru: Получить

source: Pull remote changes
ru_ru: Получить удалённые изменения

source: Commit local changes
ru_ru: Зафиксировать локальные изменения

source: Push
ru_ru: Передать

source: Push local changes
ru_ru: Передать локальные изменения

source: Rebase
ru_ru: Переместить изменения из одной ветви в другую

source: Diffs
ru_ru: Список различий

source: Show current diffs
ru_ru: Показать текущие различия

source: Browse commit history
ru_ru: Просмотреть журнал фиксаций

source: Open MSYS Git
ru_ru: Открыть Git MSYS

source: Open MSYS Git at the current file location
ru_ru: Открыть Git MSYS в текущем расположении файла

source: Reset file
ru_ru: Сбросить файл

source: Toggle All
ru_ru: Включить или отключить все

source: Simple GIT plugin
ru_ru: Простой модуль Git

source: GIT plugin
ru_ru: Модуль Git

source: Commit changes
ru_ru: Зафиксировать изменения

source: Push changes
ru_ru: Передать изменения

source: Reset current repository
ru_ru: Сбросить текущий репозиторий

source: Switch local branch
ru_ru: Переключить локальную ветвь

source: Switch remote branch
ru_ru: Переключить удалённую ветвь

source: List commits
ru_ru: Список фиксаций

source: Show diffs
ru_ru: Показать различия

source: Show blame
ru_ru: Показать автора последнего изменения в строке

source: Show git blame
ru_ru: Показать git blame

source: List modified files
ru_ru: Список изменённых файлов

source: Clean git database (garbage collection)
ru_ru: Очистить базу данных Git (сборка мусора)

source: Refresh file lists
ru_ru: Обновить списки файлов

source: Refresh git file list
ru_ru: Обновить список файлов Git

source: GIT plugin settings
ru_ru: Параметры модуля Git

source: Using git Click to open the git view
ru_ru: Использование Git. Щёлкните, чтобы открыть представление Git

source: Modified files found! Commit them first before switching branches...
ru_ru: Найдены изменённые файлы! Зафиксируйте их перед переключением ветвей...

source: No other local branches found.
ru_ru: Другие локальные ветви не найдены.

source: Select branch (current is
ru_ru: Выберите ветвь (текущая ветвь:

source: Switch branch
ru_ru: Переключить ветвь

source: No remote branches found.
ru_ru: Удалённые ветви не найдены.

source: Select remote branch (current is
ru_ru: Выберите удалённую ветвь (текущая ветвь:

source: Branch name
ru_ru: Имя ветви

source: Specify the name for the local branch
ru_ru: Укажите имя для локальной ветви

source: Specify the name of the new branch
ru_ru: Укажите имя для новой ветви

source: Switch to new branch
ru_ru: Переключить на новую ветвь

source: Switch to new branch once it is created?
ru_ru: Переключить на новую ветвь после её создания?

source: No remotes found, can't push!
ru_ru: Удалённые репозитории не найдены, невозможно передать изменения!

source: Push all local commits?
ru_ru: Передать все локальные фиксации?

source: Save all changes and pull remote changes?
ru_ru: Сохранить все изменения и получить удалённые изменения?

source: Are you sure that you want to discard all local changes?
ru_ru: Вы уверены, что хотите отменить все локальные изменения?

source: Jump to modified file
ru_ru: Перейти к изменённому файлу

source: Modified files
ru_ru: Изменённые файлы

source: Colouring tracked git files...
ru_ru: Цветовая подсветка отслеживаемых файлов Git...

source: Colouring modified git files...
ru_ru: Цветовая подсветка изменённых файлов Git...

source: Workspace View [
ru_ru: Рабочее пространство [

source: Do you want to start importing new / updating changed files?
ru_ru: Начать импорт новых файлов или обновление изменённых?

source: Import files
ru_ru: Импорт файлов

source: Error obtaining project
ru_ru: Ошибка получения проекта

source: Checking file
ru_ru: Проверка файла

source: Adding files...
ru_ru: Добавление файлов...

source: Finished adding files...
ru_ru: Добавление файлов завершено...

source: created
ru_ru: создан

source: Merged after pull. Rebase?
ru_ru: Выполнено слияние после получения. Переместить изменения из одной ветви в другую?

source: Rebase with what branch?
ru_ru: С какой ветви переместить изменения?

source: Rebase with
ru_ru: Переместить изменения с

source: Remote git error (needs to be handled manually on the remote server)
ru_ru: Удалённая ошибка Git (требует обработки вручную на удалённом сервере)

source: Are you sure you want to continue connecting
ru_ru: Вы уверены, что хотите продолжить подключение?

source: Save all changes and rebase?
ru_ru: Сохранить все изменения и переместить их?

source: Add file
ru_ru: Добавить файл

source: Show file diff
ru_ru: Показать различия файлов

source: Show file Log
ru_ru: Показать журнал файлов

source: Show Git Blame
ru_ru: Показать git blame

source: Don't know how to start MSYSGit...
ru_ru: Не удалось запустить Git MSYS...

source: Stash
ru_ru: Скрыть изменения

source: Stash pop
ru_ru: Применить скрытые изменения и удалить их из места хранения

source: Open git bash
ru_ru: Открыть Git Bash

source: ERROR: Failed to write commit message to file:
ru_ru: ОШИБКА: не удалось записать сообщение о фиксации в файл:

source: error: no commit message given, aborting
ru_ru: ОШИБКА: сообщение о фиксации не получено, прерывание

source: All files are up-to-date!
ru_ru: Все файлы актуальны!

source: Toggle files
ru_ru: Показать или скрыть файлы

source: Show commit history
ru_ru: Показать журнал фиксаций

source: Git requires a commit message
ru_ru: Git требует сообщения о фиксации

source: Copy commit hash to clipboard
ru_ru: Копировать хеш фиксации в буфер обмена

source: Revert this commit
ru_ru: Отменить эту фиксацию

source: Are you sure you want to revert commit #
ru_ru: Вы уверены, что хотите отменить фиксацию #

source: Git executable:
ru_ru: Исполняемый файл Git:

source: Gitk executable:
ru_ru: Исполняемый файл Gitk:

source: Git Shell command:
ru_ru: Команда оболочки Git:

source: Global user name:
ru_ru: Глобальное имя пользователя:

source: Set the global user name (this name will tell git who you are)
ru_ru: Укажите глобальное имя пользователя (это имя будет сообщать Git сведения о вас)

source: Global email:
ru_ru: Глобальная электронная почта:

source: Set the global email
ru_ru: Укажите глобальную электронную почту

source: Local repository user name:
ru_ru: Имя пользователя локального репозитория:

source: Set the current repository user name (this name will tell git who you are). If this field left empty, the global one is used
ru_ru: Укажите текущее имя пользователя репозитория (это имя будет сообщать Git сведения о вас). Если оставить это поле пустым, будет использовано глобальное имя

source: Local repository email:
ru_ru: Электронная почта локального репозитория:

source: Set the current repository email If this field left empty, the global one is used
ru_ru: Укажите текущую электронную почту репозитория. Если оставить это поле пустым, будет использована глобальная электронная почта

source: Optional - Full path to project's git repo:
ru_ru: Необязательно — полный путь к репозиторию Git проекта:

source: Show Terminal
ru_ru: Показывать терминал

source: Mainly useful for Windows when the password prompt is not accessible via the UI
ru_ru: Полезно главным образом при работе в Windows, когда запрос пароля недоступен через пользовательский интерфейс

source: Verbose Logging
ru_ru: Подробное ведение журнала

source: Tick this option to enable a verbose logging of git
ru_ru: Установите этот флажок, чтобы включить подробное ведение журнала Git

source: Show commit info in the status bar
ru_ru: Показывать сведения о фиксации в строке состояния

source: Amend the previous commit
ru_ru: Исправить предыдущую фиксацию

source: The 'git commit --amend' command is a convenient way to fix up the most recent commit. It lets you combine staged changes with the previous commit instead of committing it as an entirely new snapshot. It can also be used to simply edit the previous commit message without changing its snapshot
ru_ru: Команда «git commit --amend» — это удобный способ исправить самую последнюю фиксацию. Она позволяет объединять индексированные изменения с предыдущей фиксацией, а не фиксировать их как совершенно новый снимок. Эту команду также можно использовать просто для того, чтобы отредактировать сообщение о предыдущей фиксации, не изменяя её снимок

source: Search for specific text in commits. This uses --grep, and so searches only the text of the commit message. To search by author etc, use the 'Extra arguments' box.
ru_ru: Поиск определённого текста в фиксациях. Для этого используется --grep, поэтому выполняется поиск только по тексту сообщения о фиксации. Для поиска по автору и т.д. используйте поле «Дополнительные аргументы».

source: Previous
ru_ru: Предыдущие

source: Show previous 100 commits
ru_ru: Показать предыдущие 100 фиксаций

source: Fetch the next 100 commits
ru_ru: Получить следующие 100 фиксаций

source: Optional extra arguments that you wish passed to git log. An example might be: --since="2 weeks ago" Note that this is _not_ sanity-checked, it's added just as it is
ru_ru: Необязательные дополнительные аргументы, которые следует передать git log. Например: --since=«2 недели назад» Обратите внимание, что такой аргумент _не_ проверяется на корректность, а просто добавляется как есть

source: --regexp-ignore-case Display commits that match the pattern without regard to case
ru_ru: --regexp-ignore-case отображает фиксации, соответствующие образцу, без учёта регистра

source: Date
ru_ru: Дата

source: Subject
ru_ru: Предмет

source: Modified files:
ru_ru: Изменённые файлы:

source: Commit message:
ru_ru: Сообщение о фиксации:

source: Unstaged
ru_ru: Неиндексированные

source: Staged
ru_ru: Индексированные

source: Both
ru_ru: Оба варианта

source: Show changes that are:
ru_ru: Изменения, которые следует показывать:

source: Ignore if whitespace-only
ru_ru: Игнорировать различия только в пробелах

source: Suppress any lines where the change is only to whitespace. This makes it easier to see the interesting parts of the diff.
ru_ru: Скрывать все строки, в которых изменение касается только пробелов. Благодаря этому становится проще просматривать существенные изменения.

source: Choose commits
ru_ru: Выбрать фиксации

source: This dialog normally shows only the current difference from HEAD. Click to choose any two commits to diff.
ru_ru: В этом диалоговом окне обычно отображается только текущее отличие от HEAD. Нажмите, чтобы выбрать две фиксации для сравнения.

source: Choose two commits to diff
ru_ru: Выбрать две фиксации для сравнения

source: Either select a branch, tag or commit hash, or enter your own commit-ish. Optionally you can then specify the 'n'th parent of each commit, and/or use the triple-dot notation for commits where this makes sense.
ru_ru: Выберите хеш ветви, метки или фиксации или введите собственный commit-ish. Как вариант, вы можете указать «n-й» родительский элемент каждой фиксации и/или использовать запись через троеточие для фиксаций, где это имеет смысл.

source: First
ru_ru: Первая

source: Branch
ru_ru: Ветвь

source: Here you can choose one of the last 1000 commits to diff against. They will normally be from the currently checked-out branch. However if you select a different branch above, that branch's commits will be shown instead.
ru_ru: Здесь можно выбрать одну из последней 1000 фиксаций для сравнения. Как правило, они будут относиться к текущей ветви, полученной из репозитория. Однако если выбрать другую ветвь выше, то будут показаны фиксации этой ветви.

source: Enter commit-ish
ru_ru: Ввести commit-ish

source: You can enter any valid commit-ish here. It will not be sanity-checked...
ru_ru: Здесь можно ввести любой допустимый commit-ish. Он не будет проверяться на корректность…

source: Second
ru_ru: Вторая

source: Use '...'
ru_ru: Использовать «…»

source: Check this to use the 'triple-dot' notation. The resulting diff will show the changes between the merge-base and the second commit-ish. So if the first commit-ish is 'master' and the second the branch 'foo', it will show the changes in foo since it split from master. Note that this will not make sense for all commit-ishes.
ru_ru: Установите этот флажок для использования записи через троеточие. В полученном списке различий будет показана разница между merge-base и вторым commit-ish. Таким образом, если первый commit-ish — «master», а второй — ветвь «foo», то будут показаны изменения в foo с момента отделения от master. Обратите внимание, что это будет работать не для всех commit-ish.
