Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Reached the start of the document
ru_ru: Достигнуто начало документа

source: Reached the end of the document
ru_ru: Достигнут конец документа

source: Wrapped past end of file
ru_ru: Поиск после конца файла

source: Find Prev
ru_ru: Найти ранее

source: Find All
ru_ru: Найти все

source: Replace All
ru_ru: Заменить все

source: Use case sensitive match
ru_ru: Использовать совпадение с учётом регистра

source: Regular Expression
ru_ru: Регулярное выражение

source: Use regular expression
ru_ru: Использовать регулярное выражение

source: Match a whole word
ru_ru: Слово целиком

source: Match a whole word only
ru_ru: Выбирать только слово целиком

source: Use wildcard syntax
ru_ru: Использовать синтаксис подстановочных знаков

source: Use wildcard syntax (* and ?)
ru_ru: Использовать синтаксис подстановочных знаков (* и ?)

source: Enable multiple selections
ru_ru: Включить выбор нескольких элементов

source: Select each match without de-selectiing the previous match
ru_ru: Выбирать каждое совпадение, не отменяя выбор предыдущего совпадения

source: Searching for files...
ru_ru: Поиск файлов...

source: No new or stale files found. The project is up-to-date
ru_ru: Новые или устаревшие файлы не найдены. Проект не нуждается в обновлении

source: Delete the %i selected files from the filesystem?
ru_ru: Удалить выбранные файлы (%i) из файловой системы?

source: Delete the selected file from the filesystem?
ru_ru: Удалить выбранный файл из файловой системы?

source: %i file(s) successfully deleted
ru_ru: Файлы (%i) успешно удалены

source: Virtual Directory
ru_ru: Виртуальный каталог

source: Select a directory to ignore:
ru_ru: Игнорируемый каталог:

source: Enter the filename to ignore e.g. foo*.cpp
ru_ru: Введите имя файла, которое следует игнорировать, например foo*.cpp

source: New Files
ru_ru: Новые файлы

source: Select files from the left pane and add them to the project by clicking on the right arrow button
ru_ru: Выберите файлы из левой панели и добавьте их к проекту, нажав кнопку со стрелкой вправо

source: These files have not yet been assigned a Virtual Directory. You can do this yourself by selecting one or more files and clicking the 'Forward' arrow button. A Virtual Directory selector will then appear. After your choice the selection(s) will be moved to the right-hand pane. Alternatively click the 'Wizard' button for best-guess auto-allocation.
ru_ru: Этим файлам ещё не присвоен виртуальный каталог. Вы можете сделать это сами, выбрав один или несколько файлов и нажав кнопку со стрелкой вперёд. После этого появится переключатель виртуального каталога. После выбора каталога файлы будут перемещены в правую панель. Как вариант, нажмите кнопку «Мастер» для наилучшего автораспределения.

source: Unassigned files:
ru_ru: Неприсвоенные файлы:

source: Add selected files
ru_ru: Добавить выбранные файлы

source: Remove selected files
ru_ru: Удалить выбранные файлы

source: Wherever possible, automatically allocate files to the appropriate virtual directory
ru_ru: Там, где это возможно, автоматически поместите файлы в надлежащий виртуальный каталог

source: Each file here has been assigned a Virtual Directory. If you're happy with the choice, select the file and click 'Apply'. Otherwise select the file and use the 'back' button to return it to the Unassigned Files section.
ru_ru: Каждому файлу здесь был присвоен виртуальный каталог. Если вы довольны выбором, выберите файл и нажмите «Применить». В противном случае выберите файл и нажмите кнопку «Назад», чтобы вернуть его в раздел «Неприсвоенныефайлы».

source: Assigned files:
ru_ru: Присвоенные файлы:

source: Virtual Folder
ru_ru: Виртуальная папка

source: &Apply
ru_ru: &Применить

source: A&pply All
ru_ru: П&рименить все

source: Stale Files
ru_ru: Устаревшие файлы

source: The list below contains files that exist in the project but not on the file system
ru_ru: Список ниже содержит файлы, которые существуют в проекте, но не в файловой системе

source: The files listed below are contained in the project, but no longer exist in reality. You can select individual items and delete them from the project, or use the Delete All button.
ru_ru: Упомянутые ниже файлы содержатся в проекте, но больше не существуют в действительности. Вы можете выбрать отдельные элементы и удалить их из проекта или использовать кнопку «Удалить все».

source: File path
ru_ru: Путь к файлу

source: Look for files starting with this directory:
ru_ru: Поиск файлов начиная с этого каталога:

source: Extensions to consider when looking for missing files:
ru_ru: Расширения, которые следует учитывать при поиске недостающих файлов:

source: A semi-colon separated list of extensions e.g. cpp;h;xrc If you really want to find all possible files, just add *
ru_ru: Список расширений, разделённых точкой с запятой, например cpp;h;xrc Если вам действительно необходимо найти все возможные файлы, просто добавьте *

source: Files to ignore:
ru_ru: Игнорируемые файлы:

source: Here you can add the names of any files that you want to ignore. Standard wildcards will work e.g. moc_*
ru_ru: Здесь вы можете добавить имена любых файлов, которые следует игнорировать. Допускаются стандартные подстановочные знаки, например moc_*

source: Paths to ignore:
ru_ru: Игнорируемые пути:

source: The filepaths of any folders that shouldn't be searched for missing files
ru_ru: Пути к любым папкам, в которых не следует искать недостающие файлы

source: Regexs to use (optional):
ru_ru: Регулярные выражения (необязательно):

source: Most of the time you should find that files automatically get added to the most appropriate virtual directory. If yours don't, here you can add one or more regular expressions suitable for your situation. They'll be remembered for this project.
ru_ru: В большинстве случаев вы обнаружите, что файлы автоматически добавляются в наиболее подходящий виртуальный каталог. Если это не так, вы можете добавить здесь одно или несколько регулярных выражений, подходящих для вашей ситуации. Они будут запомнены для этого проекта.

source: Enter the regex:
ru_ru: Введите регулярное выражение:

source: Destination Virtual Directory:
ru_ru: Целевой виртуальный каталог:

source: Select the virtual folder in which to place the matching files
ru_ru: Выберите виртуальную папку, в которую можно поместить соответствующие файлы

source: Browse for virtual folder
ru_ru: Выбор виртуальной папки

source: Reconcile Project
ru_ru: Согласование проекта

source: Select filetypes to reconcile
ru_ru: Выбрать типы файлов для согласования

source: Allocate by regex
ru_ru: Распределить по регулярным выражениям

source: New Symbol Name:
ru_ru: Новое имя символа:

source: Location
ru_ru: Расположение

source: Position
ru_ru: Позиция

source: &Check All
ru_ru: &Отметить все

source: Select Projects
ru_ru: Выбрать проекты

source: Select the 'rename symbol' project scope
ru_ru: Выбрать область проекта «Переименовать символ»

source: Rename Symbol
ru_ru: Переименовать символ

source: Rename Symbol Scope
ru_ru: Область переименования символа

source: Invalid C/C++ symbol name
ru_ru: Недопустимое имя символа C/C++

source: &Unmark All
ru_ru: &Снять все метки

source: Mark &All
ru_ru: Отметить &все

source: CodeLite - Replace
ru_ru: CodeLite — Заменить

source: Failed to save file:
ru_ru: Не удалось сохранить файл:

source: Failed to open file:
ru_ru: Не удалось открыть файл:

source: Type to filter the options
ru_ru: Начните ввод для фильтрации параметров

source: Function name starts with an upper case letter
ru_ru: Имя функции начинается с прописной буквы

source: Format the file when done
ru_ru: Форматировать файл, когда сделано

source: Setter returns a reference to the object
ru_ru: Метод присваивания возвращает ссылку на объект

source: A setter function will return a reference to the object, for example: Foo& SetFoo(const Obj& foo) {this->m_foo = foo; return *this;}
ru_ru: Функция присваивания вернёт ссылку на объект, например: Foo& SetFoo(const Obj& foo) {this->m_foo = foo; return *this;}

source: Generate Setters/Getters for class
ru_ru: Создать методы присваивания и считывания для класса

source: Send:
ru_ru: Отправить:

source: Send
ru_ru: Отправить

source: Enable Log
ru_ru: Включить журнал

source: Expression to watch:
ru_ru: Выражение для наблюдения:

source: New watch
ru_ru: Новое наблюдение

source: Update Watch
ru_ru: Обновить наблюдение

source: Update expression:
ru_ru: Обновить выражение:

source: Symbol
ru_ru: Символ

source: Kind
ru_ru: Вид

source: Resolve Ambiguity
ru_ru: Разрешение неоднозначности

source: CodeLite appearance:
ru_ru: Внешний вид CodeLite:

source: System default
ru_ru: Системные параметры по умолчанию

source: Force dark
ru_ru: Принудительно применить тёмный режим

source: Text selection
ru_ru: Выделение текста

source: Background:
ru_ru: Фон:

source: Foreground:
ru_ru: Текст:

source: Syntax Highlight
ru_ru: Подсветка синтаксиса

source: Global font:
ru_ru: Глобальный шрифт:

source: Set a global font for all the supported languages
ru_ru: Установите глобальный шрифт для всех поддерживаемых языков

source: Text theme:
ru_ru: Текстовое оформление:

source: Set a global theme for all the supported languages. If the theme is not available for a given language, CodeLite will use the next available theme from the same family
ru_ru: Установите глобальную тему для всех поддерживаемых языков. Если тема не доступна для данного языка, то CodeLite будет использовать следующую доступную тему из того же семейства

source: Customise colours per language
ru_ru: Настроить цвета для каждого языка

source: Available Themes:
ru_ru: Доступные темы:

source: Global Font:
ru_ru: Глобальный шрифт:

source: Use this to select a font to be used by *all* styles of this lexer
ru_ru: Используйте это меню для выбора шрифта, который будет использоваться *всеми* стилями этого лексического анализатора

source: Global background Colour:
ru_ru: Глобальный цвет фона:

source: Use this to select a background colour to be used by *all* styles of this lexer
ru_ru: Используйте это меню для выбора цвета фона, который будет использоваться *всеми* стилями этого лексического анализатора

source: File Extensions:
ru_ru: Расширения файлов:

source: Associate this lexer with files which have these extensions
ru_ru: Свяжите этот лексический анализатор с файлами, имеющими эти расширения

source: Styles
ru_ru: Стили

source: Style Font:
ru_ru: Шрифт стиля:

source: Select a font to be used with the selected style
ru_ru: Выберите шрифт, который будет использоваться с выбранным стилем

source: Foreground Colour:
ru_ru: Цвет текста:

source: Select the foreground colour for the selected style
ru_ru: Выберите цвет текста для выбранного стиля

source: Background Colour:
ru_ru: Цвет фона:

source: Select the background colour for the selected style
ru_ru: Выберите цвет фона для выбранного стиля

source: Style is EOL Filled
ru_ru: Заполнение конца строки цветом фона выбранного стиля

source: If a line ends with a character/word which has this style, the remaining of the line will be coloured with this style background colour
ru_ru: Если строка заканчивается символом или словом, имеющим этот стиль, оставшаяся часть строки будет окрашена цветом фона этого стиля

source: Styling Within Pre-processor Line
ru_ru: Стилевое оформление в пределах строки препроцессора

source: Edit Lexer Keyword Sets:
ru_ru: Изменить наборы ключевых слов лексического анализатора:

source: Set &0
ru_ru: Набор &0

source: Set &1
ru_ru: Набор &1

source: Set &2
ru_ru: Набор &2

source: Set &3
ru_ru: Набор &3

source: Set &4
ru_ru: Набор &4

source: Theme Name:
ru_ru: Имя темы:

source: Set the theme name
ru_ru: Введите имя темы

source: Make this theme for this language
ru_ru: Установите эту тему для этого языка

source: Based on Theme:
ru_ru: На основе темы:

source: Set the base theme for this new theme
ru_ru: Установите базовую тему для этой новой темы

source: Colours and Fonts
ru_ru: Цвета и шрифты

source: New Theme
ru_ru: Новая тема

source: New..
ru_ru: Создать...

source: Export..
ru_ru: Экспорт...

source: Export All
ru_ru: Экспорт всех

source: Import from ZIP file
ru_ru: Импорт из ZIP-файла

source: Import
ru_ru: Импорт

source: Applying changes...
ru_ru: Применение изменений...

source: Export Themes
ru_ru: Экспорт тем

source: Select which themes to export:
ru_ru: Темы для экспорта:

source: Are you sure you want to restore colours to factory defaults? By choosing 'Yes', you will lose all your local modifications
ru_ru: Вы уверены, что хотите восстановить цвета по умолчанию? Выбрав «Да», вы потеряете все свои локальные изменения

source: Select theme to import
ru_ru: Выбрать тему для импорта

source: Invalid file
ru_ru: Недопустимый файл

source: Failed to import theme file:
ru_ru: Не удалось импортировать файл:

source: ' imported successfully!
ru_ru: ' успешно импортирована!

source: Theme : '
ru_ru: Тема: '

source: Save as
ru_ru: Сохранить как

source: Settings have been saved into:
ru_ru: Параметры были сохранены в:

source: Select a tab group, or browse for one
ru_ru: Выберите группу вкладок или найдите нужную

source: Click to search for other groups
ru_ru: Щёлкните, чтобы найти другие группы

source: Double-click to choose one of these groups
ru_ru: Сделайте двойной щелчок для выбора одной из этих групп

source: Replace current tabs
ru_ru: Заменить текущие вкладки

source: By default, the tabs of this group will be added to the current tabs. Tick this to replace the current tabs instead.
ru_ru: По умолчанию вкладки этой группы будут добавлены к текущим вкладкам. Установите этот флажок, чтобы заменить текущие вкладки вместо этого.

source: Select which tabs you want to be in the group
ru_ru: Выберите вкладки, которые необходимо добавить в группу

source: Check All
ru_ru: Отметить все

source: Click to select all items
ru_ru: Щёлкните, чтобы выбрать все элементы

source: Click to clear all items
ru_ru: Щёлкните, чтобы отменить выбор всех элементов

source: Choose a name for the group:
ru_ru: Имя для группы:

source: Global
ru_ru: Глобально

source: Save in the current Workspace, or Globally
ru_ru: Сохранить в текущем рабочем пространстве или глобально

source: Tabgroups are usually specific to a single workspace. However if you want to use one in multiple workspaces, or when a workspace is not open, save it globally.
ru_ru: Как правило, группы вкладок относятся к одному рабочему пространству. Однако при необходимости использовать группу вкладок в нескольких рабочих пространствах или если рабочее пространство не открыто, сохраните её глобально.

source: Load a tab group
ru_ru: Загрузить группу вкладок

source: Save a tab group
ru_ru: Сохранить группу вкладок

source: Select a tab group:
ru_ru: Группа вкладок:

source: Tab groups
ru_ru: Группы вкладок

source: I'm afraid that tabgroup no longer exists :/
ru_ru: К сожалению, эта группа вкладок больше не существует :/

source: Do you want to replace the existing editors? (Say 'No' to load the new ones alongside)
ru_ru: Вы хотите заменить существующие редакторы? (Ответьте «Нет» для загрузки новых в дополнение к существующим)

source: Load the tabgroup
ru_ru: Загрузить группу вкладок

source: I'm afraid that tabgroup item no longer exists :/
ru_ru: К сожалению, этот элемент группы вкладок больше не существует :/

source: &Add a new item to this tabgroup
ru_ru: &Добавить новый элемент в эту группу вкладок

source: &Paste an item into this tabgroup
ru_ru: &Вставить элемент в эту группу вкладок

source: Du&plicate this tabgroup
ru_ru: Дуб&лировать эту группу вкладок

source: &Delete this tabgroup
ru_ru: &Удалить эту группу вкладок

source: &Copy this item, to be pasted to another tabgroup
ru_ru: &Копировать этот элемент для вставки в другую группу вкладок

source: Cu&t this item, to be pasted to another tabgroup
ru_ru: Выре&зать этот элемент для вставки в другую группу вкладок

source: &Remove this item from the tabgroup
ru_ru: &Удалить этот элемент из группы вкладок

source: There is already a file with this name. Overwrite it?
ru_ru: Уже существует файл с этим именем. Перезаписать его?

source: Overwrite?
ru_ru: Перезаписать?

source: Tabgroup renamed
ru_ru: Группа вкладок переименована

source: Select the file you want to add
ru_ru: Выберите файл, который следует добавить

source: That filepath doesn't seem to exist. Are you sure?
ru_ru: Похоже, что этот путь к файлу не существует. Вы уверены?

source: Failed to load the destination tabgroup :/
ru_ru: Не удалось загрузить целевую группу вкладок :/

source: There is already an item with this filepath in the tabgroup. Overwrite it?
ru_ru: В группе вкладок уже существует элемент с этим путём к файлу. Перезаписать его?

source: Tabgroup item pasted
ru_ru: Элемент группы вкладок вставлен

source: Delete tabgroup %s?
ru_ru: Удалить группу вкладок %s?

source: Tabgroup deleted
ru_ru: Группа вкладок удалена

source: What name to you want to give the duplicated tabgroup?
ru_ru: Какое имя вы хотите дать повторяющейся группе вкладок?

source: Duplicate a tabgroup
ru_ru: Дублировать группу вкладок

source: Sorry, there is already a tabgroup with this name
ru_ru: Группа вкладок с этим именем уже существует

source: Sorry, duplication of the tabgroup failed :/
ru_ru: Не удалось дублировать группу вкладок :/

source: Tabgroup duplicated
ru_ru: Группа вкладок продублирована

source: Tabgroup item copied
ru_ru: Элемент группы вкладок скопирован

source: Remove item %s from %s?
ru_ru: Удалить элемент %s из %s?

source: Tabgroup item Cut
ru_ru: Элемент группы вкладок вырезан

source: Tabgroup item deleted
ru_ru: Элемент группы вкладок удалён

source: Failed to amend the tabgroup :/
ru_ru: Не удалось исправить группу вкладок :/

source: Global tabgroups
ru_ru: Глобальные группы вкладок

source: Workspace tabgroups
ru_ru: Группы вкладок рабочего пространства

source: Number of items to display in the completion box:
ru_ru: Число элементов для показа в окне автозавершения кода:

source: Display type info tooltips
ru_ru: Отображать подсказки с информацией о типе

source: Display information about the hovered text
ru_ru: Отображать информацию о тексте при наведении указателя мыши

source: Display function calltip
ru_ru: Отображать подсказку при вызове функции

source: Display function argument list after typing an open brace '('
ru_ru: Отображать список аргументов функции после ввода открытой круглой скобки «(»

source: BACKSPACE triggers code completion
ru_ru: Запуск автозавершения кода клавишей Backspace

source: Deleting character will cause CodeLite to re-trigger the code completion
ru_ru: Удаление символа приведёт к тому, что CodeLite повторно запустит автозавершение кода

source: Generate compile_commands.json file
ru_ru: Создать файл compile_commands.json

source: Triggering
ru_ru: Инициирование

source: Minimum chars to type:
ru_ru: Минимальное количество символов для ввода:

source: The minimum number of characters to type in order for CodeLite to trigger code completion
ru_ru: Минимальное количество символов, которое необходимо ввести, чтобы CodeLite запустила автозавершение кода

source: Number of chars to type before showing the code completion box
ru_ru: Число символов, которые необходимо ввести перед показом окна автозавершения кода

source: Auto insert single match
ru_ru: Автоматически вставлять единственное совпадение

source: When there is only a single match don't show the code completion box but rather insert the match
ru_ru: Если имеется единственное совпадение, вставлять его, а не показывать окно автозавершения кода

source: Code Completion
ru_ru: Автозавершение кода

source: The following include paths were detected on your system and will be added to your parser search path. You may remove a path by unchecking it. You can always add/remove paths to the parser from the main menu: Settings > Tags Settings > Parser
ru_ru: Следующие пути к включаемым файлам были обнаружены в вашей системе и будут добавлены к вашему пути поиска синтаксического анализатора. Вы можете удалить путь, сняв с него флажок. С помощью главного меню можно в любое время добавлять пути в синтаксический анализатор или удалять их из него: Настройка > Параметры меток > Синтаксический анализатор

source: Add Search Paths to Code Completion Parser
ru_ru: Добавить пути поиска в синтаксический анализатор завершения кода

source: Parsing workspace...
ru_ru: Анализ рабочего пространства...

source: Tabgroups
ru_ru: Группы вкладок

source: Parsing workspace: %d%% completed
ru_ru: Анализ рабочего пространства: %d %% завершено

source: Environment sets:
ru_ru: Наборы среды:

source: By default, CodeLite uses the current active environment variables set as defined in the Settings > Environment Variables dialog. However, you may choose a different set to become the active set when this workspace is loaded selecting it here.
ru_ru: По умолчанию CodeLite использует текущий активный набор переменных среды, указанный в диалоговом окне «Переменные среды» меню «Настройка». Однако можно выбрать другой набор, который станет активным при загрузке этого рабочего пространства, указав его здесь.

source: Macros:
ru_ru: Макросы:

source: Add here macros to pass to clang when generating PCH files One macro per line
ru_ru: Добавьте здесь макросы для передачи clang при создании файлов PCH Один макрос на строке

source: Sync to Workspace File
ru_ru: Синхронизировать с файлом рабочего пространства

source: When enabled search paths folders for Code Completion will be synced between the Workspace file and the local search paths database.
ru_ru: Если флажок установлен, папки путей поиска для автозавершения кода будут синхронизироваться между файлом рабочего пространства и базой данных путей локального поиска.

source: Workspace Settings
ru_ru: Параметры рабочего пространства

source: <Use Active Set>
ru_ru: <Использовать активный набор>

source: Link Editor
ru_ru: Компоновщик

source: Collapse All
ru_ru: Свернуть все

source: Goto Active Project
ru_ru: Активный проект Goto

source: Open selected project settings. If there is no project selected, open the parent project of the selected item in the tree
ru_ru: Откройте параметры выбранного проекта. Если проект не выбран, откройте родительский проект выбранного элемента в дереве

source: Unpin Project
ru_ru: Открепить проект

source: The functions will be placed into this file
ru_ru: Функции будут помещены в этот файл

source: Recently opened workspaces
ru_ru: Последние открытые рабочие пространства

source: C++ Workspace
ru_ru: Рабочее пространство C++

source: Save Ctrl-S
ru_ru: Сохранить Ctrl-S

source: Reload File Ctrl-R
ru_ru: Перезагрузить файл Ctrl-R

source: Close Ctrl-W
ru_ru: Закрыть Ctrl-W

source: Find Ctrl-F
ru_ru: Найти Ctrl-F

source: Goto Folder:
ru_ru: Папка Goto:

source: Type the folder path
ru_ru: Введите путь к папке

source: DRAG AND DROP A FOLDER HERE
ru_ru: ПЕРЕТАЩИТЕ ПАПКУ СЮДА

source: Choose the view to use for this folder from the list below
ru_ru: Выберите представление для этой папки из списка ниже

source: Select View
ru_ru: Выбрать преставление

source: Add function implementation
ru_ru: Добавить реализацию функции

source: Open Folder
ru_ru: Открыть папку

source: Failed to load image
ru_ru: Не удалось загрузить изображение

source: Choose the icon file
ru_ru: Выбрать файл значков

source: Mac Bundler Configuration
ru_ru: Конфигурация Mac Bundler

source: Choose which target(s) to "bundle-ize"
ru_ru: Выберите цели, которые следует «объединить в пакет»

source: Generate Info.plist file
ru_ru: Создать файл Info.plist

source: Copy the following icon into the project
ru_ru: Копировать следующий значок в проект

source: Warning : applying these changes cannot be undone automatically
ru_ru: Предупреждение: применение этих изменений не может быть отменено автоматически

source: Apply changes
ru_ru: Применить изменения

source: Get Info Version String
ru_ru: Строка получения информации о версии
