Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Could not locate implementation file!
ru_ru: Не удалось определить расположение файла реализации!

source: Could not read file:
ru_ru: Не удалось прочитать файл:

source: No prototypes were found
ru_ru: Прототипы не найдены

source: 'Add Functions Implementation' can only work inside valid scope, got (
ru_ru: «Добавить реализацию функции» можно только в допустимой области, получена (

source: No un-implemented functions found
ru_ru: Нереализованные функции не найдены

source: Symbol renamed
ru_ru: Символ переименован

source: Please save the file before retagging it
ru_ru: Сохраните файл перед его повторной разметкой

source: Select file to open:
ru_ru: Файл, который следует открыть:

source: Create File
ru_ru: Создать файл

source: New File Name:
ru_ru: Имя нового файла:

source: Find Symbol
ru_ru: Найти символ

source: Go to Declaration
ru_ru: Перейти к объявлению

source: Go to Implementation
ru_ru: Перейти к реализации

source: Select core dump:
ru_ru: Дамп памяти:

source: Core dump to be opened:
ru_ru: Дамп памяти, который следует открыть:

source: Enter the full filepath of the core dump to be examined. Or, if you enter the correct working directory below, just the filename will suffice.
ru_ru: Укажите полный путь к файлу дампа памяти, требующего проверки. Если ввести корректный рабочий каталог ниже, будет достаточно указать только имя файла.

source: Corresponding executable:
ru_ru: Соответствующий исполняемый файл:

source: Enter the full filepath of the executable that crashed to cause the core dump. Or, if you enter the correct working directory below, just the filename will suffice.
ru_ru: Укажите полный путь к повреждённому исполняемому файлу, чтобы выполнить дамп памяти. Если ввести корректный рабочий каталог ниже, будет достаточно указать только имя файла.

source: Working directory (optional):
ru_ru: Рабочий каталог (необязательно):

source: Select debugger:
ru_ru: Выбрать отладчик:

source: Debug
ru_ru: Отладка

source: Debug a core dump
ru_ru: Отладка дампа памяти

source: Debugger Command
ru_ru: Команда отладчика

source: A Debugger type with that name already exists
ru_ru: Тип отладчика с таким именем уже существует

source: Displaying:
ru_ru: Отображение:

source: &Clear
ru_ru: &Очистить

source: Locals
ru_ru: Локальные переменные

source: Call Stack
ru_ru: Стек вызовов

source: Ascii Viewer
ru_ru: Средство просмотра ASCII

source: Disassemble
ru_ru: Дизассемблирование

source: &New...
ru_ru: &Создать...

source: Copy Values From:
ru_ru: Копировать значения из:

source: Make this 'PreDefined Types' set active
ru_ru: Сделать этот набор предопределённых типов активным

source: Debugger path:
ru_ru: Путь к отладчику:

source: Enable pending breakpoints
ru_ru: Включить ожидающие точки останова

source: Some breakpoints can't be applied before the program is run, or even later. This is especially a problem when trying to debug inside a library that is dynamically loaded (CodeLite itself contains examples of this). gdb has an option to 'remember' any breakpoints that it can't initially set, and automatically to set them when it becomes possible. It doesn't always work! However, tick this box to tell gdb to try.
ru_ru: Некоторые точки останова не могут быть применены до выполнения программы или ещё позже. Эта проблема особенно актуальна при попытке отладки в динамически загруженной библиотеке (сама CodeLite содержит такие примеры). В GDB есть возможность «запомнить» любые точки останова, которые он не может установить изначально, и автоматически установить их, когда это станет возможным. Это не всегда работает! Однако установите этот флажок, чтобы проверить эту функцию.

source: Apply breakpoints after main function is hit
ru_ru: Применять точки останова при достижении функции main()

source: Sometimes, some breakpoints won't apply cleanly until after main() has been reached. If this box is ticked, CodeLite won't try to apply them earlier.
ru_ru: В некоторых случаях точки останова применяются корректно только после достижения функции main(). Если установить этот флажок, то CodeLite не будет пытаться применить их раньше.

source: Automatically set breakpoint at main
ru_ru: Автоматически устанавливать точку останова на функции main

source: Every time the debugger runs, set a breakpoint at main(). You may wish to stop then anyway; but it's especially useful when you want to set breakpoints that won't 'take' earlier (however, first try enabling Pending breakpoints, or 'Apply breakpoints after main is hit'
ru_ru: При каждом запуске отладчика устанавливать точку останова на функции main(). Тогда вы сможете выполнить остановку в любом случае; но это особенно полезно, когда вам необходимо установить точки останова, которые не «сработают» раньше времени (однако сначала попробуйте включить ожидающие точки останова или используйте опцию «Применять точки останова при достижении функции main()»

source: Break when a C++ exception is thrown
ru_ru: Выполнять прерывание при возникновении исключения C++

source: Raise CodeLite when a breakpoint is hit
ru_ru: Поднимать окно CodeLite при достижении точки останова

source: Normally, when a breakpoint is hit, you'll want CodeLite to be raise to the top of the window z-order, so that you can examine values of variables etc. However you won't always want that to happen; in particular, not if the breakpoint has commands, which end in 'continue'. If so untick this box to stop it happening.
ru_ru: Обычно при достижении точки останова требуется поднять окно CodeLite, сделав его первым по z-порядку, для просмотра значений переменных и т.д. Однако в этом не всегда есть необходимость; в частности, если у точки останова есть команды, которые заканчиваются на «continue». В этом случае снимите флажок, чтобы этого не происходило.

source: On platforms that support it, run gdb as superuser
ru_ru: На платформах, которые поддерживают эту функцию, запускать GDB от имени суперпользователя

source: On platforms that support it, run gdb as superuser. This is done by running gdb with 'sudo'
ru_ru: На платформах, которые поддерживают эту функцию, запускать GDB от имени суперпользователя. Это делается путём запуска GDB с помощью команды «sudo»

source: Use default Hex Display
ru_ru: Использовать отображение в шестнадцатеричном виде по умолчанию

source: Tooltip
ru_ru: Подсказка

source: Use CTRL key to evaluate expressions under the cursor
ru_ru: Использовать клавишу CTRL для вычисления выражений под курсором

source: When enabled, codelite will evaluate the expression under the cursor only if the CTRL key is down. Otherwise, it will evaluate it automatically
ru_ru: Если флажок установлен, CodeLite будет вычислять выражение под курсором только при нажатии клавиши CTRL. В противном случае оно будет вычислено автоматически

source: Auto expand items under the cursor
ru_ru: Автоматически разворачивать элементы под курсором

source: Display
ru_ru: Вид

source: Max string size:
ru_ru: Максимальный размер строки:

source: For no limit, set it to 0
ru_ru: Если ограничение отсутствует, установите значение 0

source: Max number of elements:
ru_ru: Максимальное число элементов:

source: Use 'PreDefined types for the 'Locals' view
ru_ru: Использовать предопределённые типы для представления «Локальные переменные»

source: Auto cast 'char[]' into 'char*'
ru_ru: Автоматически преобразовывать «char[]» в «char*»

source: Enable GDB Pretty Printing
ru_ru: Включить качественную печать GDB

source: If ticked, examining the contents of e.g. std::string, wxString, wxArrayString will be much easier
ru_ru: Если флажок установлен, то просмотр содержимого, например std::string, wxString, wxArrayString, будет намного проще

source: Print object ON
ru_ru: Включить вывод фактического типа объекта

source: When displaying a pointer to an object, identify the actual (derived) type of the object rather than the declared type, using the virtual function table.
ru_ru: При показе указателя на объект определять фактический (производный) тип объекта, а не объявленный тип, используя таблицу виртуальных функций.

source: Use file name only for breakpoints (NO full paths)
ru_ru: Использовать только имя файла для точек останова (БЕЗ полных путей)

source: Enable full debugger logging
ru_ru: Включить полное ведение журнала отладчика

source: Show debugger terminal
ru_ru: Показывать терминал отладчика

source: Max number of frames to allow in a call-stack
ru_ru: Макс. число кадров в стеке вызовов

source: The maximum number of frames that CodeLite will display in the Call Stack tab. This protects against a very long hang while trying to show 100,000 frames in an infinite recursion situation.
ru_ru: Максимальное количество кадров, которые CodeLite будет отображать во вкладке стека вызовов. Это защищает от очень долгого зависания при попытке отобразить 100 000 кадров в ситуации бесконечной рекурсии.

source: Break at assertion failure (MinGW only)
ru_ru: Выполнять прерывание при сбое проверочного утверждения (только для MinGW)

source: Cygwin path conversion command:
ru_ru: Команда преобразования пути Cygwin:

source: Set here the command to use in order to convert cygwin paths into native Windows paths (use $(File) as a place holder for the file name)
ru_ru: Задайте здесь команду, которую следует использовать для преобразования путей Cygwin в собственные пути Windows (используйте $(File) в качестве заполнителя для имени файла)

source: &New
ru_ru: &Создать

source: Create new 'PreDefined' set
ru_ru: Создать новый набор предопределённых типов

source: Delete the currently selected set
ru_ru: Удалить текущий выбранный набор

source: Available sets:
ru_ru: Доступные наборы:

source: Current function:
ru_ru: Текущая функция:

source: Register
ru_ru: Зарегистрировать

source: Debugger Settings
ru_ru: Параметры отладчика

source: Create a new 'PreDefined Types' set...
ru_ru: Создать новый набор предопределённых типов...

source: You are about to delete 'PreDefined Types' set '%s' Continue ?
ru_ru: Вы собираетесь удалить набор предопределённых типов «%s». Продолжить?

source: Confirm deleting 'PreDefined Types' set
ru_ru: Подтвердить удаление набора предопределённых типов

source: A set with this name already exist
ru_ru: Набор с этим именем уже существует

source: Name Already Exists
ru_ru: Имя уже существует

source: GNU gdb debugger
ru_ru: Отладчик GNU GDB

source: Startup Commands
ru_ru: Команды запуска

source: Pre-Defined Types
ru_ru: Предопределённые типы

source: Below is a list of the 'annoying' dialogs answers, you can modify the answer of a dialog by checking / unchecking the saved answer
ru_ru: Ниже приведён список «нежелательных» ответов диалоговых окон. Вы можете изменить ответ диалогового окна, установив или сняв флажок с сохранённого ответа

source: &Rename
ru_ru: &Переименовать

source: Enter New Name:
ru_ru: Введите новое имя:

source: Rename
ru_ru: Переименовать

source: Remove configuration '
ru_ru: Удалить конфигурацию '

source: Edit Configurations
ru_ru: Изменить конфигурации

source: &Close
ru_ru: &Закрыть

source: Remove workspace configuration '
ru_ru: Удалить конфигурацию рабочего пространства '

source: New Configuration Name:
ru_ru: Новое имя конфигурации:

source: Edit Workspace Configuration
ru_ru: Изменить конфигурацию рабочего пространства

source: Find
ru_ru: Найти

source: Indentation settings
ru_ru: Параметры отступа

source: Disable Smart Indentation
ru_ru: Отключить автоматическое добавление отступа

source: Use tabs
ru_ru: Использовать табуляцию

source: Columns per indentation level
ru_ru: Столбцов для каждого уровня отступа

source: Tab width
ru_ru: Ширина табуляции

source: Trim lines
ru_ru: Обрезать строки

source: Enable trim on save
ru_ru: Обрезать при сохранении

source: Do not trim the caret line
ru_ru: Не обрезать текущую строку

source: Trim modified lines only
ru_ru: Обрезать только изменённые строки

source: If missing, append EOL at the end of file
ru_ru: Если отсутствует, добавлять конец строки в конце файла

source: Symbol margin
ru_ru: Поле символа

source: Display the symbol margin
ru_ru: Отображать поле символа

source: Shape
ru_ru: Форма

source: colour
ru_ru: (цвет закладки)

source: label
ru_ru: (метка закладки)

source: Highlight matches
ru_ru: Подсветка совпадений

source: Colour
ru_ru: Цвет

source: Find/Find Next clears highlit matching words
ru_ru: Найти/Найти далее очищает подсветку совпадающих слов

source: Caret blink period
ru_ru: Интервал мигания курсора

source: Caret width
ru_ru: Ширина курсора

source: Use block caret
ru_ru: Использовать блочный курсор

source: Allow caret to scroll beyond end of file
ru_ru: Разрешить прокрутку курсора за пределами конца файла

source: Allow caret to be placed beyond the end of line
ru_ru: Разрешить установку курсора за пределами конца строки

source: Caret jumps between word segments
ru_ru: Переход курсора между сегментами слова

source: Auto-adjust horizontal scrollbar width
ru_ru: Автокорректировка ширины горизонтальной полосы прокрутки

source: Comments
ru_ru: Комментарии

source: Hitting ENTER in C comment, adds `*`
ru_ru: Нажатие клавиши «Ввод» в комментарии C добавляет символ «*»

source: Hitting ENTER in C++ comment, adds `//`
ru_ru: Нажатие клавиши «Ввод» в комментарии C++ добавляет символ «//»

source: Code navigation shortcut is: Mouse left button and:
ru_ru: Комбинация клавиш навигации по коду: левая кнопка мыши и:

source: Control Key
ru_ru: Клавиша Ctrl

source: Alt Key
ru_ru: Клавиша Alt

source: Generated doc comments
ru_ru: Комментарии к создаваемым документам

source: Class template
ru_ru: Шаблон класса

source: Function template
ru_ru: Шаблон функции

source: Auto generate on ENTER
ru_ru: Создавать автоматически при нажатии клавиши «Ввод»

source: Use Qt style docs
ru_ru: Использовать документацию в стиле Qt

source: Tabs
ru_ru: Вкладки

source: Height
ru_ru: Высота

source: Workspace tabs orientation
ru_ru: Расположение вкладок области рабочего пространства

source: Output tabs orientation
ru_ru: Расположение вкладок области вывода

source: Show close button on tabs
ru_ru: Показывать кнопку закрытия на вкладках

source: Show file path on tab label
ru_ru: Показать путь к файлу на метке вкладки

source: Mouse scroll switch bewtween tabs
ru_ru: Переключение между вкладками прокруткой мыши

source: Sort tab file list
ru_ru: Сортировать список вкладок в алфавитном порядке

source: Use Ctrl+TAB to switch tabs
ru_ru: Использовать Ctrl+Tab для переключения между вкладками

source: Hide main tab bar
ru_ru: Не показывать основную панель вкладок

source: Find in files
ru_ru: Поиск в файлах

source: Don't automatically fold search results
ru_ru: Не свёртывать результаты поиска автоматически

source: When searching, don't override search string with current selection
ru_ru: При поиске не заменять строку поиска текущим выделенным фрагментом

source: Folding
ru_ru: Свёртывание

source: Show folding margin
ru_ru: Показывать поле свёртывания

source: Appearance
ru_ru: Внешний вид

source: Folding options
ru_ru: Параметры свёртывания

source: Underline folded line
ru_ru: Подчёркивать свёрнутую строку

source: Fold `else` blocks
ru_ru: Свернуть блоки «else»

source: Fold pre-processor blocks
ru_ru: Свёртывать блоки препроцессора

source: Fold compact
ru_ru: Свёртывать компактно

source: Highlight active fold block
ru_ru: Подсвечивать активный свёртываемый блок

source: Workspace local editor preferences
ru_ru: Локальные параметры редактора рабочего пространства

source: Project local editor preferences
ru_ru: Локальные параметры редактора проекта

source: Indentation only
ru_ru: Только добавление отступа

source: Local Preferences
ru_ru: Локальные параметры

source: Indentation
ru_ru: Добавление отступа

source: Use global setting
ru_ru: Использовать глобальные параметры

source: Use tabs in indentation
ru_ru: Использовать табуляцию при добавлении отступа

source: If clear, only spaces will be used for indentation. If set, a mixture of tabs and spaces will be used.
ru_ru: Если флажок не установлен, то для добавления отступа будут использоваться только пробелы. Если флажок установлен, будет использоваться сочетание табуляции и пробелов.

source: Columns per tab character in document:
ru_ru: Столбцов на символ табуляции в документе:

source: Columns per indentation level:
ru_ru: Столбцов на уровень отступа:

source: Margins
ru_ru: Поля

source: Display Breakpoints / Bookmarks margin
ru_ru: Отображать поле точек останова/закладок

source: Display Folding margin
ru_ru: Отображать поле свёртывания

source: Display the margin that lets you 'fold' individual functions, or sections of functions, to hide their contents
ru_ru: Отображать поле, которое позволяет «сворачивать» отдельные функции или разделы функций, чтобы скрыть их содержимое

source: Track modified lines in the editor
ru_ru: Отслеживать изменённые строки в редакторе

source: Track modified lines in the editor by colouring them with a distinct colour
ru_ru: Отслеживать изменённые строки в редакторе, окрашивая их в определённый цвет

source: Display line numbers margin
ru_ru: Отображать поле номеров строк

source: Show indentation guidelines
ru_ru: Показывать направляющие отступов

source: Display horizontal guides for matching braces "{"
ru_ru: Отображать горизонтальные направляющие для парных фигурных скобок «{»

source: Highlight caret line
ru_ru: Подсвечивать текущую строку

source: Set a different background colour for the line containing the caret
ru_ru: Установить другой цвет фона для текущей строки

source: When saving files, trim empty lines
ru_ru: При сохранении файлов обрезать пустые строки

source: If missing, append EOL at end of file
ru_ru: Если отсутствует, добавлять конец строки в конце файла

source: Make sure the file finishes with an end-of-line
ru_ru: Убедитесь, что файл заканчивается концом строки

source: Whitespace visibility:
ru_ru: Видимость пробелов:

source: EOL Mode:
ru_ru: Режим конца строки:

source: Set the editor's EOL mode (End Of Line). When set to 'Default' CodeLite will set the EOL according to the hosting OS
ru_ru: Установить режим конца строки редактора. При установке значения «По умолчанию» CodeLite будет устанавливать конец строки в соответствии с параметрами хостинговой ОС

source: File font encoding
ru_ru: Кодировка шрифта файла

source: Allow only single instance
ru_ru: Разрешать только один экземпляр

source: Web search URL
ru_ru: URL-адрес поиска в Интернете

source: Use Direct2D editor drawings
ru_ru: Использовать изображения редактора Direct2D

source: Frame title
ru_ru: Заголовок фрейма

source: Startup
ru_ru: Запуск

source: Check for new version on startup
ru_ru: Проверять наличие новой версии при запуске

source: Only prompt for stable releases
ru_ru: Запрашивать только стабильные выпуски

source: Load last session on startup
ru_ru: Загружать последний сеанс при запуске

source: Show splashscreen
ru_ru: Показывать заставку при запуске

source: Status bar
ru_ru: Строка состояния

source: Show current line number
ru_ru: Показывать номер текущей строки

source: Show current column
ru_ru: Показывать текущий столбец

source: Show current position
ru_ru: Показывать текущую позицию

source: Show file length
ru_ru: Показывать длину файла

source: Show number of selected chars
ru_ru: Показывать число выбранных символов

source: Tool bar
ru_ru: Панель инструментов

source: Space between button groups
ru_ru: Расстояние между группами кнопок

source: Locale
ru_ru: Региональные настройки

source: File text encoding
ru_ru: Кодировка текста файла

source: Enable localization
ru_ru: Включить локализацию

source: Locale to use
ru_ru: Используемые региональные настройки

source: Log file verbosity
ru_ru: Уровень детализации файлов журнала

source: Redirect stdout/stderr to file
ru_ru: Перенаправлять stdout/stderr в файл

source: History
ru_ru: Журнал

source: Clear
ru_ru: Очистить

source: Forget recent workspaces and files
ru_ru: Забывать последнее рабочее пространство и файлы

source: Success!
ru_ru: Успешно!

source: Reset annoying dialogs answers
ru_ru: Сбрасывать нежелательные ответы диалоговых окон

source: Terminals
ru_ru: Терминалы

source: Choose your terminal
ru_ru: Выбрать терминал

source: C&lear All
ru_ru: О&чистить все

source: Some files were modified outside of the editor. What would you like to do?
ru_ru: Некоторые файлы были изменены вне редактора. Что вы хотите сделать?

source: Reload all the externally modified files
ru_ru: Перезагрузить все файлы, изменённые внешней программой

source: Reload.
ru_ru: Перезагрузить.

source: Choose.
ru_ru: Выбрать.

source: Let me choose which file or files to reload
ru_ru: Позволить мне выбрать файл или файлы для перезагрузки

source: Don't reload any the externally modified files
ru_ru: Не перезагружать файлы, изменённые внешней программой

source: Ignore.
ru_ru: Игнорировать.

source: Remember my answer
ru_ru: Запомнить ответ

source: Select Files
ru_ru: Выбрать файлы

source: Files were modified outside the editor
ru_ru: Файлы были изменены вне редактора

source: Open folder
ru_ru: Открыть папку

source: File Explorer
ru_ru: Проводник

source: Select folder to open
ru_ru: Выбрать папку, которую следует открыть

source: Set Custom Background Colour...
ru_ru: Установить пользовательский цвет фона…

source: Add Existing Item
ru_ru: Добавить существующий элемент

source: New Item
ru_ru: Новый элемент

source: Are you sure you want remove '
ru_ru: Вы уверены, что хотите удалить '

source: Remember my answer and apply it all files
ru_ru: Запомнить ответ и применить ко всем файлам

source: Are you sure?
ru_ru: Вы уверены?

source: ' from disc?
ru_ru: ' с диска?

source: Do you also want to delete the file '
ru_ru: Вы хотите также удалить файл '

source: No
ru_ru: Нет

source: Yes
ru_ru: Да

source: An error occurred during file removal. Maybe it has been already deleted or you don't have the necessary permissions
ru_ru: Произошла ошибка во время удаления файла. Возможно, он был уже удалён или у вас нет необходимых разрешений

source: and all its contents will be removed from the project.
ru_ru: и всё её содержимое будут удалены из проекта.

source: You are about to remove project '
ru_ru: Вы собираетесь удалить проект '

source: from the workspace, click 'Yes' to proceed or 'No' to abort.
ru_ru: из рабочего пространства. Нажмите «Да» для продолжения или «Нет» для прерывания.

source: of project
ru_ru: из проекта

source: Compiling file:
ru_ru: Компиляция файла:

source: Preprocessing file:
ru_ru: Предобработка файла:

source: in FileView.
ru_ru: в FileView.

source: Failed to find file:
ru_ru: Не удалось найти файл:

source: Importing files ...
ru_ru: Импорт файлов...

source: Adding file:
ru_ru: Добавление файла:

source: New file name:
ru_ru: Имя нового файла:

source: Rename file:
ru_ru: Переименовать файл:

source: A File with that name already exists!
ru_ru: Файл с этим именем уже существует!

source: New virtual folder name:
ru_ru: Новое имя виртуальной папки:

source: Rename virtual folder:
ru_ru: Переименовать виртуальную папку:

source: , reason: could not locate project
ru_ru: , причина: не удалось определить расположение проекта

source: failed to rename virtual folder:
ru_ru: не удалось переименовать виртуальную папку:

source: Project new name:
ru_ru: Имя нового проекта:

source: Rename project
ru_ru: Переименовать проект

source: A project with this name already exists in the workspace
ru_ru: Проект с этим именем уже существует в рабочем пространстве

source: Project names may contain only the following characters [a-z0-9_-]
ru_ru: Названия проекта могут содержать только следующие символы [a-z0-9_-]

source: You can only drag one folder at a time
ru_ru: Вы можете перетащить только одну папку за один раз

source: Can't import files to workspace without projects
ru_ru: Невозможно импортировать файлы в рабочее пространство без проектов

source: Import files to project
ru_ru: Импортировать файлы в проект
