Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Unable to create a workspace on the root folder
ru_ru: Не удалось создать рабочее пространство в корневой папке

source: Workspace Name
ru_ru: Имя рабочего пространства

source: Successfully generated file:
ru_ru: Успешно создан файл:

source: Choosing 'Yes' will delete workspace configuration '
ru_ru: Если выбрать «Да», то будет удалена конфигурация рабочего пространства '

source: Continue?
ru_ru: Продолжить?

source: Program:
ru_ru: Программа:

source: File extensions:
ru_ru: Расширения файлов:

source: Set the file extensions to be parsed in this workspace
ru_ru: Укажите расширения файлов, анализ которых следует выполнять в этом рабочем пространстве

source: Exclude files:
ru_ru: Исключить файлы:

source: Files matching this pattern will not be displayed in the tree view
ru_ru: Файлы, соответствующие этому шаблону, не будут отображаться в древовидном представлении

source: Exclude paths:
ru_ru: Исключить пути:

source: Add here list of paths to be ignored. The path is expected to be relative to the root folder of the workspace Ignored paths will still be visible in the tree, but they will not be used in workspace operations (find in files, code completion etc)
ru_ru: Добавьте здесь список игнорируемых путей. Предполагается, что путь будет указан относительно корневой папки рабочего пространства. Игнорируемые пути будут по-прежнему отображаться в дереве, но не будут использоваться в операциях рабочего пространства (поиск в файлах, автозавершение кода и т.д.)

source: Tool chain:
ru_ru: Цепочка инструментов:

source: Select the toolchain to use
ru_ru: Выбрать цепочку инструментов

source: Target Name
ru_ru: Имя цели

source: Path to debugger executable Leave empty to use the defaults
ru_ru: Путь к исполняемому файлу отладчика. Оставьте поле пустым, чтобы использовать значение по умолчанию

source: Append the content here to the startup script, such as ~/.gdbinit
ru_ru: Добавьте здесь содержимое в сценарий загрузки, например ~/.gdbinit

source: Place your build flags one-per-line here
ru_ru: Поместите здесь флаги сборки по одному в строке

source: Place your build flags one-per-line here. For example: -I/home/eran/include -I/home/eran/wx/include -DSOME=1 These flags will be used by CodeLite for better code completion
ru_ru: Поместите здесь флаги сборки по одному в строке. Например: -I/home/eran/include -I/home/eran/wx/include -DSOME=1 Эти флаги будут использоваться CodeLite для улучшения автозавершения кода

source: Environment variables:
ru_ru: Переменные среды:

source: Remote
ru_ru: Удалённый

source: Enable remote development
ru_ru: Включить удалённую разработку

source: Remote folder:
ru_ru: Удалённая папка:

source: Use remote build
ru_ru: Использовать удалённую сборку

source: Execute the build commands on the remote machine
ru_ru: Выполнять команды сборки на удалённом компьютере

source: Workspace path:
ru_ru: Путь к рабочему пространству:

source: Workspace name:
ru_ru: Имя рабочего пространства:

source: Copy from:
ru_ru: Копировать из:

source: Create workspace
ru_ru: Создать рабочее пространство

source: New Configurtion
ru_ru: Создать конфигурацию

source: Build active project
ru_ru: Сборка активного проекта

source: Stop current build
ru_ru: Остановить текущую сборку

source: Add path to code completion
ru_ru: Добавить путь к автозавершению кода

source: Generate compile_flags.txt file...
ru_ru: Создать файл compile_flags.txt...

source: Exclude this folder
ru_ru: Исключить эту папку

source: Current Tab > Close Tabs To The Right
ru_ru: Текущая вкладка > Закрыть вкладки справа

source: Current Tab > Close Other Tabs
ru_ru: Текущая вкладка > Закрыть другие вкладки

source: Current Tab > Duplicate Tab
ru_ru: Текущая вкладка > Дублировать вкладку

source: Current Tab > Make it Read Only
ru_ru: Текущая вкладка > Сделать доступной только для чтения

source: Current Tab > Detach
ru_ru: Текущая вкладка > Отсоединить

source: Current Tab > Open Shell Here
ru_ru: Текущая вкладка > Открыть командный интерпретатор здесь

source: Current Tab > Open in File Explorer
ru_ru: Текущая вкладка > Открыть в проводнике

source: Current Tab > Copy file name
ru_ru: Текущая вкладка > Копировать имя файла

source: Current Tab > Copy fullpath (name, extension and directory)
ru_ru: Текущая вкладка > Копировать полный путь (имя, расширение и каталог)

source: Current Tab > Copy Path only (directory part only)
ru_ru: Текущая вкладка > Копировать только путь (только часть с каталогом)

source: Current Tab > Copy full path relative to workspace
ru_ru: Текущая вкладка > Копировать полный путь относительно рабочего пространства

source: Replace In Selection
ru_ru: Заменить в выделенном фрагменте

source: No match found
ru_ru: Совпадений не найдено

source: result
ru_ru: результат

source: results
ru_ru: результатов

source: Found and replaced
ru_ru: Найдено и заменено совпадений:

source: Property Name
ru_ru: Имя свойства

source: Property Value
ru_ru: Значение свойства

source: Choose a number
ru_ru: Выбрать номер

source: Could not find SSH account:
ru_ru: Не удалось найти учётную запись SSH:

source: Could not locate ssh executable
ru_ru: Не удалось определить расположение исполняемого файла SSH

source: Download and Open Containing Folder...
ru_ru: Загрузить и открыть содержащую папку...

source: Create a new directory...
ru_ru: Создать новый каталог...

source: Create a new folder
ru_ru: Создать новую папку...

source: New folder name
ru_ru: Имя новой папки

source: Create a new file...
ru_ru: Создать новый файл...

source: Create a new file
ru_ru: Создать новый файл

source: New file name
ru_ru: Имя нового файла

source: Copy path
ru_ru: Копировать путь

source: Path copied to clipboard
ru_ru: Путь скопирован в буфер обмена

source: New name:
ru_ru: Новое имя:

source: Renaming
ru_ru: Переименование

source: Are you sure you want to delete the selected items?
ru_ru: Вы уверены, что хотите удалить выбранные элементы?

source: No such directory
ru_ru: Нет такого каталога

source: Can not set new root directory:
ru_ru: Не удалось указать новый корневой каталог:

source: Inspect Variable
ru_ru: Проверка переменной

source: saved
ru_ru: сохранён

source: SFTP error: failed to save file.
ru_ru: Ошибка SFTP: не удалось сохранить файл.

source: Select Symbol
ru_ru: Выбрать символ

source: Build ended with errors Click to view
ru_ru: Сборка завершилась с ошибками. Щёлкните для просмотра

source: Build ended with warnings Click to view
ru_ru: Сборка завершилась с предупреждениями Щёлкните для просмотра

source: Build is in progress Click to view the Build Log
ru_ru: Выполняется сборка. Щёлкните для просмотра журнала сборки

source: Language
ru_ru: Язык

source: Colour Themes
ru_ru: Цветовые темы

source: Convert Indentations to Tabs
ru_ru: Преобразовать отступ в шаги табуляции

source: Convert Indentations to Spaces
ru_ru: Преобразовать отступ в пробелы

source: Use Tabs
ru_ru: Использовать табуляцию

source: Use Spaces
ru_ru: Использовать пробелы

source: Use Linux Format (LF)
ru_ru: Использовать формат Linux (LF)

source: Use Windows Format (CRLF)
ru_ru: Использовать формат Windows (CRLF)

source: Convert to Linux Format
ru_ru: Преобразовать в формат Linux

source: Set Syntax:
ru_ru: Синтаксис:

source: Select Theme:
ru_ru: Тема:

source: Tasks
ru_ru: Задачи

source: Trace
ru_ru: Трассировка

source: References
ru_ru: Ссылки

source: Showing entries from:
ru_ru: Показываются записи из:

source: entries
ru_ru: (всего записей)

source: Message
ru_ru: Сообщение

source: Customise...
ru_ru: Настроить…

source: Fold Tree
ru_ru: Свернуть дерево

source: Folders
ru_ru: Папки

source: New Folder
ru_ru: Новая папка

source: Find in Files
ru_ru: Найти в файлах

source: Open with default application
ru_ru: Открыть в приложении по умолчанию

source: Open Folder...
ru_ru: Открыть папку...

source: Set the file name:
ru_ru: Имя файла:

source: Set the folder name:
ru_ru: Имя папки:

source: New Name:
ru_ru: Новое имя:

source: Rename File
ru_ru: Переименовать файл

source: Rename folder
ru_ru: Переименовать папку

source: Type the new folder name:
ru_ru: Новое имя папки:

source: Cant find project:
ru_ru: Не удалось найти проект:

source: Sorry, there is no 'Clean' command available
ru_ru: Нет доступной команды «Очистить»

source: Sorry, couldn't find the Build configuration
ru_ru: Не удалось найти конфигурацию сборки

source: , process terminated with exit code: 0
ru_ru: , процесс завершён с кодом выхода: 0

source: Failed to start clean process, command:
ru_ru: Не удалось запустить процесс очистки, команда:

source: The following environment variables are used in the project, but are not defined:
ru_ru: Следующие переменные среды используются в проекте, но не определены:

source: Build anyway?
ru_ru: Всё равно выполнить сборку?

source: Build Cancelled!
ru_ru: Сборка отменена!

source: Command line is empty. Build aborted.
ru_ru: Командная строка пуста. Сборка прервана.

source: Failed to start build process, command:
ru_ru: Не удалось запустить процесс сборки, команда:

source: Console
ru_ru: Консоль

source: Interrupted
ru_ru: Прервано

source: MESSAGE: Entering directory `%s'
ru_ru: СООБЩЕНИЕ: вход в каталог «%s»

source: Browse for folder...
ru_ru: Выбор папки...

source: Select a folder:
ru_ru: Папка:

source: Subversion
ru_ru: Модуль Subversion

source: CScope
ru_ru: Модуль CScope

source: Git
ru_ru: Модуль Git

source: Select a file:
ru_ru: Файл:

source: Available Macros
ru_ru: Доступные макросы

source: Copy macro name
ru_ru: Копировать имя макроса

source: Macro
ru_ru: Макрос

source: Expands to the selected text in the active editor
ru_ru: При развёртывании отображается выбранный текст в активном редакторе

source: Expands to the selected text range in bytes from beginning of file, eg. 150:200
ru_ru: При развёртывании отображается выбранный текстовый диапазон в байтах с начала файла, например 150:200

source: Expands to the project binary output file
ru_ru: При развёртывании отображается двоичный выходной файл проекта

source: Expands to the project's build working directory
ru_ru: При развёртывании отображается рабочий каталог сборки проекта

source: Expands to the project's run working directory
ru_ru: При развёртывании отображается рабочий каталог выполнения проекта

source: Expands to project's path
ru_ru: При развёртывании отображается путь к проекту

source: Expands to workspace's path
ru_ru: При развёртывании отображается путь к рабочему пространству

source: Expands to the workspace selected configuration
ru_ru: При развёртывании отображается выбранная конфигурация рабочего пространства

source: Expands to the current project name as appears in the 'File View'
ru_ru: При развёртывании отображается имя текущего проекта, которое указано в представлении файлов

source: Expands to the current project intermediate directory path, as set in the project settings
ru_ru: При развёртывании отображается путь к промежуточному каталогу текущего проекта, который указан в параметрах проекта

source: Expands to the current project selected configuration
ru_ru: При развёртывании отображается выбранная конфигурация текущего проекта

source: An alias to $(IntermediateDirectory)
ru_ru: Псевдоним для $(IntermediateDirectory)

source: Expands to current file name (without extension and path)
ru_ru: При развёртывании отображается имя текущего файла (без расширения и пути)

source: Expands to current file path
ru_ru: При развёртывании отображается путь к текущему файлу

source: Expands to current file full path (path and full name)
ru_ru: При развёртывании отображается полный путь к текущему файлу (путь и полное имя)

source: Expands to current file full name (name and extension)
ru_ru: При развёртывании отображается полное имя текущего файла (имя и расширение)

source: Expands to logged-in user as defined by the OS
ru_ru: При развёртывании отображается вошедший в систему пользователь, определённый ОС

source: Expands to current date
ru_ru: При развёртывании отображается текущая дата

source: Expands to CodeLite's startup directory on (e.g. on Unix it expands to ~/.codelite/)
ru_ru: При развёртывании отображается каталог запуска CodeLite в системе (например, в Unix при развёртывании отображается ~/.codelite/)

source: A space delimited string containing all of the project files in a relative path to the project file
ru_ru: Разделённая пробелами строка, содержащая все файлы проекта по относительному пути

source: A space delimited string containing all of the project files in an absolute path
ru_ru: Разделённая пробелами строка, содержащая все файлы проекта по абсолютному пути

source: backticks: evaluates the expression inside the backticks into a string
ru_ru: обратные кавычки: вычисляет выражение в обратных кавычках в строке

source: The directory part of $(OutputFile)
ru_ru: Часть с каталогом $(OutputFile)

source: The output file
ru_ru: Выходной файл

source: The program to run
ru_ru: Запускаемая программа

source: Expands to the compiler name as set in the Tools tab
ru_ru: При развёртывании отображается имя компилятора, которое указано на вкладке «Сервис»

source: Expands to the source switch (usually, -c)
ru_ru: При развёртывании отображается переключатель источника (обычно -c)

source: The file full path (includes path+name+extension)
ru_ru: Полный путь к файлу (включает путь+имя+расширение)

source: The file full name (includes name+extension)
ru_ru: Полное имя файла (включает имя+расширение)

source: The file name (name only)
ru_ru: Имя файла (только имя)

source: The file's path with UNIX slashes, including terminating separator
ru_ru: Путь к файлу со знаками косой черты UNIX, включая завершающий разделитель

source: Expands to the compiler options as set in the project settings
ru_ru: При развёртывании отображаются параметры компилятора, установленные в параметрах проекта

source: Expands to the resource compiler name
ru_ru: При развёртывании отображается имя компилятора ресурсов

source: Expands to the linker name as set in the Tools tab
ru_ru: При развёртывании отображается имя компоновщика, которое указано на вкладке «Сервис»

source: Expands to the archive tool (e.g. ar) name as set in the Tools tab
ru_ru: При развёртывании отображается имя архиватора (например, ar), которое указано на вкладке «Сервис»

source: Expands to the shared object linker name as set in the Tools tab
ru_ru: При развёртывании отображается имя компоновщика общих объектов, которое указано на вкладке «Сервис»

source: Objects suffix (usually set to .o)
ru_ru: Суффикс объектов (обычно заданный как .o)

source: The object name (without the suffix)
ru_ru: Имя объекта (без суффикса)

source: Objects suffix (usually set to .o.d)
ru_ru: Суффикс объектов (обычно заданный как .o.d)

source: Objects suffix (usually set to .o.i)
ru_ru: Суффикс объектов (обычно заданный как .o.i)

source: The compiler include switch
ru_ru: Переключатель компилятора для включения файлов

source: The library switch (e.g. -l)
ru_ru: Переключатель библиотеки (например, -l)

source: The output switch (e.g. -o)
ru_ru: Переключатель вывода (например, -o)

source: Library switch (e.g. -L)
ru_ru: Переключатель библиотеки (например, -L)

source: Preprocessor switch (e.g. -D)
ru_ru: Переключатель препроцессора (например, -D)

source: Expands to all preprocessors set in the project setting where each entry is prefixed with $(PreprocessorSwitch)
ru_ru: При развёртывании отображаются все препроцессоры, заданные в параметрах проекта, где каждая запись имеет префикс $(PreprocessorSwitch)

source: Archive switch, usually not needed (VC compiler sets it to /OUT:)
ru_ru: Архивный переключатель, обычно ненужный (компилятор VC устанавливает его в /OUT:)

source: The compiler preprocess-only switch (e.g. -E)
ru_ru: Переключатель компилятора «только предварительная обработка» (например, -E)

source: The linker options as set in the project settings
ru_ru: Параметры компоновщика, установленные в параметрах проекта

source: All include paths prefixed with $(IncludeSwitch)
ru_ru: Все пути поиска включаемых файлов с префиксом $(IncludeSwitch)

source: Resource compiler include path as set in the project settings
ru_ru: Путь поиска включаемых файлов компилятора ресурсов, который указан в параметрах проекта

source: List of libraries to link with. Each library is prefixed with $(LibrarySwitch)
ru_ru: Список библиотек, с которыми необходимо установить связь. Каждая библиотека имеет префикс $(LibrarySwitch)

source: List of library paths to link with. Each library is prefixed with $(LibraryPathSwitch)
ru_ru: Список путей к библиотекам, с которыми необходимо установить связь. Каждая библиотека имеет префикс $(LibraryPathSwitch)

source: The directory part of $(ProjectOutputFile)
ru_ru: Часть с каталогом $(ProjectOutputFile)

source: The output file, same as $(ProjectOutputFile)
ru_ru: Выходной файл, совпадает с $(ProjectOutputFile)

source: Invalid memory value: %s
ru_ru: Недопустимое значение памяти: %s

source: Address:
ru_ru: Адрес:

source: Address or pointer to watch
ru_ru: Адрес или указатель для наблюдения

source: Size:
ru_ru: Размер:

source: Memory size to view
ru_ru: Объём памяти для просмотра

source: Number of columns:
ru_ru: Число столбцов:

source: Number of columns to use per row
ru_ru: Число столбцов в строке

source: Evaluate
ru_ru: Вычислить

source: Evaluate the expression in the "Address" field
ru_ru: Вычислить выражение в поле «Адрес»

source: Update
ru_ru: Обновить

source: Update the memory in the main display area to apply your changes
ru_ru: Обновите память в основной области отображения, чтобы применить ваши изменения

source: Project name:
ru_ru: Имя проекта:

source: Give a name to the template
ru_ru: Присвойте имя шаблону

source: Project category:
ru_ru: Категория проекта:

source: Choose a category for this template
ru_ru: Выберите категорию для этого шаблона

source: Set a description to this template
ru_ru: Установите описание для этого шаблона

source: Save Project As Template
ru_ru: Сохранить проект как шаблон

source: DEL
ru_ru: Удалить (DEL)

source: DELETE
ru_ru: Удалить (DELETE)

source: BACK
ru_ru: Назад (BACK)

source: INS
ru_ru: Вставка (INS)

source: ENTER
ru_ru: Ввод (ENTER)

source: RETURN
ru_ru: Ввод (RETURN)

source: PGUP
ru_ru: На страницу вверх (PGUP)

source: PGDN
ru_ru: На страницу вниз (PGDN)

source: LEFT
ru_ru: Влево (LEFT)

source: RIGHT
ru_ru: Вправо (RIGHT)

source: UP
ru_ru: Вверх (UP)

source: DOWN
ru_ru: Вниз (DOWN)

source: HOME
ru_ru: В начало (HOME)

source: END
ru_ru: В конец (END)

source: SPACE
ru_ru: Пробел (SPACE)

source: TAB
ru_ru: Табуляция (TAB)

source: ESC
ru_ru: Отмена (ESC)

source: ESCAPE
ru_ru: Отмена (ESCAPE)

source: CANCEL
ru_ru: Отмена (CANCEL)

source: CLEAR
ru_ru: Очистить (CLEAR)

source: MENU
ru_ru: Меню (MENU)

source: PAUSE
ru_ru: Приостановить (PAUSE)

source: CAPITAL
ru_ru: Фиксация верхнего регистра (CAPITAL)

source: SELECT
ru_ru: Выбор (SELECT)

source: PRINT
ru_ru: Печать (PRINT)

source: EXECUTE
ru_ru: Выполнить (EXECUTE)

source: SNAPSHOT
ru_ru: Моментальный снимок (SNAPSHOT)

source: HELP
ru_ru: Вызов справки (HELP)

source: ADD
ru_ru: Сложение (ADD)

source: SEPARATOR
ru_ru: Разделитель (SEPARATOR)

source: SUBTRACT
ru_ru: Вычитание (SUBTRACT)

source: DECIMAL
ru_ru: Десятичный разделитель (DECIMAL)

source: DIVIDE
ru_ru: Деление (DIVIDE)

source: NUM_LOCK
ru_ru: Фиксация числового регистра (NUM_LOCK)

source: SCROLL_LOCK
ru_ru: Отключение режима прокрутки (SCROLL_LOCK)

source: PAGEUP
ru_ru: На страницу вверх (PAGEUP)

source: PAGEDOWN
ru_ru: На страницу вниз (PAGEDOWN)

source: PRIOR
ru_ru: На страницу вверх (PRIOR)

source: NEXT
ru_ru: На страницу вниз (NEXT)

source: BEGIN
ru_ru: Начало (BEGIN)

source: KP_SEPARATOR
ru_ru: Клавиша KP_SEPARATOR (KP_SEPARATOR)

source: WINDOWS_LEFT
ru_ru: Клавиша Windows + стрелка влево (WINDOWS_LEFT)

source: WINDOWS_RIGHT
ru_ru: Клавиша Windows + стрелка вправо (WINDOWS_RIGHT)

source: WINDOWS_MENU
ru_ru: Клавиша Windows + клавиша меню (WINDOWS_MENU)

source: COMMAND
ru_ru: Клавиша ввода команд (COMMAND)

source: SPECIAL
ru_ru: Клавиша SPECIAL (SPECIAL)

source: Select a Keyboard Shortcut
ru_ru: Выбрать комбинацию клавиш

source: Open resource...
ru_ru: Открыть ресурс...

source: Type resource name to open. You may use a space delimited list of words to narrow down the list of choices e.g. Typing: 'Open Dialog' will include results that contain both words "Open" _and_ "Dialog"
ru_ru: Введите имя ресурса, который следует открыть. Вы можете использовать разделённый пробелами список слов, чтобы сузить список вариантов. Например, набрав «Открыть диалоговое окно», вы получите результаты, содержащие оба слова — «Открыть» _и_ «Диалоговое окно»

source: Full Name
ru_ru: Полное имя

source: Show &files
ru_ru: Показать &файлы

source: Show &symbols
ru_ru: Показать &символы

source: Open Resource
ru_ru: Открыть ресурс

source: Replace With:
ru_ru: Заменить на:

source: The following files will be updated:
ru_ru: Следующие файлы будут обновлены:

source: Included From:
ru_ru: Включён из:

source: Line:
ru_ru: Строка:

source: Fix Include Statement
ru_ru: Исправить оператор включения

source: Account
ru_ru: Учётная запись

source: Host
ru_ru: Хост

source: User
ru_ru: Пользователь

source: Add new account
ru_ru: Добавить новую учётную запись

source: Delete the selected accounts
ru_ru: Удалить выбранные учётные записи

source: Edit the selected account
ru_ru: Изменить выбранную учётную запись

source: Account Name:
ru_ru: Имя учётной записи:

source: Give this account a unique name
ru_ru: Присвойте этой учётной записи уникальное имя

source: Host / IP:
ru_ru: Хост или IP-адрес:

source: The remote host ip address or its known name
ru_ru: IP-адрес или известное имя удалённого хоста

source: The SSH port. If you don't know it, leave it as 22 (SSH default port)
ru_ru: Порт SSH. Если вы не знаете его, оставьте значение 22 (порт SSH по умолчанию)

source: Username:
ru_ru: Имя пользователя:

source: Login user name
ru_ru: Имя пользователя для входа

source: This field is optional. By leaving this field empty, codelite will attempt to connect only using public key authentication
ru_ru: Это необязательное поле. Если оставить его пустым, СodeLite будет пытаться подключиться только с использованием аутентификации по открытому ключу

source: Default folder:
ru_ru: Папка по умолчанию:

source: Set the home folder for this account
ru_ru: Установите домашнюю папку для этой учётной записи

source: Test Connection
ru_ru: Проверка подключения

source: Account:
ru_ru: Учётная запись:

source: Set the remote folder to browse and click on the 'Refresh' button
ru_ru: Укажите удалённую папку для просмотра и нажмите кнопку «Обновить»

source: Find:
ru_ru: Найти:

source: File types:
ru_ru: Типы файлов:

source: Case sensitive
ru_ru: С учётом регистра

source: SSH Account Manager
ru_ru: Диспетчер учётных записей SSH

source: Add Account
ru_ru: Добавить учётную запись

source: SFTP Browser
ru_ru: Браузер SFTP

source: Remote Find In Files
ru_ru: Удалённый поиск в файлах

source: Global Functions and Variables
ru_ru: Глобальные функции и переменные

source: Functions Prototypes
ru_ru: Прототипы функций

source: Macros
ru_ru: Макросы

source: Redo
ru_ru: Восстановить

source: Undo
ru_ru: Отменить

source: Undo/Redo to a pre&viously labelled state
ru_ru: Отменить или восстановить ра&нее помеченное состояние

source: AddProjectToBuildMatrix was called with NULL project
ru_ru: При вызове AddProjectToBuildMatrix не определено значение проекта (NULL)

source: No workspace open
ru_ru: Нет открытых рабочих пространств

source: Failed to load project file:
ru_ru: Не удалось загрузить файл проекта:

source: Failed to save workspace file to disk. Please check that you have permission to write to disk
ru_ru: Не удалось сохранить файл рабочего пространства на диск. Убедитесь, что у вас есть разрешение на запись на диск
