Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Malformed project name
ru_ru: Некорректное имя проекта

source: No such project
ru_ru: Указанный проект не существует

source: File removal failed
ru_ru: Не удалось удалить файл

source: Could not open workspace file: '%s'
ru_ru: Не удалось создать файл рабочего пространства: «%s»

source: Corrupted workspace file
ru_ru: Файл рабочего пространства повреждён

source: Caption
ru_ru: Заголовок

source: Modified
ru_ru: Изменён

source: Text
ru_ru: Текст

source: Edit Text
ru_ru: Изменить текст

source: Select Tab
ru_ru: Выбрать вкладку

source: Text Viewer
ru_ru: Средство просмотра текста

source: Press any key to continue...
ru_ru: Нажмите любую клавишу, чтобы продолжить...

source: Failed to execute command:
ru_ru: Не удалось выполнить команду:

source: Working directory
ru_ru: Рабочий каталог

source: Project kind:
ru_ru: Вид проекта:

source: QMake to use:
ru_ru: QMake, который следует использовать:

source: Open the QMakeSettings configuration dialog
ru_ru: Открыть диалоговое окно конфигурации QMakeSettings

source: Other settings:
ru_ru: Другие параметры:

source: New Qmake project
ru_ru: Новый проект QMake

source: Qt's QMake integration with CodeLite
ru_ru: Интеграция QMake QT с CodeLite

source: Create new qmake based project
ru_ru: Создать новый проект на основе QMake

source: New qmake based project...
ru_ru: Новый проект на основе QMake...

source: Run qmake...
ru_ru: Выполнить QMake...

source: Could not locate pro file. Did you remember to run qmake? (right click on the project)
ru_ru: Не удалось определить расположение файла PRO. Вы не забыли выполнить QMake? (щёлкните правой кнопкой мыши по проекту)

source: There is no qmake defined, please define one from 'Plugins -> Qmake -> Settings'
ru_ru: QMake не определён. Определите его в разделе «Модули -> QMake -> Параметры...»

source: Invalid project path!
ru_ru: Недопустимый путь к проекту!

source: Failed to create .project file '%s'
ru_ru: Не удалось создать файл .project «%s»

source: Add / modify qmake configurations:
ru_ru: Добавить или изменить конфигурации QMake:

source: Create new qmake settings
ru_ru: Создать новые параметры QMake

source: qmake executable:
ru_ru: Исполняемый файл QMake:

source: Set QTDIR to the directory where you've installed Qt
ru_ru: Укажите в качестве значения QTDIR тот каталог, в который вы установили Qt

source: QMake Settings
ru_ru: Параметры QMake

source: New qmake settings
ru_ru: Новые параметры QMake

source: New qmake settings name
ru_ru: Имя новых параметров QMake

source: Are you sure you want to delete qmake settings '%s'?
ru_ru: Вы уверены, что хотите удалить параметры QMake «%s»?

source: This project uses qmake
ru_ru: Этот проект использует QMake

source: qmake settings:
ru_ru: Параметры QMake:

source: Select the QMake to be used for this build configuration as defined in 'Plugins -> QMake -> Settings'
ru_ru: Выберите QMake (определяется в разделе настройки «Модули -> QMake -> Параметры...»), который будет использоваться для этой конфигурации сборки

source: qmake execution line:
ru_ru: Строка выполнения QMake:

source: CodeLite will place the below text after the auto generated section (so you may override the generated variables)
ru_ru: CodeLite поместит приведённый ниже текст после автоматически сгенерированной секции (чтобы можно было переопределить сгенерированные переменные)

source: Seelct a folder
ru_ru: Выбор папки

source: Remote work over SSH
ru_ru: Удалённая работа по SSH

source: Remoty plugin
ru_ru: Модуль Remoty

source: Workspace type:
ru_ru: Тип рабочего пространства:

source: Switch to workspace...
ru_ru: Переключить на рабочее пространство...

source: New File System Workspace (remote)
ru_ru: Создать рабочее пространство файловой системы (удалённый тип)

source: Downloading file:
ru_ru: Загрузка файла:

source: Failed to create new workspace file:
ru_ru: Не удалось создать новый файл рабочего пространства:

source: Could not find a matching SSH account to load the workspace!
ru_ru: Не удалось найти соответствующую учётную запись SSH для загрузки рабочего пространства!

source: Failed to download remote workspace file!
ru_ru: Не удалось загрузить файл удалённого рабочего пространства!

source: Retrying to load workspace...
ru_ru: Повторная попытка загрузить рабочее пространство…

source: Failed to load workspace file:
ru_ru: Не удалось загрузить файл рабочего пространства:

source: Invalid empty remote path provided
ru_ru: Указан недопустимый пустой удалённый путь

source: Could not locate ssh executable in your PATH! Update your PATH from 'settings -> environment variables' to a location that contains your 'ssh' executable
ru_ru: Не удалось определить расположение исполняемого файла SSH по указанному пути! Обновите переменную PATH с помощью меню «Настройка -> Переменные среды», указав в ней расположение

source: Failed to start remote terminal process. Do you have `ssh` client installed and in PATH?
ru_ru: Не удалось запустить процесс удалённого терминала. Установлен ли у вас клиент SSH и указан ли он в переменной PATH?

source: Failed to start debugger!
ru_ru: Не удалось запустить отладчик!

source: Please specify an executable to run
ru_ru: Укажите исполняемый файл для выполнения

source: Failed to write remote script on the remote machine!
ru_ru: Не удалось записать удалённый сценарий на удалённом компьютере!

source: Remote file system scan completed. Found:
ru_ru: Проверка удалённой файловой системы завершена. Найдено файлов:

source: Could not find codelite-remote.json file Would you like to create one?
ru_ru: Не удалось найти файл codelite-remote.json. Создать его?

source: Failed to create directory:
ru_ru: Не удалось создать каталог:

source: Failed to create file:
ru_ru: Не удалось создать файл:

source: Failed to save file:
ru_ru: Не удалось сохранить файл:

source: successfully saved
ru_ru: успешно сохранён

source: Remote file:
ru_ru: Удалённый файл:

source: Workspace settings...
ru_ru: Параметры рабочего пространства...

source: Edit codelite-remote.json...
ru_ru: Изменить codelite-remote.json...

source: Close workspace
ru_ru: Закрыть рабочее пространство

source: saved!
ru_ru: сохранён!

source: NOTICE: a workspace reload is required in order for the changes to take place
ru_ru: Обратите внимание: чтобы изменения вступили в силу, необходимо перезагрузить рабочее пространство

source: &File
ru_ru: &Файл

source: &Save changes Ctrl-S
ru_ru: &Сохранить изменения Ctrl-S

source: &Find Ctrl-F
ru_ru: &Найти Ctrl-F

source: &Next change Alt-DOWN
ru_ru: &Следующее изменение Alt-DOWN

source: &Previous change Alt-UP
ru_ru: &Предыдущее изменение Alt-UP

source: &Copy active change from Left to Right Alt-RIGHT
ru_ru: &Копировать активное изменение слева направо Alt-RIGHT

source: &Copy active change from Right to Left Alt-LEFT
ru_ru: &Копировать активное изменение справа налево Alt-LEFT

source: &Copy entire file from Left to Right Ctrl-Alt-RIGHT
ru_ru: &Копировать полный файл слева направо Ctrl-Alt-RIGHT

source: &Copy entire file from Right to Left Ctrl-Alt-LEFT
ru_ru: &Копировать полный файл справа налево Ctrl-Alt-LEFT

source: &New Empty File
ru_ru: &Создать пустой файл

source: New &Workspace
ru_ru: Создать &рабочее пространство

source: New &Project
ru_ru: Создать &проект

source: &Open
ru_ru: &Открыть

source: &Open File...
ru_ru: &Открыть файл...

source: &Open Folder...
ru_ru: &Открыть папку...

source: Open &Workspace...
ru_ru: Открыть &рабочее пространство...

source: &Reload File
ru_ru: &Перезагрузить файл

source: Load a group of tabs
ru_ru: Загрузить группу вкладок

source: &Save File
ru_ru: &Сохранить файл

source: Save &As...
ru_ru: Сохранить &как...

source: Save tabs as group
ru_ru: Сохранить вкладки как группу

source: Duplicate Tab...
ru_ru: Дублировать вкладку...

source: Page Setup...
ru_ru: Параметры страницы...

source: Recent &Files
ru_ru: Последние &файлы

source: Recent &Workspaces
ru_ru: Последние &рабочие пространства

source: E&xit
ru_ru: В&ыход

source: &Undo
ru_ru: &Отменить

source: &Redo
ru_ru: &Восстановить

source: Set la&bel for current state
ru_ru: Установить ме&тку для текущего состояния

source: &Cut
ru_ru: &Вырезать

source: Co&py
ru_ru: Копирова&ть

source: Past&e
ru_ru: Вставит&ь

source: Select &All
ru_ru: Выбрать &все

source: &Delete Line
ru_ru: &Удалить строку

source: D&uplicate Selection / Line
ru_ru: Д&ублировать выделенное или строку

source: Delete to Line &End
ru_ru: Удалить до конца &строки

source: Delete to Line &Start
ru_ru: Удалить до начала &строки

source: &Transpose Lines
ru_ru: &Переставить строки

source: Comment
ru_ru: Комментарий

source: Text Conversion
ru_ru: Преобразование текста

source: Make Upper&case
ru_ru: Все &прописные

source: Make &Lowercase
ru_ru: Все &строчные

source: Trim T&railing Spaces
ru_ru: Удалить к&онечные пробелы

source: Highlight selected word
ru_ru: Подсвечивать выделенное слово

source: Match &Brace
ru_ru: Парная &скобка

source: S&elect to Brace
ru_ru: Выделить &до другой скобки

source: Code Comple&te
ru_ru: Автозавершен&ие кода

source: Complete &Word
ru_ru: Завершить &слово

source: Display &Function Calltip
ru_ru: Отображать подсказку при вызове &функции

source: &View
ru_ru: &Вид

source: Word W&rap
ru_ru: Перенос на &новую строку

source: Toggle Current &Fold
ru_ru: Свернуть или развернуть текущую &свёртываемую область

source: Toggle &All Folds
ru_ru: Свернуть или развернуть &все свёртываемые области

source: Toggle All To&pmost Folds in Selection
ru_ru: Свернуть или развернуть все в&ерхние свёртываемые области в выделении

source: Toggle &Every Fold in Selection
ru_ru: Свернуть или развернуть &каждую свёртываемую область в выделении

source: &Display EOL
ru_ru: &Отображать конец строки

source: Zoom
ru_ru: Масштаб

source: Show Whitespace
ru_ru: Показывать пробелы

source: &Output Pane
ru_ru: &Область вывода

source: Wor&kspace Pane
ru_ru: Обла&сть рабочего пространства

source: &Navigation Bar
ru_ru: &Панель навигации

source: &Debugger Pane
ru_ru: &Область отладчика

source: &Toggle All Panes
ru_ru: &Отобразить или скрыть все области

source: Main ToolBar Orientation
ru_ru: Ориентация основной панели инструментов

source: Top
ru_ru: Вверху

source: Bottom
ru_ru: Внизу

source: Show Plugins Toolbar
ru_ru: Показывать панель инструментов модулей

source: Restore Layout
ru_ru: Восстановить компоновку

source: &Search
ru_ru: &Поиск

source: Find and Replace
ru_ru: Найти и заменить

source: Fi&nd...
ru_ru: Най&ти...

source: &Replace...
ru_ru: &Заменить...

source: Find &Next
ru_ru: Найти &далее

source: Find &Previous
ru_ru: Найти ра&нее

source: &Find In Files...
ru_ru: &Найти в файлах...

source: Go To
ru_ru: Перейти

source: Go To Pre&vious Location
ru_ru: Вернуться к &предыдущему расположению

source: Go To For&ward Location
ru_ru: Перейти к &следующему расположению

source: &Go To Line...
ru_ru: &Перейти к строке...

source: Toggle &Bookmark
ru_ru: Добавить или снять &закладку

source: &Next Bookmark
ru_ru: &Следующая закладка

source: Previo&us Bookmark
ru_ru: Предыд&ущая закладка

source: Remove All &Currently-Active Bookmarks
ru_ru: Удалить все &активные закладки

source: Remove &All Bookmarks
ru_ru: Удалить &все закладки

source: Find &Resource...
ru_ru: Найти &ресурс...

source: &Quick Outline...
ru_ru: &Быстрый вызов Outline...

source: Find &Symbol
ru_ru: Найти &символ

source: &Workspace
ru_ru: &Рабочее пространство

source: &New Workspace...
ru_ru: &Создать рабочее пространство...

source: &Open Workspace...
ru_ru: &Открыть рабочее пространство...

source: &Close Workspace
ru_ru: &Закрыть рабочее пространство

source: &Reload Workspace
ru_ru: &Перезагрузить рабочее пространство

source: &Import other IDEs solution/workspace files...
ru_ru: &Импорт файлов другого решения или рабочего пространства IDE...

source: &Add an existing project
ru_ru: &Добавить существующий проект

source: &Open Active Project Settings...
ru_ru: &Открыть параметры активного проекта...

source: &Select Active Project...
ru_ru: &Выбрать активный проект…

source: Reparse the workspace
ru_ru: Повторный анализ рабочего пространства

source: Configuration &Manager...
ru_ru: Диспетчер &конфигураций...

source: &Run
ru_ru: &Выполнить

source: &Stop
ru_ru: &Остановить

source: &Build Project
ru_ru: &Сборка проекта

source: &Compile Current File
ru_ru: &Компилировать текущий файл

source: &Compile Current File's Project
ru_ru: &Компилировать проект текущего файла

source: Cl&ean Project
ru_ru: Оч&истить проект

source: Sto&p Build
ru_ru: Ост&ановить сборку

source: Reb&uild Project
ru_ru: Вос&становить проект

source: Build and Run Pro&ject
ru_ru: Собрать и выполнить про&ект

source: Ne&xt Build Error
ru_ru: Следую&щая ошибка сборки

source: &Debugger
ru_ru: &Отладчик

source: &Start/Continue Debugger
ru_ru: &Начать или продолжить работу отладчика

source: &Restart Debugger
ru_ru: &Перезапустить отладчик

source: &Attach to process...
ru_ru: &Присоединиться к процессу...

source: Debug a core d&ump...
ru_ru: Отладка дампа п&амяти...

source: &Pause debugger
ru_ru: &Приостановить отладчик

source: S&top debugger
ru_ru: О&становить отладчик

source: Step &Into
ru_ru: Шаг с &заходом

source: Step Into &Instruction
ru_ru: Шаг с заходом по &инструкциям

source: Ne&xt
ru_ru: Дал&ее

source: Step &Out
ru_ru: Шаг с &выходом

source: Show &Cursor
ru_ru: Показать &курсор

source: Toggle &Breakpoint
ru_ru: Поставить или убрать &точку останова

source: Disab&le All Breakpoints
ru_ru: Отключ&ить все точки останова

source: E&nable All Breakpoints
ru_ru: В&ключить все точки останова

source: &Delete All Breakpoints
ru_ru: &Удалить все точки останова

source: &Quick Debug...
ru_ru: &Быстрая отладка...

source: GDB Windows
ru_ru: Окна отладчика GDB

source: ASCII Viewer
ru_ru: Средство просмотра ASCII

source: Disassembly
ru_ru: Дизассемблирование

source: &Plugins
ru_ru: &Модули

source: &Manage Plugins...
ru_ru: &Управление модулями...

source: Settin&gs
ru_ru: Настрой&ка

source: Colours and &Fonts...
ru_ru: Цвета и &шрифты...

source: Keyboard &shortcuts...
ru_ru: Комбинации &клавиш...

source: En&vironment Variables...
ru_ru: Пере&менные среды...

source: &Build Settings...
ru_ru: &Параметры сборки...

source: &GDB Settings...
ru_ru: &Параметры GDB...

source: &Code Completion...
ru_ru: &Автозавершение кода...

source: He&lp
ru_ru: Сп&равка

source: &Check for updates...
ru_ru: &Проверить наличие обновлений...

source: &Run the Setup Wizard...
ru_ru: &Запустить мастер настройки...

source: &About...
ru_ru: &О программе...

source: &Report an issue...
ru_ru: &Сообщить о проблеме...

source: Close Other Tabs
ru_ru: Закрыть другие вкладки

source: Close Tabs To The Right
ru_ru: Закрыть вкладки справа

source: Make Read Only
ru_ru: Сделать доступным только для чтения

source: Copy File Name
ru_ru: Копировать имя файла

source: Detach Editor
ru_ru: Отсоединить редактор

source: Swap Header/Implementation file F12
ru_ru: Переключение между заголовочным файлом и файлом реализации F12

source: Search for selected text in workspace
ru_ru: Поиск выбранного текста в рабочем пространстве

source: Search for selected text with default browser
ru_ru: Поиск выбранного текста в браузере по умолчанию

source: Code Generation / Refactoring
ru_ru: Генерация или оптимизация кода

source: Insert Doxygen Comment Ctrl-Shift-D
ru_ru: Вставить комментарий Doxygen Ctrl-Shift-D

source: Comment Selection Ctrl-Shift-/
ru_ru: Закомментировать выделенный текст Ctrl-Shift-/

source: Toggle Line Comment Ctrl-/
ru_ru: Закомментировать или раскомментировать строку Ctrl-/

source: Create new workspace...
ru_ru: Создать новое рабочее пространство...

source: Add a New File...
ru_ru: Добавить новый файл...

source: Add an Existing File...
ru_ru: Добавить существующий файл...

source: Remove Virtual Folder
ru_ru: Удалить виртуальную папку

source: Rename ...
ru_ru: Переименовать...

source: ReBuild Workspace
ru_ru: Пересобрать рабочее пространство

source: Detach
ru_ru: Отсоединить

source: Hide
ru_ru: Скрыть

source: Open in CodeLite
ru_ru: Открыть в CodeLite

source: Open with &Default Application
ru_ru: Открыть в &приложении по умолчанию

source: Compile
ru_ru: Компилировать

source: Preprocess
ru_ru: Предварительно обработать

source: Exclude from Build
ru_ru: Исключить из сборки

source: Copy Value Only
ru_ru: Копировать только значение

source: Display Format
ru_ru: Формат отображения

source: Natural
ru_ru: Естественный

source: Hexadecimal
ru_ru: Шестнадцатеричный

source: Binary
ru_ru: Бинарный

source: Octal
ru_ru: Восьмеричный

source: Decimal
ru_ru: Десятичный

source: Tags
ru_ru: Метки

source: Global Parser Paths
ru_ru: Глобальные пути для синтаксического анализатора

source: Add to include paths
ru_ru: Добавить в пути поиска включаемых файлов

source: Add to exclude paths
ru_ru: Добавить в пути исключений

source: Workspace Parser Paths
ru_ru: Пути рабочего пространства для синтаксического анализатора

source: Open in &editor
ru_ru: Открыть в &редакторе

source: Open With &Default Application
ru_ru: Открыть в &приложении по умолчанию

source: Open Shell here
ru_ru: Открыть командный интерпретатор здесь

source: Open File Explorer here
ru_ru: Открыть проводник здесь

source: My Dialog
ru_ru: Моё диалоговое окно

source: My MainFrame
ru_ru: Мой мэйнфрейм

source: GPL v2 or later
ru_ru: Лицензия GPL версии 2 или более поздней

source: Short description goes here
ru_ru: Место для краткого описания

source: Exit Alt-X
ru_ru: Выход Alt-X

source: Quit
ru_ru: Выход

source: My Frame
ru_ru: Мой фрейм

source: Rust plugin for CodeLite IDE
ru_ru: Модуль Rust для CodeLite IDE

source: Select the folder to run 'cargo new'
ru_ru: Выберите папку, чтобы выполнить «cargo new»

source: Could not locate cargo in your PATH
ru_ru: Не удалось определить расположение cargo по указанному пути

source: Open account manager...
ru_ru: Открыть диспетчер учётных записей...

source: Disconnected. Click to connect
ru_ru: Отключён. Щёлкните, чтобы подключить

source: Open Terminal
ru_ru: Открыть терминал

source: Manage bookmarks...
ru_ru: Управление закладками...

source: Go to:
ru_ru: Перейти:

source: Type a path and hit ENTER
ru_ru: Введите путь и нажмите клавишу «Ввод»

source: SSH Client:
ru_ru: Клиент SSH:

source: Upload the files to this folder:
ru_ru: Загрузить файлы в эту папку:

source: Set the remote folder path
ru_ru: Укажите путь к удалённой папке

source: Connect to an existing account
ru_ru: Подключиться к существующей учётной записи

source: Choose an account to connect to
ru_ru: Выберите учётную запись для подключения

source: Quick connect
ru_ru: Быстрое подключение

source: Host:
ru_ru: Хост:

source: User:
ru_ru: Пользователь:

source: Find What:
ru_ru: Найти:

source: String to search
ru_ru: Строка для поиска

source: Search In:
ru_ru: Искать в:

source: File types to search e.g: *.txt
ru_ru: Типы файлов для поиска. Например: *.txt

source: Ignore case
ru_ru: Без учёта регистра

source: Manage Bookmarks
ru_ru: Управление закладками

source: SFTP / SSH Settings
ru_ru: Параметры SFTP/SSH

source: SFTP Upload Files
ru_ru: Файлы загрузки SFTP

source: SFTP Connect
ru_ru: Подключение по SFTP

source: Remote Grep
ru_ru: Удалённая Grep

source: SFTP plugin for codelite IDE
ru_ru: Модуль SFTP для CodeLite IDE

source: SFTP
ru_ru: Модуль SFTP

source: SFTP Log
ru_ru: Журнал SFTP

source: Open SSH Account Manager
ru_ru: Открыть диспетчер учётных записей SSH

source: &Setup...
ru_ru: &Настройка...

source: &Disable
ru_ru: &Отключить

source: Workspace Mirroring
ru_ru: Зеркальное отображение рабочего пространства

source: Select the remote workspace
ru_ru: Выберите удалённое рабочее пространство

source: Failed to synchronize file '
ru_ru: Не удалось синхронизировать файл '

source: Could not locate account:
ru_ru: Не удалось определить расположение учётной записи:

source: with remote server
ru_ru: с удалённым сервером

source: Failed to rename file '
ru_ru: Не удалось переименовать файл '

source: ' Could not locate account:
ru_ru: ' Не удалось определить расположение учётной записи:

source: Failed to delete remote file '
ru_ru: Не удалось удалить удалённый файл '

source: Failed to delete remote file:
ru_ru: Не удалось удалить удалённый файл:

source: Uploading file:
ru_ru: Отправка файла:

source: Renaming:
ru_ru: Переименование:

source: Renamed
ru_ru: Переименован

source: Deleting:
ru_ru: Удаление:

source: Deleted
ru_ru: Удалён

source: Connecting to
ru_ru: Подключение к

source: Enable:
ru_ru: Включить:

source: Clear statistics
ru_ru: Очистить статистику

source: Clear statistics gathered
ru_ru: Очистить собранную статистику

source: Make the default Code Completion smarter and better
ru_ru: Усовершенствование автозавершения кода по умолчанию

source: Menu Entry:
ru_ru: Элемент меню:

source: Keyboard Shortcut:
ru_ru: Комбинация клавиш:

source: Use $ as placeholder for the selection and @ to set the caret position. e.g. for($ = 0; $ < @; $++) NOTE: If your snippet contains @ or $, you can escape the placeholders with a backslash: \@ OR \$
ru_ru: Используйте $ в качестве заполнителя для выбранного элемента и @ для установки позиции курсора. Например, for($ = 0; $ < @; $++) ПРИМЕЧАНИЕ: Если ваш фрагмент кода содержит символы @ или $, вы можете экранировать заполнители с помощью обратной косой черты: \@ ИЛИ \$

source: Change
ru_ru: Изменить

source: Snippets
ru_ru: Фрагменты кода

source: Edit Snippets
ru_ru: Изменить фрагменты кода

source: SnipWiz
ru_ru: Модуль SnipWiz

source: Menu entry is not unique!
ru_ru: Элемент меню не является уникальным!

source: That accelerator already exists
ru_ru: Этот акселератор уже существует

source: A small tool to add expandable code snippets and template classes
ru_ru: Небольшой инструмент для добавления расширяемых фрагментов кода и шаблонных классов

source: Snippet wizard
ru_ru: Мастер фрагментов кода

source: Template class...
ru_ru: Шаблонный класс...

source: New Class from Template...
ru_ru: Новый шаблонный класс...

source: Enter identifier name
ru_ru: Введите имя идентификатора

source: Cases:
ru_ru: Варианты:

source: Enter number of cases
ru_ru: Введите число вариантов

source: Paste buffer
ru_ru: Вставить из буфера

source: New class from template
ru_ru: Создать класс из шаблона

source: Class
ru_ru: Класс

source: Class name:
ru_ru: Имя класса:

source: Name of new class
ru_ru: Имя нового класса

source: Template for new class
ru_ru: Шаблон для нового класса

source: Files
ru_ru: Файлы

source: Header file:
ru_ru: Заголовочный файл:

source: Name of header file
ru_ru: Имя заголовочного файла

source: Implementation file:
ru_ru: Файл реализации:

source: Name of source file
ru_ru: Имя исходного файла

source: Virtual folder to add new files
ru_ru: Виртуальная папка для добавления новых файлов

source: Browse virtual folders
ru_ru: Обзор виртуальных папок

source: Hd folder to add new files
ru_ru: Папка на жёстком диске для добавления новых файлов

source: Browse folders
ru_ru: Обзор папок

source: Implementation File
ru_ru: Файл реализации

source: Template Class Wizard
ru_ru: Мастер шаблонных классов

source: Select output folder
ru_ru: Выбрать выходную папку

source: Files successfully created.
ru_ru: Файлы успешно созданы.

source: Add template class
ru_ru: Добавить шаблонный класс

source: Add class
ru_ru: Добавить класс

source: Class exists! Overwrite?
ru_ru: Класс уже существует! Перезаписать?

source: Change class
ru_ru: Изменить класс

source: That class doesn't exist! Try again?
ru_ru: Этот класс не существует! Повторить попытку?

source: File already exists! Overwrite?
ru_ru: Файл уже существует! Перезаписать?

source: Generate class files
ru_ru: Создать файлы классов

source: Could not find aff file!
ru_ru: Не удалось найти файл AFF!

source: Could not find dictionary file!
ru_ru: Не удалось найти файл словаря!

source: No spelling errors found!
ru_ru: Орфографические ошибки не найдены!
