Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: This folder already contains a file named 'abbreviations.conf' - would you like to overwrite it?
ru_ru: Эта папка уже содержит файл с именем «abbreviations.conf». Перезаписать его?

source: Abbreviations were exported to '
ru_ru: Сокращения экспортированы в '

source: The file does not seem to contain a valid abbreviations entries
ru_ru: Похоже, что файл не содержит допустимые записи сокращений

source: Abbreviations imported successfully!
ru_ru: Сокращения успешно импортированы!

source: Remote folder path:
ru_ru: Путь к удалённой папке:

source: Connect
ru_ru: Подключиться

source: Disconnect
ru_ru: Отключиться

source: List folders
ru_ru: Получить список папок

source: Input folder:
ru_ru: Папка входных данных:

source: Output folder:
ru_ru: Папка выходных данных:

source: Generate Themes
ru_ru: Создать темы

source: A makefile generator based on codelite's workspace
ru_ru: Генератор файлов Makefile на основе рабочего пространства CodeLite

source: CodeLite built-in terminal emulator
ru_ru: Встроенный эмулятор терминала CodeLite

source: Clear screen Ctrl-L
ru_ru: Очистить экран Ctrl-L

source: Preferences...
ru_ru: Параметры...

source: Text Colour:
ru_ru: Цвет текста:

source: Font:
ru_ru: Шрифт:

source: Enable vim mode
ru_ru: Включить режим Vim

source: Vim Settings
ru_ru: Параметры Vim

source: vim bindings for CodeLite
ru_ru: Привязки Vim для CodeLite

source: Searching:
ru_ru: Поиск:

source: Unbalanced Parentesis
ru_ru: Непарные скобки

source: Saving
ru_ru: Сохранение

source: Closing
ru_ru: Закрытие

source: Saving and Closing
ru_ru: Сохранение и закрытие

source: Unknown Error
ru_ru: Неизвестная ошибка

source: Updating workspace...
ru_ru: Обновление рабочего пространства...

source: ' to: '
ru_ru: ' в: '

source: Failed to rename workspace file: '
ru_ru: Не удалось переименовать файл рабочего пространства: '

source: Workspace file modified externally. Would you like to reload the workspace?
ru_ru: Файл рабочего пространства изменён извне. Перезагрузить рабочее пространство?

source: A project with similar name already exists in the workspace
ru_ru: Проект с аналогичным именем уже существует в рабочем пространстве

source: Path '
ru_ru: Путь '

source: Unable to create a project at the selected path
ru_ru: Не удалось создать проект по выбранному пути

source: ' is already part of project '
ru_ru: ' уже является частью проекта '

source: Project '
ru_ru: Проект '

source: ' is located under this path
ru_ru: ' располагается по этому пути

source: Another process is already running
ru_ru: Другой процесс уже выполняется

source: Please set an index file to execute in the project settings
ru_ru: Установите индексный файл для выполнения в параметрах проекта

source: Could not find any PHP binary to execute. Please set one in from: 'PHP | Settings'
ru_ru: Не удалось найти двоичный файл PHP для выполнения. Установите его с помощью меню: «PHP | Параметры»

source: Place each parent in a separate line
ru_ru: Поместить каждый родительский объект в отдельную строку

source: Edit Class Extends
ru_ru: Изменить расширения класса

source: Edit Class Interfaces
ru_ru: Изменить интерфейсы класса

source: Delete the selected breakpoints
ru_ru: Удалить выбранные точки останова

source: Delete all breakpoints
ru_ru: Удалить все точки останова

source: Failed to locate SSH account:
ru_ru: Не удалось определить расположение учётной записи SSH:

source: This project has no file mapping defined. This may result in breakpoints not applied
ru_ru: В этом проекте не определено сопоставление файлов. Это может привести к тому, что точки останова не будут применены

source: To fix this, set file mapping from Project Settings -> Debug
ru_ru: Чтобы исправить это, установите сопоставление файлов в меню «Параметры проекта» -> «Отладка»

source: Remember my answer and don't show this message again
ru_ru: Запомнить ответ и не показывать это сообщение снова

source: OK, Continue to Debug
ru_ru: OK, продолжить отладку

source: Stop the debugger
ru_ru: Остановить отладчик

source: Could not open file:
ru_ru: Не удалось открыть файл:

source: XDebug did not connect in a timely manner
ru_ru: Подключение XDebug не было выполнено вовремя

source: Run XDebug Test
ru_ru: Выполнить тест XDebug

source: Error evaluating expression
ru_ru: Ошибка при вычислении выражения

source: Failed to map remote file:
ru_ru: Не удалось сопоставить удалённый файл:

source: Check your project settings->Debug to define folder mapping
ru_ru: Проверьте свои параметры в меню «Параметры проекта» -> «Отладка» для определения сопоставления папок

source: *** Error evaluating expression:
ru_ru: *** Ошибка при вычислении выражения:

source: Copy Value
ru_ru: Копировать значение

source: Choose the object type
ru_ru: Выберите тип объекта

source: The name
ru_ru: Имя

source: If set, the generated code will be placed inside this namespace
ru_ru: Если значение установлено, создаваемый код будет помещён в это пространство имён

source: Extends:
ru_ru: Расширения:

source: A comma separated list of parents for this class
ru_ru: Список разделённых запятой родительских объектов для этого класса

source: Edit in a small text editor...
ru_ru: Редактировать в маленьком текстовом редакторе...

source: Implements:
ru_ru: Реализации:

source: A comma separated list of interfaces for this class
ru_ru: Список разделённых запятой интерфейсов для этого класса

source: Generate consturctor
ru_ru: Создать конструктор

source: Generate desctructor
ru_ru: Создать деструктор

source: Create folder per namespace
ru_ru: Создать папку для каждого пространства имён

source: Make singleton (available for classes only)
ru_ru: Сделать singleton-классом (доступно только для классов)

source: The generated class will be generated as a singleton class
ru_ru: Создаваемый класс будет сгенерирован как singleton- класс

source: Enable PHP support for codelite IDE
ru_ru: Включает поддержку PHP для CodeLite IDE

source: PHP Plugin for the codelite IDE
ru_ru: Модуль PHP для СodeLite IDE

source: Could not create workspace folder: %s
ru_ru: Не удалось создать папку рабочего пространства: %s

source: Failed to open workspace: corrupted workspace file
ru_ru: Не удалось открыть рабочее пространство: повреждён файл рабочего пространства

source: PHP Settings...
ru_ru: Параметры PHP...

source: Run XDebug Setup Wizard...
ru_ru: Запустить мастер настройки XDebug...

source: Can't create PHP project. Close your current workspace first
ru_ru: Не удалось создать проект PHP. Сначала закройте своё текущее рабочее пространство

source: Goto definition
ru_ru: Определение Goto

source: Insert Doxygen Comment
ru_ru: Вставить комментарий Doxygen

source: Generate Setters / Getters
ru_ru: Создать методы присваивания и считывания

source: Code Generation
ru_ru: Генерация кода

source: Open '%s'
ru_ru: Открыть «%s»

source: Select folder
ru_ru: Выбрать папку

source: The workspace path. This path must exist
ru_ru: Путь к рабочему пространству. Этот путь должен существовать

source: Set here the workspace name
ru_ru: Укажите здесь имя рабочего пространства

source: Type the resource name (file, variable, class, function, constant or define):
ru_ru: Введите имя ресурса (файл, переменная, класс, функция, постоянная или определение):

source: PHP Executable:
ru_ru: Исполняемый файл PHP:

source: Select the PHP executable to use when debugging / running command line scripts
ru_ru: Выберите исполняемый файл PHP для использования при отладке или выполнении сценариев командной строки

source: Set the PHP error reporting level (affects command line only)
ru_ru: Установите уровень сообщений об ошибках PHP (влияет только на командную строку)

source: Add include path:
ru_ru: Добавить путь поиска включаемых файлов:

source: Add include path for PHP
ru_ru: Добавить путь поиска включаемых файлов для PHP

source: Add include path for code completion:
ru_ru: Добавить путь поиска включаемых файлов для автозавершения кода:

source: Paths added here will only be used for code completion and NOT during runtime. If you want to add search paths for runtime (CLI mode only), Use the 'PHP CLI' tab
ru_ru: Пути, добавленные здесь, будут использоваться только для автозавершения кода, а НЕ в среде выполнения. Если вы хотите добавить пути поиска для среды выполнения (только в режиме CLI), используйте вкладку «PHP CLI»

source: Listen host:
ru_ru: Хост ожидания передачи данных:

source: Wait for connection from XDebug on this host
ru_ru: Ожидать подключения XDebug на этом хосте

source: The port on which codelite is accepting debug sessions from XDebug This value must be the same as the value set in the 'xdebug.remote_port' directive
ru_ru: Порт, на котором CodeLite принимает сеансы отладки от XDebug Это значение должно совпадать со значением, заданным в директиве «xdebug.remote_port»

source: IDE Key:
ru_ru: Ключ IDE:

source: This field defines the session name between CodeLite and XDebug
ru_ru: Это поле определяет имя сеанса между CodeLite и XDebug

source: The XDebug session name
ru_ru: Имя сеанса XDebug

source: Select the project execution mode:
ru_ru: Режим выполнения проекта:

source: Run project as command line
ru_ru: Выполнить проект как командную строку

source: PHP executable:
ru_ru: Исполняемый файл PHP:

source: Select the PHP interperter to use for running this project
ru_ru: Выберите интерпретатор PHP, который следует использовать для выполнения этого проекта

source: Select PHP INI file:
ru_ru: INI-файл PHP:

source: Select the PHP INI file to use with PHP (leave empty for default)
ru_ru: Выберите INI-файл PHP, который следует использовать с PHP (оставьте пустым, чтобы использовать значение по умолчанию)

source: Index File:
ru_ru: Индексный файл:

source: Select the project index file
ru_ru: Выберите индексный файл проекта

source: Program arguments
ru_ru: Аргументы программы

source: Insert the program arguments here Place each argument on a separate line
ru_ru: Вставьте аргументы программы здесь. Поместите каждый аргумент в отдельную строку

source: Run project as web site
ru_ru: Выполнить проект как веб-сайт

source: Project URL:
ru_ru: URL-адрес проекта:

source: Use system default browser
ru_ru: Использовать системный браузер по умолчанию

source: Include path
ru_ru: Путь поиска включаемых файлов

source: When running project with PHP CLI tool, pass the following include paths
ru_ru: При выполнении проекта с помощью инструмента CLI PHP передать следующие пути поиска включаемых файлов

source: Project file types
ru_ru: Типы файлов проекта

source: Set the file extensions to include in this project CodeLite will only display these file types in the project view
ru_ru: Укажите расширения файлов, которые следует включить в этот проект CodeLite будет отображать только эти типы файлов в представлении проекта

source: Exclude folders
ru_ru: Исключить папки

source: Set a list of folders to exclude from the project. If the last part of the folder path is equal to one of the entries in this exclude list, it will not be shown in the project view
ru_ru: Задайте список папок, которые следует исключить из проекта. Если последняя часть пути к папке совпадает с одним из пунктов в этом списке исключений, она не будет показана в представлении проекта

source: File mapping
ru_ru: Сопоставление файлов

source: Source folder
ru_ru: Исходная папка

source: Target folder
ru_ru: Целевая папка

source: Local folder:
ru_ru: Локальная папка:

source: The source folder usually points to the location where you develop your code
ru_ru: Исходная папка обычно указывает на место, в котором вы разрабатываете свой код

source: Eval
ru_ru: Функция Eval

source: Type an expression and hit the 'Send' button This works best when wrapping the command inside a print_r function, e.g. print_r( $mystr, true )
ru_ru: Введите выражение и нажмите кнопку «Отправить» Это работает лучше всего, если обернуть команду в функцию print_r, например print_r($mystr, true )

source: XDebug Console
ru_ru: Консоль XDebug

source: Run / Debug URL
ru_ru: Выполнение или отладка URL-адреса

source: Run / Debug with PHP command line
ru_ru: Выполнение или отладка из командной строки PHP

source: Select the debugging method
ru_ru: Выберите метод отладки

source: Page
ru_ru: Страница

source: URL to Run / Debug:
ru_ru: URL-адрес для выполнения или отладки:

source: Enter the URL to debug
ru_ru: Введите URL-адрес для отладки

source: File to Run / Debug:
ru_ru: Файл для выполнения или отладки:

source: Use the active file opened in the editor
ru_ru: Использовать активный файл, открытый в редакторе

source: Project Creation
ru_ru: Создание проекта

source: Select the project creation method
ru_ru: Выберите метод создания проекта

source: Create an empty PHP project
ru_ru: Создать пустой проект PHP

source: Create a project from an existing source files
ru_ru: Создать проект из существующих исходных файлов

source: Project Details
ru_ru: Сведения о проекте

source: Set the project name and path
ru_ru: Укажите имя проекта и путь к нему

source: Set the project name
ru_ru: Укажите имя проекта

source: Select the project path
ru_ru: Выберите путь к проекту

source: Create the project under a separate folder
ru_ru: Создать проект в отдельной папке

source: Preview:
ru_ru: Предварительный просмотр:

source: PHP Execution
ru_ru: Выполнение PHP

source: Set PHP execution method
ru_ru: Установите метод выполнения PHP

source: Project type:
ru_ru: Тип проекта:

source: Select the project type from the list
ru_ru: Выберите тип проекта из списка

source: Select the PHP command line executable to use
ru_ru: Выберите исполняемый файл командной строки PHP, который следует использовать

source: Add include paths for Code Completion
ru_ru: Добавьте пути поиска включаемых файлов для автозавершения кода

source: Browse for code completion folder...
ru_ru: Выбор папки автозавершения кода...

source: You can add folders here for better code completion. CodeLite will scan these folder for any PHP files for better code complete There is no need to add the project folders, these are parsed automatically
ru_ru: Вы можете добавить сюда папки для совершенствования автозавершения кода. CodeLite будет проверять эти папки на наличие файлов PHP с целью улучшения автозавершения кода Не требуется добавлять папки проекта, они анализируются автоматически

source: XDebug Port
ru_ru: Порт XDebug

source: Setup XDebug port number CodeLite will listen on this port for new incoming messages from XDebug
ru_ru: Укажите номер порта XDebug На этом порте CodeLite будет ожидать передачи новых входящих сообщений от XDebug

source: Port number:
ru_ru: Номер порта:

source: Set the port on which CodeLite will be listening for new connections from XDebug. The default port is 9000
ru_ru: Укажите порт, на котором CodeLite будет ожидать новых подключений XDebug. Порт по умолчанию — 9000

source: CodeLite IP address
ru_ru: IP-адрес CodeLite

source: Set the IP address on which CodeLite is running
ru_ru: Установите IP-адрес, на котором работает CodeLite

source: IP address:
ru_ru: IP-адрес:

source: Set the IP address on which CodeLite is listening. This IP needs to be visible to the machine where XDebug is running.
ru_ru: Укажите IP-адрес, на котором CodeLite ожидает передачи данных. Этот IP-адрес должен быть видим компьютеру, на котором запущен XDebug.

source: IDE Key
ru_ru: Ключ IDE

source: Set the IDE key between CodeLite and XDebug
ru_ru: Укажите ключ IDE между CodeLite и XDebug

source: Setup XDebug INI settings
ru_ru: Установите параметры INI XDebug

source: XDebug INI Settings
ru_ru: Параметры INI XDebug

source: Copy the below text and paste it in your php.ini file:
ru_ru: Скопируйте текст ниже и вставьте его в ваш файл php.ini:

source: Variable
ru_ru: Переменная

source: Functions start with lowercase
ru_ru: Функции начинаются со строчной буквы

source: Generated functions start with lowercase letter
ru_ru: Создаваемые функции начинаются со строчной буквы

source: Prefix getter with 'get' or 'is'
ru_ru: Устанавливать для функции считывания префикс «get» или «is»

source: When checked, the getter function is prefixed with 'get', otherwise, the getter is same as the variable name (without the $ sign)
ru_ru: Если флажок установлен, функция считывания получает префикс «get». В противном случае функция считывания совпадает с именем переменной (без знака $)

source: Setter returns $this
ru_ru: Функция присваивания возвращает $this

source: The setter returns $this object
ru_ru: Метод считывания возвращает $этот объект

source: New PHP Workspace
ru_ru: Новое рабочее пространство PHP

source: PHP General Settings
ru_ru: Основные параметры PHP

source: File Mapping
ru_ru: Сопоставление файлов

source: PHP Run / Debug
ru_ru: Выполнение или отладка PHP

source: New PHP Project
ru_ru: Новый проект PHP

source: XDebug Setup
ru_ru: Настройка XDebug

source: Open active project settings
ru_ru: Открыть параметры активного проекта

source: Setup automatic upload
ru_ru: Установить автоматическую отправку

source: Sync workspace with file system
ru_ru: Синхронизировать рабочее пространство с файловой системой

source: Sync workspace with file system...
ru_ru: Синхронизировать рабочее пространство с файловой системой...

source: Wait for Debugger Connection
ru_ru: Ожидать подключения к отладчику

source: Can only import one folder at a time
ru_ru: Одновременно можно импортировать только одну папку

source: Failed to create workspace '
ru_ru: Не удалось создать рабочее пространство '

source: Permission denied.
ru_ru: Разрешение отклонено.

source: Failed to open workspace '
ru_ru: Не удалось открыть рабочее пространство '

source: File exists
ru_ru: Файл уже существует

source: The folder already contains a workspace file Please close the current workspace before continuing
ru_ru: Папка уже содержит файл рабочего пространства. Закройте текущее рабочее пространство, прежде чем продолжить

source: Open with Default Application
ru_ru: Открыть в приложении по умолчанию

source: Create a new project...
ru_ru: Создать новый проект...

source: Add an existing project...
ru_ru: Добавить существующий проект...

source: Parse workspace
ru_ru: Анализ рабочего пространства

source: Find In Folder...
ru_ru: Найти в папке...

source: Set as active project
ru_ru: Установить как активный проект

source: Remove project
ru_ru: Удалить проект

source: New Class...
ru_ru: Создать класс...

source: New Folder...
ru_ru: Создать папку...

source: New File...
ru_ru: Создать файл...

source: Sync project with file system...
ru_ru: Синхронизировать проект с файловой системой...

source: Run project...
ru_ru: Выполнить проект...

source: Project settings...
ru_ru: Параметры проекта...

source: Sync folder with file system...
ru_ru: Синхронизировать папку с файловой системой...

source: Building workspace tree view
ru_ru: Построение дерева рабочего пространства

source: Are you sure you want to remove project '
ru_ru: Вы уверены, что хотите удалить проект '

source: New Folder Name:
ru_ru: Имя новой папки:

source: ' and its content?
ru_ru: ' и её содержимое?

source: Are you sure you want to delete folder '
ru_ru: Вы уверены, что хотите удалить папку '

source: Rename file
ru_ru: Переименовать файл

source: This operation will delete the selected items. Continue?
ru_ru: Эта операция удалит выбранные пункты. Продолжить?

source: '%s' is a folder. This operation will delete the folder and its content. Continue?
ru_ru: «%s» является папкой. Эта операция удалит папку и её содержимое. Продолжить?

source: No active project is set !? Please set an active project and try again
ru_ru: Активный проект не установлен! Установите активный проект и повторите попытку

source: New workspace name:
ru_ru: Новое имя рабочего пространства:

source: Rename workspace
ru_ru: Переименовать рабочее пространство

source: Enable automatic upload
ru_ru: Включить автоматическую отправку

source: Select the remote folder corrseponding to the current workspace file
ru_ru: Выберите удалённую папку, соответствующую файлу текущего рабочего пространства

source: Folder name:
ru_ru: Имя папки:

source: Scanning for PHP files...
ru_ru: Поиск файлов PHP…

source: Scanning for PHP files completed
ru_ru: Поиск PHP-файлов завершён

source: A file with this name already exists in the target folder Overwrite it?
ru_ru: Файл с этим именем уже существует в целевой папке. Перезаписать его?

source: Do this for all files
ru_ru: Сделать это для всех файлов

source: CppChecker integration for CodeLite IDE
ru_ru: Интеграция CppChecker для CodeLite IDE

source: CppCheck integration for CodeLite IDE
ru_ru: Интеграция CppCheck для CodeLite IDE

source: Check current file
ru_ru: Проверка текущего файла

source: Check current file's project
ru_ru: Проверка проекта текущего файла

source: Check workspace
ru_ru: Проверка рабочего пространства

source: Run CppCheck
ru_ru: Выполнить CppCheck

source: CppCheckPlugin: CppCheck is currently busy please wait for it to complete the current check
ru_ru: Модуль CppCheck: CppCheck в настоящее время занят. Подождите, пока он завершит текущую проверку

source: Starting cppcheck: %s
ru_ru: Запуск СppСheck: %s

source: Failed to launch codelite_cppcheck process!
ru_ru: Не удалось запустить процесс codelite_cppcheck!

source: No files to check
ru_ru: Нет файлов для проверки

source: Failed to open temporary file
ru_ru: Не удалось открыть временный файл

source: Clear the CppCheck report view
ru_ru: Очистить представление отчёта CppCheck

source: Stop the current analysis
ru_ru: Остановить текущий анализ

source: Move to previous error
ru_ru: Перейти к предыдущей ошибке

source: Move to next error
ru_ru: Перейти к следующей ошибке

source: cppcheck analysis ended. Found
ru_ru: Анализ СppСheck завершён. Найдено возможных ошибок:

source: C/C++ Files
ru_ru: Файлы C/C++

source: All Files
ru_ru: Все файлы

source: Add File(s):
ru_ru: Добавить файл(ы):

source: There is already an entry with ID string. Try again?
ru_ru: Запись со строкой идентификатора уже существует. Повторить попытку?

source: Really remove this warning suppression, rather than just unticking it?
ru_ru: Действительно удалить это подавление предупреждений, а не просто снять соответствующий флажок?

source: Select the path containing include files
ru_ru: Выберите путь, содержащий включаемые файлы

source: Enter a definition e.g. 'FOO' or 'BAR=1' (not '-DFoo')
ru_ru: Введите определение, например «FOO» или «BAR=1» (не «-DFoo»)

source: Enter a definition NOT to check e.g. 'FOO' or 'BAR=1' (not '-UFoo')
ru_ru: Введите определение не для проверки, например «FOO» или «BAR=1» (не «-UFo»)

source: Missing includes
ru_ru: Отсутствующие включаемые файлы

source: Checks
ru_ru: Проверки

source: Run the following extra checks:
ru_ru: Выполнить следующие дополнительные проверки:

source: Coding style
ru_ru: Стиль кодирования

source: Performance
ru_ru: Производительность

source: Portability
ru_ru: Возможность переноса

source: Unused functions
ru_ru: Неиспользованные функции

source: Output informative messages
ru_ru: Выводить информационные сообщения

source: Posix standards
ru_ru: Стандарты Posix

source: C99 standards
ru_ru: Стандарты C99

source: C++11 standards
ru_ru: Стандарты C++11

source: Tick All
ru_ru: Отметить все

source: Tick all the boxes
ru_ru: Установить все флажки

source: Untick All
ru_ru: Снять все

source: Untick all the boxes
ru_ru: Снять все флажки

source: Force checking unlimited numbers of configurations
ru_ru: Принудительно проверять неограниченное количество конфигураций

source: By default the maximum number of configurations checked per file is 12. If that might not be enough, tick this box.
ru_ru: По умолчанию максимальное количество проверяемых конфигураций для одного файла равно 12. Если этого может быть недостаточно, установите этот флажок.

source: Multiple jobs (-j)
ru_ru: Несколько заданий (-j)
