Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: CodeLite spell checker
ru_ru: Модуль проверки орфографии CodeLite

source: CodeLite spell-checker
ru_ru: Модуль проверки орфографии CodeLite

source: Check spelling...
ru_ru: Проверка орфографии...

source: Run spell-checker
ru_ru: Выполнить проверку орфографии

source: Check continuous
ru_ru: Непрерывная проверка

source: SpellCheck
ru_ru: Проверка орфографии

source: Spell Checker
ru_ru: Модуль проверки орфографии

source: Ignore
ru_ru: Игнорировать

source: Check...
ru_ru: Проверить...

source: Start continuous check
ru_ru: Запустить непрерывную проверку

source: Dictionary path:
ru_ru: Путь к словарю:

source: Select the location of the installed dictionaries
ru_ru: Выберите расположение установленных словарей

source: Find dictionaries on the web..
ru_ru: Найти словари в сети...

source: Dictionary base name:
ru_ru: Имя базового словаря:

source: Check The Following:
ru_ru: Проверять следующее:

source: Strings
ru_ru: Строки

source: CPP comments
ru_ru: Комментарии CPP

source: C comments
ru_ru: Комментарии С

source: User dictionary and ignored words are case sensitive
ru_ru: Учитывать регистр для словаря пользователя и игнорируемых слов

source: Ignore symbols in tags database
ru_ru: Игнорировать символы в базе данных меток

source: Don't mark words in the project's tags database as spelling errors
ru_ru: Не помечать слова в базе данных меток проекта как орфографические ошибки

source: Clear ignore list
ru_ru: Очистить список игнорирования

source: Clear the ignore list
ru_ru: Очистить список игнорирования

source: Misspelling:
ru_ru: Орфографическая ошибка:

source: Suggestions:
ru_ru: Возможные варианты:

source: Suggest
ru_ru: Предложить

source: SpellChecker Settings
ru_ru: Параметры модуля проверки орфографии

source: Misspelling found!
ru_ru: Найдена орфографическая ошибка!

source: Choose a commit
ru_ru: Выбрать фиксацию

source: This will clear the message history Continue?
ru_ru: Это приведёт к очистке журнала сообщений. Продолжить?

source: Commit History
ru_ru: Журнал фиксаций

source: Insert Last Message
ru_ru: Вставить последнее сообщение

source: Subversion plugin for codelite2.0 based on the svn command line tool
ru_ru: Модуль Subversion для CodeLite 2.0 на основе инструмента командной строки SVN

source: Subversion Options
ru_ru: Параметры Subversion

source: Sync Project Files...
ru_ru: Синхронизировать файлы проекта...

source: Watch this folder
ru_ru: Наблюдать эту папку

source: Commit
ru_ru: Зафиксировать

source: Revert changes
ru_ru: Отменить изменения

source: Lock file
ru_ru: Заблокировать файл

source: UnLock file
ru_ru: Разблокировать файл

source: Show Recent Changes
ru_ru: Показать последние изменения

source: Revert to revision
ru_ru: Вернуться к версии

source: Create Diff
ru_ru: Создать список различий

source: Change Log...
ru_ru: Журнал изменений...

source: You are about to revert all your changes Are you sure?
ru_ru: Вы собираетесь отменить все изменения. Вы уверены?

source: Insert base revision to diff against:
ru_ru: Вставьте основную версию для сравнения:

source: Svn Diff
ru_ru: Сравнить с SVN

source: Enter new URL:
ru_ru: Введите новый URL-адрес:

source: Svn Switch...
ru_ru: Переключение имеющейся рабочей копии на другую ветвь…

source: Svn Rename
ru_ru: Переименовать в SVN

source: Fail to write commit message to a temporary file!
ru_ru: Не удалось записать сообщение о фиксации во временный файл!

source: Set the revision number:
ru_ru: Номер версии:

source: Invalid revision number
ru_ru: Недопустимый номер версии

source: Would you like to remove the following folders from SVN?
ru_ru: Вы хотите удалить следующие папки из SVN?

source: Would you like to remove the following files from SVN?
ru_ru: Вы хотите удалить следующие файлы из SVN?

source: .. and
ru_ru: ...и ещё

source: How many recent changes you want to view?
ru_ru: Сколько последних изменений необходимо показать?

source: Svn show recent changes
ru_ru: Показать последние изменения в SVN

source: Changes
ru_ru: Изменения

source: Unversioned Files
ru_ru: Файлы без версии

source: Source URL:
ru_ru: URL-адрес источника:

source: Target URL:
ru_ru: URL-адрес назначения:

source: Comment:
ru_ru: Комментарий:

source: &Login
ru_ru: &Войти

source: Ignore the following file patterns:
ru_ru: Игнорировать следующие шаблоны файлов:

source: When adding file(s) to project, add it to svn as well
ru_ru: При добавлении файлов в проект добавлять их также в SVN

source: Retag workspace after svn update, revert or applying patch
ru_ru: Выполнять переразметку рабочего пространства после обновления, отмены или применения исправлений SVN

source: When renaming a file in the project, rename it in the repository as well
ru_ru: При переименовании файла в проекте переименовывать его также в репозитории

source: Use POSIX Locale
ru_ru: Использовать региональные настройки POSIX

source: When checked, CodeLite will use the default "C" locale instead of the current locale. This will ensure that svn command line output is parsed properly.
ru_ru: Если флажок установлен, CodeLite будет использовать региональные настройки «C» по умолчанию вместо текущих региональных настроек. Это гарантирует, что данные, выводимые командной строкой SVN, будут проанализированы должным образом.

source: External Diff
ru_ru: Внешнее сравнение

source: Use external diff tool
ru_ru: Использовать внешний инструмент сравнения

source: External Diff Viewer:
ru_ru: Внешнее средство просмотра различий:

source: SSH Client
ru_ru: Клиент SSH

source: SSH Client arguments:
ru_ru: Аргументы клиента SSH:

source: The SSH client field should contain the command to be used by the SVN command line client for establishing a secured channel. For example, on Windows it should contain something like: /path/to/plink.exe -l <user name> -pw <svn password> If you don't need SSH channel, leave this field empty
ru_ru: Поле клиента SSH должно содержать команду, которая будет использоваться клиентом командной строки SVN для установления защищённого канала. Например, в Windows оно должно содержать подобную запись: /путь/к/plink.exe -l <имя пользователя> -pw <пароль SVN> Если вам не требуется канал SSH, оставьте это поле пустым

source: Integration
ru_ru: Интеграция

source: Auto Revision:
ru_ru: Автоматическое версионирование:

source: Add revision number as preprocessor definition in the compilation line
ru_ru: Добавлять номер версии как определение препроцессора в строке компиляции

source: Preprocessor name:
ru_ru: Имя препроцессора:

source: Root URL:
ru_ru: Корневой URL-адрес:

source: URL:
ru_ru: URL-адрес:

source: Revision:
ru_ru: Версия:

source: Date:
ru_ru: Дата:

source: URL of repository:
ru_ru: URL-адрес репозитория:

source: Checkout directory:
ru_ru: Каталог рабочей копии:

source: From revision:
ru_ru: От версии:

source: To revision:
ru_ru: До версии:

source: Create compact log
ru_ru: Создать краткий журнал

source: From Revision:
ru_ru: От версии:

source: To Revision:
ru_ru: До версии:

source: Ignore whitespaces
ru_ru: Игнорировать пробелы

source: Title
ru_ru: Заголовок

source: Bug URL Pattern:
ru_ru: Образец URL-адреса ошибки:

source: Enter here the URL for the bug details. For example: http://mytracker.com?bug_id=$(BUGID)
ru_ru: Введите здесь URL-адрес для получения подробной информации об ошибке. Например: http://mytracker.com?bug_id=$(BUGID)

source: Bug Message Pattern:
ru_ru: Образец сообщения об ошибке:

source: Enter here the message to add to the commit log. You may use the $(BUG_URL) and $(BUGID) macros. An example: "Fixed: BUG#$(BUGID), See $(BUG_URL) for more details"
ru_ru: Введите здесь сообщение для добавления в журнал фиксации. Вы можете использовать макросы $(BUG_URL) и $(BUGID). Пример: «Устранено: BUG#$(BUGID), см. $(BUG_URL) для получения дополнительной информации»

source: Feature URL Pattern:
ru_ru: Образец URL-адреса функции:

source: Enter here the URL for the feature request details. For example: http://mytracker.com?fr_id=$(FRID)
ru_ru: Введите здесь URL-адрес для подробной информации о запросе новых функций. Например: http://mytracker.com?fr_id=$(FRID)

source: Feature Message Pattern:
ru_ru: Образец сообщения функции:

source: Enter here the message to add to the commit log. You may use the $(FR_URL) and $(FRID) macros. An example: "Implements FR#$(FRID), See $(FR_URL) for more details"
ru_ru: Введите здесь сообщение для добавления в журнал фиксации. Вы можете использовать макросы $(FR_URL) и $(FRID). Пример: «Реализует FR#$(FRID), см. $(FR_URL) для получения дополнительной информации»

source: Do not change EOL, apply patch as it is
ru_ru: Не изменять конец строки, применить исправление как есть

source: Change to Windows style (CRLF)
ru_ru: Изменить на стиль Windows (CRLF)

source: Change to UNIX style (LF)
ru_ru: Изменить на стиль UNIX (LF)

source: Change patch line endings (EOL):
ru_ru: Изменять символы завершения строк исправлений (концы строк):

source: Select path:
ru_ru: Путь:

source: Recently used paths:
ru_ru: Последние использовавшиеся пути:

source: Create Svn Tag
ru_ru: Создать метку SVN

source: Login
ru_ru: Имя пользователя

source: Subversion Preferences
ru_ru: Параметры Subversion

source: Svn Info
ru_ru: Информация SVN

source: Svn Checkout
ru_ru: Получение репозитория из SVN

source: Svn Log
ru_ru: Журнал SVN

source: Svn Diff...
ru_ru: Сравнить с SVN...

source: Svn Properties...
ru_ru: Свойства SVN...

source: Select patch file:
ru_ru: Файл исправления:

source: Select Local Repository:
ru_ru: Локальный репозиторий:

source: Blame
ru_ru: Автор последнего изменения в строке

source: Subversion: Show Recent Changes
ru_ru: Subversion: показать последние изменения

source: No Files to Display
ru_ru: Нет файлов для отображения

source: Modified Files
ru_ru: Изменённые файлы

source: Added Files
ru_ru: Добавленные файлы

source: Deleted Files
ru_ru: Удалённые файлы

source: Conflicted Files
ru_ru: Конфликтующие файлы

source: Locked Files
ru_ru: Заблокированные файлы

source: MESSAGE: Another process is already running. MESSAGE: Ignoring last command.
ru_ru: СООБЩЕНИЕ: другой процесс уже выполняется. СООБЩЕНИЕ: игнорирование последней команды.

source: Choose directory
ru_ru: Выбрать каталог

source: Svn update
ru_ru: Обновить из SVN

source: Svn commit all changes
ru_ru: Отправить все изменения в SVN

source: Svn revert all changes
ru_ru: Отменить все изменения в SVN

source: Stop current svn process
ru_ru: Остановить текущий процесс SVN

source: Svn Cleanup
ru_ru: Очистка SVN

source: Clear Svn Output Tab
ru_ru: Очистить вкладку вывода SVN

source: Svn Settings...
ru_ru: Параметры SVN...

source: Select a Directory to View...
ru_ru: Выбрать каталог для просмотра...

source: Close View
ru_ru: Закрыть представление

source: Unversioned files (
ru_ru: Файлы, не включённые в систему управления версиями (

source: Revert
ru_ru: Отменить

source: Lock
ru_ru: Заблокировать

source: Unlock
ru_ru: Разблокировать

source: Resolve
ru_ru: Разрешить конфликты

source: Create Diff...
ru_ru: Создать список различий...

source: Blame...
ru_ru: Автор последнего изменения в строке...

source: Ignore this file
ru_ru: Игнорировать этот файл

source: Ignore this file pattern
ru_ru: Игнорировать этот образец файла

source: Create Tag
ru_ru: Создать метку

source: Create Branch
ru_ru: Создать ветвь

source: Switch URL...
ru_ru: Переключить URL-адрес...

source: Apply Patch...
ru_ru: Применить исправление...

source: Apply Patch - Dry Run...
ru_ru: Применить исправление — пробное выполнение...

source: Properties...
ru_ru: Свойства...

source: Nothing to commit!
ru_ru: Нет объектов для фиксации!

source: Delete the selected files?
ru_ru: Удалить выбранные файлы?

source: Using Subversion Click to open the Subversion view
ru_ru: Использование Subversion. Щёлкните, чтобы открыть представление Subversion

source: Svn rename...
ru_ru: Переименовать в SVN...

source: Working copy
ru_ru: Рабочая копия

source: HEAD version
ru_ru: Головная версия (HEAD)

source: Close SVN view?
ru_ru: Закрыть представление SVN?

source: <No repository path is selected>
ru_ru: <Путь к репозиторию не выбран>

source: The checkout directory '%s' already exists continue with the checkout?
ru_ru: Каталог рабочей копии «%s» уже существует продолжить получение?

source: ===== APPLYING PATCH - DRY RUN =====
ru_ru: ===== ПРИМЕНЕНИЕ ИСПРАВЛЕНИЯ — ПРОБНОЕ ВЫПОЛНЕНИЕ =====

source: ===== OUTPUT END =====
ru_ru: ===== КОНЕЦ ВЫВОДА =====

source: Loading Svn blame dialog...
ru_ru: Загрузка диалогового окна автора последнего изменения в строке SVN...

source: Aborted.
ru_ru: Прервано.

source: Failed to launch Subversion client.
ru_ru: Не удалось запустить клиент Subversion.

source: Select Executable:
ru_ru: Исполняемый файл:

source: Remove path
ru_ru: Удалить путь

source: Remove paths
ru_ru: Удалить пути

source: Root URL:
ru_ru: Корневой URL-адрес:

source: <not applicable>
ru_ru: <не применим>

source: Highlight this revision
ru_ru: Подсветить эту версию

source: Authentication failed. Retrying...
ru_ru: Сбой аутентификации. Повторная попытка...

source: Server certificate verification failed. Retrying...
ru_ru: Сбой проверки сертификата сервера. Повторная попытка...

source: Modified Paths:
ru_ru: Изменённые пути:

source: Diff:
ru_ru: Сравнение:

source: Feature Request ID:
ru_ru: Идентификатор запроса новых функций:

source: Bug ID:
ru_ru: Идентификатор ошибки:

source: <none detected>
ru_ru: <не обнаружен>

source: Root Directory:
ru_ru: Корневой каталог:

source: Exclude these file extensions:
ru_ru: Исключить эти расширения файлов:

source: Exclude binary (application/octet-stream) files
ru_ru: Исключить двоичные файлы (application/octet-stream)

source: Svn Commit
ru_ru: Фиксация изменений в SVN

source: Sync Workspace to SVN
ru_ru: Синхронизировать рабочее пространство c SVN

source: <No opened file>
ru_ru: <Нет открытых файлов>

source: >>> File truncated <<<
ru_ru: >>> Файл усечён <<<

source: Close file
ru_ru: Закрыть файл

source: Play
ru_ru: Воспроизвести

source: Detach window
ru_ru: Отсоединить окно

source: A Linux like tail command
ru_ru: Команда tail для Linux

source: Icon changes require a workspace reload
ru_ru: Изменение значков требует перезагрузку рабочего пространства

source: Tweak codelite
ru_ru: Оптимизация параметров CodeLite

source: Tweaks Plugin
ru_ru: Модуль Tweaks

source: Enable Tweaks
ru_ru: Включить Tweaks

source: Editor Tabs
ru_ru: Вкладки редактора

source: Configure Editor Tab Colours
ru_ru: Настройка цветов вкладок редактора

source: Customize your editor tab colours globally or per project
ru_ru: Настроить цвета вкладок редактора глобально или для каждого проекта

source: Global Tab Colours
ru_ru: Глобальные цвета вкладок

source: Tab Label Background Colour
ru_ru: Цвет фона метки вкладки

source: Tab Label Text Colour
ru_ru: Цвет текста метки вкладки

source: Tab Colours Per Project
ru_ru: Цвета вкладок для каждого проекта

source: &Reset colours
ru_ru: &Сброс цветов

source: Reset colours
ru_ru: Сбросить цвета

source: Configure Project Images
ru_ru: Настройка изображений проектов

source: Set a different image for a every project in the workspace
ru_ru: Установить разные изображения для каждого из проектов в рабочем пространстве

source: Tweaks Setting
ru_ru: Параметры Tweaks

source: Test name:
ru_ru: Имя теста:

source: The C++ name of the test
ru_ru: Имя C++ теста

source: Fixture name (optional):
ru_ru: Имя средства (необязательно):

source: Output file name (optional):
ru_ru: Имя выходного файла (необязательно):

source: The name of the file of which CodeLite will generate the test code. When left empty, CodeLite will use the first available source file in target project
ru_ru: Имя файла, из которого CodeLite сгенерирует тестовый код. Если оставить пустым, CodeLite будет использовать первый доступный исходный файл в целевом проекте

source: Project to whom this unit test should be added to:
ru_ru: Проект, в который должен быть добавлен этот модульный тест:

source: New Unit Test
ru_ru: Новый модульный тест

source: Class Name...
ru_ru: Имя класса…

source: Select the class to test from a list of classes
ru_ru: Выберите класс для тестирования из списка классов

source: Fixture (optional):
ru_ru: Средство (необязательно):

source: Output file (optional):
ru_ru: Выходной файл (необязательно):

source: Target UnitTest++ Project:
ru_ru: Целевой проект UnitTest++:

source: Functions to test:
ru_ru: Тестируемые функции:

source: Create UnitTests for Class
ru_ru: Создать модульные тесты для класса

source: There are no tests to generate
ru_ru: Нет тестов для создания

source: Could not find match for class '
ru_ru: Не удалось найти соответствие для класса'

source: Select class:
ru_ru: Класс:

source: A Unit test plugin based on the UnitTest++ framework
ru_ru: Модуль тестирования модулей на базе платформы UnitTest ++

source: Create new test...
ru_ru: Создать новый тест...

source: Create tests for class...
ru_ru: Создать тесты для класса...

source: Mark this project as UnitTest++ project
ru_ru: Отметить этот проект как проект UnitTest ++

source: Run Project as UnitTest++ and report
ru_ru: Выполнить проект как UnitTest ++ и отправить отчёт

source: Run Unit tests...
ru_ru: Выполнить модульные тесты...

source: Run project as unit test project...
ru_ru: Выполнить проект как проект модульного тестирования...

source: Create new &test...
ru_ru: Создать новый &тест...

source: Create tests for &class...
ru_ru: Создать тесты для &класса...

source: There are currently no UnitTest project in your workspace Would you like to create one now?
ru_ru: В настоящее время в вашем рабочем пространстве нет ни одного проекта UnitTest Создать его сейчас?

source: Could not find the target project
ru_ru: Не удалось найти целевой проект

source: Could not create target file '%s'
ru_ru: Не удалось создать конечный файл «%s»

source: Project contains 0 tests. Nothing to be done
ru_ru: Проект содержит 0 тестов. Нет действий для выполнения

source: Total tests:
ru_ru: Всего тестов:

source: Tests failed:
ru_ru: Непройденные тесты:

source: Tests passed:
ru_ru: Пройденные тесты:

source: Clear report...
ru_ru: Очистить отчёт...

source: Failed to launch NodeJS:
ru_ru: Не удалось запустить NodeJS:

source: Clear all breakpoints
ru_ru: Очистить все точки останова

source: Delete breakpoint
ru_ru: Удалить точку останова

source: Node.js: uncaught exception!
ru_ru: Node.js: неперехваченное исключение!

source: Copy Backtrace
ru_ru: Копировать обратную трассировку

source: Debug script
ru_ru: Отладка сценария

source: Script to debug:
ru_ru: Сценарий для отладки:

source: Execute script
ru_ru: Выполнить сценарий

source: Script to execute:
ru_ru: Сценарий для выполнения:

source: Show hidden files
ru_ru: Показать скрытые файлы

source: Open package.json
ru_ru: Открыть package.json

source: Debug...
ru_ru: Отладка...

source: Failed to load package.json file from path:
ru_ru: Не удалось загрузить package.json файл из пути:

source: Could not instantiate a debugger for your NodeJS version!
ru_ru: Не удалось создать экземпляр отладчика для вашей версии NodeJS!

source: Enable XML code completion
ru_ru: Включить автозавершение XML-кода

source: Enable HTML code completion
ru_ru: Включить автозавершение HTML-кода

source: nodejs path:
ru_ru: Путь к nodejs:

source: Set the path to Node.js executable
ru_ru: Укажите путь к исполняемому файлу Node.js

source: npm path:
ru_ru: Путь к npm:

source: Set the path to npm executable
ru_ru: Укажите путь к исполняемому файлу npm

source: Node.js executable:
ru_ru: Исполняемый файл Node.js:

source: Select Node.js executable
ru_ru: Выберите исполняемый файл Node.js

source: Select the script to execute
ru_ru: Выберите сценарий для выполнения

source: Debugger port:
ru_ru: Порт отладчика:

source: Command line arguments:
ru_ru: Аргументы командной строки:

source: Pass command line arguments to Node.js Place each argument on its own line
ru_ru: Передайте аргументы командной строки Node.js Поместите каждый аргумент на отдельную строку

source: Create the workspace in a separate directory
ru_ru: Создать рабочее пространство в отдельном каталоге

source: Callstack
ru_ru: Стек вызовов

source: Where
ru_ru: Расположение

source: WebTools Settings
ru_ru: Параметры WebTools

source: Node.js Debugger
ru_ru: Отладчик Node.js

source: Support for JavaScript, CSS/SCSS, HTML, XML and other web development tools
ru_ru: Поддержка JavaScript, CSS/SCSS, HTML, XML и других средств веб-разработки

source: WebTools
ru_ru: Модуль WebTools

source: Enable Word Completion plugin?
ru_ru: Включить модуль автодополнения слов?

source: Starts With
ru_ru: Начинается с

source: Contains
ru_ru: Содержит

source: Comparison Method
ru_ru: Метод сравнения

source: Select the word completion comparison method: "Starts With" - suggest all words that starts with the partial word that the user typed "Contains" - suggest all words that contains the partial word that the user typed
ru_ru: Выберите метод автодополнения слов: «Начинается с» — предлагает все слова, которые начинаются с части слова, введённой пользователем «Содержит» — предлагает все слова, которые содержат часть слова, введённую пользователем

source: Word Completion Settings
ru_ru: Параметры модуля автодополнения слов

source: Suggest completion based on words typed in the editors
ru_ru: Предлагает автодополнение на основе слов, введённых в редакторах

source: Suggest completion based on words typed in the editor
ru_ru: Предлагает автодополнение на основе слов, введённых в редакторах

source: Word Completion
ru_ru: Автодополнение слов

source: Enable ZoomNavigator
ru_ru: Включить ZoomNavigator

source: Highlight colour:
ru_ru: Цвет выделения:

source: Zoom factor:
ru_ru: Коэффициент масштабирования:

source: Sets the preview pane zoom factor. Valid values should be in the range of -10 and 20
ru_ru: Устанавливает коэффициент масштабирования области предварительного просмотра. Допустимые значения должны быть в диапазоне от -10 до 20

source: Use vertical scrollbar:
ru_ru: Использовать вертикальную полосу прокрутки:

source: ZoomNavigator Settings
ru_ru: Параметры ZoomNavigator

source: Zoom Navigator
ru_ru: Модуль Zoom Navigator

source: A dockable pane that shows a zoomed-out view of your code.
ru_ru: Закрепляемая область, которая показывает уменьшенное представление вашего кода.

source: Enable plugin
ru_ru: Включить модуль

source: Abbreviation plugin
ru_ru: Модуль сокращений

source: Show abbreviations completion box
ru_ru: Показать поле автозавершения сокращений

source: Abbreviation
ru_ru: Сокращение

source: Abbreviations
ru_ru: Сокращения

source: You can use the '|' (pipe) character to set the caret position You may also use any of the known macros to CodeLite (click the 'Help' button)
ru_ru: Можно использовать символ «|» (вертикальная черта) для установки позиции курсора Можно также использовать любые из известных CodeLite макросов (нажмите кнопку «Справка»)

source: Create a new abbreviation
ru_ru: Создать новое сокращение

source: Delete the currently selected abbreviation
ru_ru: Удалить выбранное сокращение

source: Import abbreviations from the file system...
ru_ru: Импорт сокращений из файловой системы...

source: Export
ru_ru: Экспорт

source: Export abbreviations to the file system...
ru_ru: Экспорт сокращений в файловую систему...

source: Immediate Insert
ru_ru: Непосредственная вставка

source: Save changes
ru_ru: Сохранить изменения

source: Show available macros
ru_ru: Показать доступные макросы

source: Abbreviations Settings...
ru_ru: Параметры сокращений...

source: Abbreviation Name:
ru_ru: Название сокращения:

source: New abbreviation...
ru_ru: Новое сокращение...

source: An abbreviation with this name already exists!
ru_ru: Сокращение с таким именем уже существует!

source: Are you sure you want to delete '%s'
ru_ru: Вы уверены, что хотите удалить «%s»?
