Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Respond to a wxEVT_COMMAND_TEXT_UPDATED event, generated when the text changes. Notice that this event will be sent when the text controls contents changes - whether this is due to user input or comes from the program itself (for example, if SetValue() is called); see ChangeValue() for a function which does not send this event.
ru_ru: Отвечать на событие wxEVT_COMMAND_TEXT_UPDATED, создаваемое при изменении текста. Обратите внимание, что это событие будет отправлено после изменения содержимого текстовых элементов управления — независимо от того, обусловлено ли это вводом данных пользователем или самой программой (например, при вызове SetValue()); чтобы не отправлять это событие, воспользуйтесь функцией ChangeValue().

source: Respond to a wxEVT_COMMAND_TEXT_ENTER event, generated when enter is pressed in a text control (which must have wxTE_PROCESS_ENTER style for this event to be generated).
ru_ru: Отвечать на событие wxEVT_COMMAND_TEXT_ENTER, создаваемое при нажатии клавиши «Ввод» в текстовом элементе управления (чтобы это событие было создано, он должен иметь стиль wxTE_PROCESS_ENTER).

source: Process wxEVT_SCROLL_TOP scroll-to-top events (minimum position)
ru_ru: Обрабатывать события прокрутки наверх wxEVT_SCROLL_TOP (в минимальную позицию).

source: Process wxEVT_SCROLL_BOTTOM scroll-to-bottom events (maximum position).
ru_ru: Обрабатывать события прокрутки вниз wxEVT_SCROLL_BOTTOM (в максимальную позицию).

source: Process wxEVT_SCROLL_LINEUP line up events.
ru_ru: Обрабатывать события перемещения на строку вверх wxEVT_SCROLL_LINEUP.

source: Process wxEVT_SCROLL_LINEDOWN line down events.
ru_ru: Обрабатывать события перемещения на строку вниз wxEVT_SCROLL_LINEDOWN.

source: Process wxEVT_SCROLL_PAGEUP page up events.
ru_ru: Обрабатывать события перемещения на страницу вверх wxEVT_SCROLL_PAGEUP.

source: Process wxEVT_SCROLL_PAGEDOWN page down events
ru_ru: Обрабатывать события перемещения на страницу вниз wxEVT_SCROLL_PAGEDOWN.

source: Process wxEVT_SCROLL_THUMBTRACK thumbtrack events (frequent events sent as the user drags the thumbtrack).
ru_ru: Обрабатывать события перемещения ползунка wxEVT_SCROLL_THUMBTRACK (частые события, отправляемые при перетаскивании пользователем ползунка полосы прокрутки).

source: Process wxEVT_SCROLL_THUMBRELEASE thumb release events.
ru_ru: Обрабатывать события отпускания ползунка wxEVT_SCROLL_THUMBRELEASE.

source: Process wxEVT_SCROLL_CHANGED end of scrolling events (MSW only).
ru_ru: Обрабатывать события конца прокрутки wxEVT_SCROLL_CHANGED (только для Microsoft Windows).

source: The position of the scrollbar in scroll units.
ru_ru: Позиция полосы прокрутки в шагах прокрутки.

source: The size of the thumb, or visible portion of the scrollbar, in scroll units.
ru_ru: Размер ползунка или видимой части полосы прокрутки в шагах прокрутки.

source: The maximum position of the scrollbar.
ru_ru: Максимальная позиция полосы прокрутки.

source: The size of the page size in scroll units. This is the number of units the scrollbar will scroll when it is paged up or down. Often it is the same as the thumb size.
ru_ru: Размер страницы в шагах прокрутки. Это количество шагов, на которое прокручивается полоса прокрутки при перемещении на страницу вверх или вниз. Он часто совпадает с размером ползунка.

source: Pixels per scroll unit in the horizontal direction
ru_ru: Пикселей на шаг прокрутки в горизонтальном направлении

source: Pixels per scroll unit in the vertical direction
ru_ru: Пикселей на шаг прокрутки в вертикальном направлении

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_TOP scroll-to-top events
ru_ru: Начиная с версии 2.9.X wxWidgets Обрабатывать события прокрутки наверх wxEVT_SCROLLWIN_TOP

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_BOTTOM scroll-to-bottom events
ru_ru: Начиная с версии 2.9.X wxWidgets Обрабатывать события прокрутки вниз wxEVT_SCROLLWIN_BOTTOM

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_LINEUP line up events.
ru_ru: Начиная с версии 2.9.X wxWidgets Обрабатывать события перемещения на строку вверх wxEVT_SCROLLWIN_LINEUP.

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_LINEDOWN line down events
ru_ru: Начиная с версии 2.9.X wxWidgets Обрабатывать события перемещения на строку вниз wxEVT_SCROLLWIN_LINEDOWN

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_PAGEUP page up events
ru_ru: Начиная с версии 2.9.X wxWidgets Обрабатывать события перемещения на страницу вверх wxEVT_SCROLLWIN_PAGEUP

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_PAGEDOWN page down events
ru_ru: Начиная с версии 2.9.X wxWidgets Обрабатывать события перемещения на страницу вниз wxEVT_SCROLLWIN_PAGEDOWN

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_THUMBTRACK thumbtrack events (frequent events sent as the user drags the thumbtrack)
ru_ru: Начиная с версии 2.9.X wxWidgets Обрабатывать события перемещения ползунка wxEVT_SCROLLWIN_THUMBTRACK (частые события, отправляемые при перетаскивании пользователем ползунка полосы прокрутки)

source: Since wxWidgets 2.9.X Process wxEVT_SCROLLWIN_THUMBRELEASE thumb release events
ru_ru: Начиная с версии 2.9.X wxWidgets Обрабатывать события отпускания ползунка wxEVT_SCROLLWIN_THUMBRELEASE

source: Default text value.
ru_ru: Текстовое значение по умолчанию

source: Show the 'Cancel' button
ru_ru: Показать кнопку «Отмена»

source: Show the 'Search' button
ru_ru: Показать кнопку «Поиск»

source: Respond to a wxEVT_COMMAND_SEARCHCTRL_SEARCH_BTN event generated when the search button is clicked. Note that this does not initiate a search.
ru_ru: Отвечать на событие wxEVT_COMMAND_SEARCHCTRL_SEARCH_BTN, создаваемое при нажатии кнопки поиска. Обратите внимание, что это не запускает поиск.

source: Respond to a wxEVT_COMMAND_SEARCHCTRL_CANCEL_BTN event, generated when the cancel button is clicked.
ru_ru: Отвечать на событие wxEVT_COMMAND_SEARCHCTRL_CANCEL_BTN, создаваемое при нажатии кнопки отмены.

source: Set the same effect to use for both showing and hiding the pages
ru_ru: Установить одно и то же действие для показа и скрытия страниц

source: Minimum slider value
ru_ru: Минимальное значение ползунка

source: Maximum slider value
ru_ru: Максимальное значение ползунка

source: The spacer's size: width,height
ru_ru: Размер разделителя: ширина,высота

source: Generated when left/up arrow is pressed.
ru_ru: Создаётся при нажатии стрелки влево или стрелки вверх.

source: Generated when right/down arrow is pressed.
ru_ru: Создаётся при нажатии стрелки вправо или стрелки вниз.

source: Generated whenever an arrow is pressed.
ru_ru: Создаётся при каждом нажатии стрелки.

source: The initial value
ru_ru: Начальное значение

source: Minimal value
ru_ru: Минимальное значение

source: Maximal value
ru_ru: Максимальное значение

source: Generated whenever the numeric value of the spinctrl is updated
ru_ru: Создаётся при каждом обновлении числового значения spinctrl

source: Sets the split mode
ru_ru: Устанавливает режим разделения

source: Gravity is real factor which controls position of sash while resizing wxSplitterWindow.
ru_ru: Гравитация — действительный коэффициент, который влияет на положение управляющего элемента для изменения размера окна при изменении размера wxSplitterWindow.

source: Gravity tells wxSplitterWindow how much will left/top window grow while resizing.
ru_ru: Гравитация указывает wxSplitterWindow, насколько увеличится верхнее окно слева при изменении размера.

source: 0.0 - only the bottom/right window is automatically resized
ru_ru: 0.0 — автоматически изменяется только нижнее или правое окно

source: Example values:
ru_ru: Примеры значений:

source: 0.5 - both windows grow by equal size
ru_ru: 0.5 — оба окна увеличиваются одинаково

source: 1.0 - only left/top window grows
ru_ru: 1.0 — увеличивается только левое или верхнее окно

source: (Gravity should be a real value between 0.0 and 1.0)
ru_ru: (Гравитация должна быть действительным значением от 0.0 до 1.0)

source: Sets the minimum pane size
ru_ru: Устанавливает минимальный размер панели

source: Sets the sash initial position
ru_ru: Устанавливает начальное положение управляющего элемента для изменения размера окна

source: The sash position is in the process of being changed
ru_ru: Выполняется изменение положения управляющего элемента для изменения размера окна

source: The sash position was changed
ru_ru: Положение управляющего элемента для изменения размера окна было изменено

source: The splitter has been just unsplit
ru_ru: Разделение только что было отменено

source: The sash was double clicked. The default behaviour is to unsplit the window when this happens (unless the minimum pane size has been set to a value greater than zero)
ru_ru: Выполнен двойной щелчок по управляющему элементу для изменения размера окна. Поведение по умолчанию при выполнении этого действия заключается в отмене разделения окна (если только для минимального размера панели не было установлено значение больше нуля)

source: Label:
ru_ru: Метка:

source: Wrap the text after N pixels. If set to -1, don't wrap
ru_ru: Переносить текст после N пикселей. Не переносить, если установлено значение -1

source: Sets the number of fields
ru_ru: Устанавливает число полей

source: If you used SCI_SETLEXER(SCLEX_CONTAINER) to make the container act as the lexer you will receive this notification when Scintilla is about to display or print text that requires styling
ru_ru: Если вы использовали SCI_SETLEXER(SCLEX_CONTAINER), чтобы контейнер работал в качестве лексического анализатора, вы получите это уведомление перед тем, как программа Scintilla отобразит или напечатает текст, требующий форматирования

source: A char was added
ru_ru: Символ был добавлен

source: Sent to the container when the save point is entered allowing the container to display a "document saved" indicator and change its menus
ru_ru: Отправляется контейнеру при входе в точку сохранения, позволяя контейнеру отобразить индикатор «Документ сохранён» и изменить меню

source: Sent to the container when the save point is left allowing the container to display a "document dirty" indicator and change its menus
ru_ru: Отправляется контейнеру при выходе из точки сохранения, позволяя контейнеру отобразить индикатор «Документ содержит несохранённые изменения» и изменить меню

source: An attempt to modify a read-only document was made
ru_ru: Осуществлена попытка изменения документа, доступного только для чтения

source: Key was pressed
ru_ru: Клавиша была нажата

source: Double-click
ru_ru: Двойной щелчок

source: Update UI
ru_ru: Обновить пользовательский интерфейс

source: Document modified
ru_ru: Документ изменён

source: Macro record started/stopped
ru_ru: Запись макроса начата/остановлена

source: One of margins was left clicked with the mouse
ru_ru: По одному из полей выполнен щелчок левой кнопкой мыши

source: Scintilla has determined that a range of lines that is currently invisible should be made visible
ru_ru: Scintilla определила, что диапазон строк, который в настоящий момент не отображается, следует отображать

source: Painting has just been done. Useful when you want to update some other widgets based on a change in Scintilla but want to have the paint occur first to appear more responsive
ru_ru: Отрисовка выполнена. Полезно, когда вам необходимо обновить другие виджеты на основе изменений в Scintilla, но сначала требуется выполнить отрисовку для визуального ускорения ответа

source: The user has selected an item in a user list.
ru_ru: Пользователь выбрал элемент пользовательского списка

source: Only on the GTK+ version. Indicates that the user has dragged a URI such as a file name or Web address onto Scintilla
ru_ru: Только в версии GTK+. Указывает, что пользователь выполнил перетаскивание URI, такого как имя файла или веб-адрес, в Scintilla

source: Generated when the user keeps the mouse in one position for the dwell period
ru_ru: Создаётся при удерживании пользователем указателя мыши в одном положении во время ожидания

source: Generated after a wxEVT_STC_DWELLSTART and the mouse is moved or other activity such as key press indicates the dwell is over
ru_ru: Создаётся после wxEVT_STC_DWELLSTART и перемещения указателя мыши или другого действия (например, нажатия клавиши), указывающего на окончание ожидания

source: Drag and Drop start event
ru_ru: Событие начала перетаскивания

source: Drag and Drop over event
ru_ru: Событие окончания перетаскивания

source: Drag and Drop drop event
ru_ru: Событие сброса перетаскивания

source: This event is generated when the user zooms the display using the keyboard
ru_ru: Событие создаётся при изменении пользователем масштаба экрана с помощью клавиатуры

source: A hotspot was clicked
ru_ru: Выполнен щелчок по активной зоне

source: A hotspot was double clicked
ru_ru: Выполнен двойной щелчок по активной зоне

source: The calltip window was clicked
ru_ru: Выполнен щелчок по окну подсказки

source: Auto-completion list selection was made
ru_ru: Сделан выбор в списке автодополнения

source: User clicked the mouse on a text that has an indicator
ru_ru: Пользователь щёлкнул кнопкой мыши по тексту с индикатором

source: User released the mouse on a text that has an indicator
ru_ru: Пользователь отпустил кнопку мыши на тексте с индикатором

source: Auto completion list was cancelled
ru_ru: Выбор в списке автодополнения отменён

source: The user deleted a character while auto-completion list was active
ru_ru: Пользователь удалил символ, пока список автодополнения был активен

source: Wrap text
ru_ru: Перенести текст

source: Display indentation guides (vertical lines)
ru_ru: Показать направляющие отступа (вертикальные линии)

source: EOL Mode
ru_ru: Режим конца строки

source: Display the line endings characters
ru_ru: Отобразить символы завершения строк

source: Set the wxStyledTextCtrl lexer. The lexer affects the syntax highlight of control
ru_ru: Установить лексический анализатор wxStyledTextCtrl. Лексический анализатор влияет на подсветку синтаксиса элемента управления

source: Set the basic styles font
ru_ru: Установить основной шрифт для стилей

source: Keywords
ru_ru: Ключевые слова

source: Keywords set 1
ru_ru: Набор ключевых слов 1

source: Keywords set 2
ru_ru: Набор ключевых слов 2

source: Keywords set 3
ru_ru: Набор ключевых слов 3

source: Keywords set 4
ru_ru: Набор ключевых слов 4

source: Keywords set 5
ru_ru: Набор ключевых слов 5

source: Set the wxTaskBarIcon tooltip
ru_ru: Установить подсказку wxTaskBarIcon

source: The iconType is only applicable on wxOSX_Cocoa
ru_ru: IconType применим только для wxOSX_Cocoa

source: Set the wxTaskBarIcon icon
ru_ru: Установить значок wxTaskBarIcon

source: Process a wxEVT_TASKBAR_MOVE event
ru_ru: Обрабатывать событие wxEVT_TASKBAR_MOVE

source: Process a wxEVT_TASKBAR_LEFT_DOWN event
ru_ru: Обрабатывать событие wxEVT_TASKBAR_LEFT_DOWN

source: Process a wxEVT_TASKBAR_LEFT_UP event
ru_ru: Обрабатывать событие wxEVT_TASKBAR_LEFT_UP

source: Process a wxEVT_TASKBAR_RIGHT_DOWN event
ru_ru: Обрабатывать событие wxEVT_TASKBAR_RIGHT_DOWN

source: Process a wxEVT_TASKBAR_RIGHT_UP event
ru_ru: Обрабатывать событие wxEVT_TASKBAR_RIGHT_UP

source: Process a wxEVT_TASKBAR_LEFT_DCLICK event
ru_ru: Обрабатывать событие wxEVT_TASKBAR_LEFT_DCLICK

source: Process a wxEVT_TASKBAR_RIGHT_DCLICK event
ru_ru: Обрабатывать событие wxEVT_TASKBAR_RIGHT_DCLICK

source: User tried to enter more text into the control than the limit set by SetMaxLength.
ru_ru: Пользователь попытался ввести в элемент управления текст, длина которого превышает ограничение, установленное SetMaxLength.

source: A mouse event occurred over an URL in the text control (wxMSW and wxGTK2 only)
ru_ru: Событие мыши на URL-адресе произошло в текстовом элементе управления (только для wxMSW и wxGTK2)

source: Default text control value
ru_ru: Значение по умолчанию текстового элемента управления

source: The maximum length of user entered text. Only for single-line wxTextCtrls.
ru_ru: Максимальная длина текста, вводимого пользователем. Только для однострочных wxTextCtrl.

source: Enable spell checking using the operating system provided text proofing tools. This function is only available on OSX, Windows 8 (or newer), and GTK3 (or newer).
ru_ru: Включить проверку орфографии с помощью инструментов корректуры текста, предоставляемых операционной системой. Эта функция доступна только в OSX, Windows 8 (или более новой версии) и GTK3 (или более новой версии).

source: Enable auto-completion of the text using the file system directories. Notice that currently this function is only implemented in wxMSW port and does nothing under the other platforms.
ru_ru: Включить автодополнение текста с использованием каталогов файловой системы. Обратите внимание, что в настоящий момент эта функция реализована только в порте wxMSW и не выполняет никаких действий на других платформах.

source: Enable auto-completion of the text typed in a single-line text control using all valid file system path. Notice that currently this function is only implemented in wxMSW port and does nothing under the other platforms.
ru_ru: Включить автодополнение текста, набираемого в однострочном текстовом элементе управления, с использованием всех допустимых путей файловой системы. Обратите внимание, что в настоящий момент эта функция реализованатолько в порте wxMSW и не выполняет никаких действий на других платформах.

source: Control name
ru_ru: Имя элемента управления

source: Sets the current interval for the timer (in milliseconds)
ru_ru: Устанавливает текущий интервал таймера (в миллисекундах)

source: Start the timer
ru_ru: Запустить таймер

source: A one shot timer - sets whether the timer event is called repeatedly or only once
ru_ru: Разовый таймер — определяет, будет ли событие таймера вызываться многократно или только один раз

source: Process a timer event
ru_ru: Обрабатывать событие таймера

source: Process a wxEVT_COMMAND_TOOL_CLICKED event (a synonym for wxEVT_COMMAND_MENU_SELECTED). Pass the id of the tool
ru_ru: Обрабатывать событие wxEVT_COMMAND_TOOL_CLICKED (синоним для wxEVT_COMMAND_MENU_SELECTED). Передавать идентификатор инструмента

source: Process a wxEVT_COMMAND_TOOL_DROPDOWN_CLICKED event
ru_ru: Обрабатывать событие wxEVT_COMMAND_TOOL_DROPDOWN_CLICKED

source: ToolBar Item
ru_ru: Элемент панели инструментов

source: The tool label
ru_ru: Метка инструмента

source: Tool Label
ru_ru: Метка инструмента

source: Short help string. This will appear as the tool's tooltip
ru_ru: Короткая строка справки. Будет отображаться как подсказка для инструмента

source: Long help string. This will be displayed in the statusbar
ru_ru: Длинная строка справки. Будет отображаться в строке состояния

source: Bitmap
ru_ru: Значок

source: Disabled bitmap
ru_ru: Значок отключённого элемента управления

source: The tool kind
ru_ru: Тип инструмента

source: Use wxCrafter to construct the menu called by the dropdown
ru_ru: Использовать wxCrafter для создания меню, вызываемого при открытии раскрывающегосясписка

source: Process a wxEVT_COMMAND_AUITOOLBAR_TOOL_DROPDOWN event
ru_ru: Обрабатывать событие wxEVT_COMMAND_AUITOOLBAR_TOOL_DROPDOWN

source: ToolBar Item Separator
ru_ru: Разделитель элементов панели инструментов

source: ToolBar Item Space
ru_ru: Пространство для элемента панели инструментов

source: AuiToolBar Item Space
ru_ru: Пространство для элемента панели инструментов AUI

source: The width of the space in pixels
ru_ru: Ширина пространства в пикселях

source: How stretchable the space is. The normal value is 1.
ru_ru: Степень растягиваемости пространства. Обычное значение — 1.

source: wxAuiToolBar Label
ru_ru: Метка wxAuiToolBar

source: My toolbar label
ru_ru: Моя метка панели инструментов

source: The label's text
ru_ru: Текст метки

source: Optionally, specify the label's width
ru_ru: Указать ширину метки (необязательно)

source: The control size. It is recommended to leave it as -1,-1 and let the sizers calculate the best size for the window
ru_ru: Размер элемента управления. Рекомендуется оставить значение -1,-1 и использовать сайзеры для расчёта оптимального размера окна

source: C++ member name
ru_ru: Имя члена C++

source: ToolBar
ru_ru: Панель инструментов

source: Sets the default size of each tool bitmap
ru_ru: Устанавливает размер по умолчанию для значка каждого инструмента.

source: Sets the values to be used as margins for the toolbar.
ru_ru: Устанавливает значения, которые будут использоваться в качестве полей для панели инструментов.

source: Sets the space between tools.
ru_ru: Устанавливает пространство между инструментами.

source: Sets the width of separators.
ru_ru: Устанавливает ширину разделителей.

source: Subclass
ru_ru: Подкласс

source: The name of the derived class. Used both for C++ and XRC generated code.
ru_ru: Имя производного класса. Используется для создаваемого кода C++ и XRC.

source: (C++ only) The name of any extra header file to be #included e.g. mydialog.hpp
ru_ru: Имя любого дополнительного включаемого заголовочного файла, например mydialog.hpp (только для C++)

source: Override the default class style with the content of this field. The style should be | separated
ru_ru: Заменить стиль класса по умолчанию содержимым этого поля. Стиль следует отделить с помощью символа «|»

source: Set the values to be used as margins for the toolbar.
ru_ru: Установить значения, которые будут использоваться в качестве полей для панели инструментов.

source: Process a wxEVT_MAXIMIZE event
ru_ru: Обрабатывать событие wxEVT_MAXIMIZE

source: Process a wxEVT_MOVE event, which is generated when a window is moved
ru_ru: Обрабатывать событие wxEVT_MOVE, создаваемое при перемещении окна

source: Process a wxEVT_MOVE_START event, which is generated when the user starts to move or size a window. Windows only
ru_ru: Обрабатывать событие wxEVT_MOVE_START, создаваемое после начала перемещения или изменения размера окна пользователем. Только для Windows

source: Process a wxEVT_MOVE_END event, which is generated when the user stops moving or sizing a window. Windows only
ru_ru: Обрабатывать событие wxEVT_MOVE_END, создаваемое после прекращения перемещения или изменения размера окна пользователем. Только для Windows

source: Process a wxEVT_SHOW event
ru_ru: Обрабатывать событие wxEVT_SHOW

source: When enabled, the generated code will add support for wxPersistenceManager (i.e. the Window will remember its size, position and any child wxBookCtrlBase control will remember its selection)
ru_ru: Если включено, создаваемый код добавит поддержку wxPersistenceManager (т.е. окно будет запоминать свой размер и положение, и любой дочерний элемент управления wxBookCtrlBase будет запоминать свой выбор)

source: The title, if any
ru_ru: Заголовок, если имеется

source: CodeLite's virtual folder for the generated files
ru_ru: Виртуальная папка CodeLite для создаваемых файлов

source: Centre on parent. This may be in both dimensions (the default); only vertically or horizontally; or not at all.
ru_ru: Центрировать по родительскому объекту. Центрирование может выполняться по обоим направлениям (по умолчанию); выполняться только по вертикали или горизонтали; не выполняться вообще.

source: Inherited class name Fill this field to generate a class that inherits from the base class, where you should place all your application logic. e.g. for a generated class 'FooDialogBase', you might enter 'FooDialog' here.
ru_ru: Имя унаследованного класса Заполните это поле для создания класса, который наследуется от базового класса, где вам следует разместить всю логику вашего приложения. Например, для создаваемого класса «FooDialogBase» здесь можно ввести «FooDialog».
