Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: If you enter a non-zero value here, the diff will use that parent of the commit instead of the commit itself. So if the commit is HEAD, entering 5 will use HEAD~5, the fifth parent.
ru_ru: Если ввести здесь ненулевое значение, в списке различий будет использоваться родительский элемент фиксации вместо самой фиксации. Таким образом, если фиксация — HEAD, при вводе 5 будет использоваться HEAD~5, пятый родительский элемент.

source: Clone URL:
ru_ru: URL-адрес для клонирования:

source: git URL to clone
ru_ru: URL-адрес Git для клонирования

source: Target Directory:
ru_ru: Целевой каталог:

source: Clone the sources into this target directory
ru_ru: Клонируйте исходные файлы в этот целевой каталог

source: Select patch file
ru_ru: Выбрать файл исправления

source: Patch file to apply
ru_ru: Файл исправления, который следует применить

source: git apply additional flags to use:
ru_ru: Дополнительные флаги git apply, которые следует использовать:

source: By default, codelite uses the command 'git apply --whitespace=nowarn --ignore-whitespace' for applying patch files. Set here an extra flags to use with this command, e.g.: --reverse See the git manual for more options
ru_ru: По умолчанию CodeLite использует команду «git apply --whitespace=nowarn --ignore-whitespace» для применения файлов исправлений. Укажите здесь дополнительные флаги, которые следует использовать с этой командой,например: --reverse Больше вариантов доступно в руководстве Git

source: Untracked
ru_ru: Неотслеживаемые

source: Go backwards to earlier commit's blame
ru_ru: Вернуться к автору последнего изменения в строке для более ранней фиксации

source: Show earlier commit's blame
ru_ru: Показать автора последнего изменения в строке для более ранней фиксации

source: Go forward to more-recent commit's blame
ru_ru: Перейти к автору последнего изменения в строке для более поздней фиксации

source: Show next-seen commit's blame
ru_ru: Показать автора последнего изменения в строке для следующей по порядку фиксации

source: Previously-visited commits. Note that these are listed in the order that you visited them, not commit-date order.
ru_ru: Ранее посещённые фиксации. Обратите внимание, что они перечислены в том порядке, в котором вы посетили их, а не в хронологическом порядке фиксации.

source: Extra arguments:
ru_ru: Дополнительные аргументы:

source: Optional extra arguments that you wish passed to git blame. An example might be: -L 100,130 Note that this is _not_ sanity-checked, it's added just as it is.
ru_ru: Необязательные дополнительные аргументы, которые следует передать git blame. Например: -L 100,130 Обратите внимание, что такой аргумент _не_ проверяется на корректность, а просто добавляется как есть.

source: Redo the current commit's blame
ru_ru: Повторить получение автора последнего изменения в строке для текущей фиксации

source: Double-clicking a line shows blame for the parent commit
ru_ru: Двойной щелчок по строке показывает автора последнего изменения в строке для родительской фиксации

source: A double-click on a code line refreshes blame, rebasing it either to the commit clicked or to its parent commit. Most of the time you will want to see what the code looked like earlier, so will want the parent commit.
ru_ru: Двойной щелчок по строке кода обновляет автора последнего изменения в строке, перемещая его либо в фиксацию, по которой был сделан щелчок, либо в её родительскую фиксацию. Чаще всего требуется посмотреть, как выглядел код раньше, поэтому вам понадобится родительская фиксация.

source: Show the log and diff for the selected commit
ru_ru: Показать журнал и список различий для выбранной фиксации

source: When a blame line is selected, the commit log message and diff are shown at the bottom of the dialog. Uncheck this box to hide those fields.
ru_ru: При выборе строки автора последнего изменения в строке сообщение журнала и список различий фиксаций показываются в нижней части диалогового окна. Снимите этот флажок, чтобы скрыть эти поля.

source: These are the file(s) you have chosen to Reset
ru_ru: Это файл(ы), которые вы выбрали для сброса

source: Altered files
ru_ru: Изменённые файлы

source: These are the files that are altered. Select which you want to reset.
ru_ru: Это файлы, которые были изменены. Выберите те, которые следует сбросить.

source: Added files
ru_ru: Добавленные файлы

source: These are the files that have been added. Select which you want to remove.
ru_ru: Это файлы, которые были добавлены. Выберите те, которые следует удалить.

source: Please tell me who you are:
ru_ru: Укажите ваши личные данные:

source: Email:
ru_ru: Электронная почта:

source: Git settings...
ru_ru: Параметры Git...

source: Commit List
ru_ru: Список фиксаций

source: Current Diffs
ru_ru: Текущие различия

source: Select Commits to Diff
ru_ru: Выбрать фиксации для сравнения

source: File diff
ru_ru: Сравнение файлов

source: Git Apply Patch
ru_ru: Применить исправление

source: Git Blame Settings
ru_ru: Параметры git blame

source: Git Reset Files
ru_ru: Отменить изменения в файлах

source: Git User
ru_ru: Пользователь Git

source: Artistic Style has terminated
ru_ru: Утилита Artistic Style завершила работу

source: Formatted %s
ru_ru: Выполнено форматирование %s

source: Unchanged %s
ru_ru: Без изменений %s

source: Cannot process UTF-32 encoding
ru_ru: Не удалось обработать кодировку UTF-32

source: Cannot open directory
ru_ru: Не удалось открыть каталог

source: Exclude %s
ru_ru: Исключить %s

source: Cannot open HTML file %s
ru_ru: Не удалось открыть HTML-файл %s

source: Opening HTML documentation %s
ru_ru: Открытие HTML-документации %s

source: Command execute failure
ru_ru: Ошибка выполнения команды

source: Command is not installed
ru_ru: Команда не установлена

source: Missing filename in %s
ru_ru: Имя файла отсутствует в %s

source: Recursive option with no wildcard
ru_ru: Параметр рекурсивности без подстановочного знака

source: Did you intend quote the filename
ru_ru: Заключить имя файла в кавычки?

source: Directory %s
ru_ru: Каталог %s

source: Exclude (unmatched) %s
ru_ru: Исключить (несопоставленный) %s

source: Did you intend to use --recursive
ru_ru: Использовать --recursive?

source: No file to process %s
ru_ru: Нет файлов для обработки %s

source: Invalid option file options:
ru_ru: Недопустимые параметры файла параметров:

source: Cannot open options file
ru_ru: Не удалось открыть файл параметров

source: For help on options type 'astyle -h'
ru_ru: Для получения справки по параметрам введите «astyle -h»

source: Invalid command line options:
ru_ru: Недопустимые параметры командной строки:

source: Using default options file %s
ru_ru: Использование файла параметров по умолчанию %s

source: %s formatted %s unchanged
ru_ru: %s отформатировано %s без изменений

source: seconds
ru_ru: сек

source: %d min %d sec
ru_ru: %d мин %d сек

source: %s lines
ru_ru: %s стр.

source: ResultSet NOT closed and cleaned up by the DatabaseLayer dtor
ru_ru: ResultSet не закрыт и не очищен dtor DatabaseLayer

source: PreparedStatement NOT closed and cleaned up by the DatabaseLayer dtor
ru_ru: PreparedStatement не закрыт и не очищен dtor DatabaseLayer

source: string
ru_ru: строка

source: Unable to start transaction
ru_ru: Не удалось начать транзакцию

source: Database handle is NULL
ru_ru: Дескриптор базы данных — NULL

source: Parameter type is not compatible with parameter of type double
ru_ru: Тип параметра несовместим с параметром типа double

source: Error allocating space for unknown parameter type
ru_ru: Ошибка при выделении пространства для неизвестного типа параметра

source: Error deleting unknown parameter type
ru_ru: Ошибка при удалении неизвестного типа параметра

source: No SQL Statements found
ru_ru: SQL-инструкции не найдены

source: Invalid Prepared Statement Parameter
ru_ru: Недопустимый параметр подготовленной инструкции

source: Error calling isc_dsql_free_statement
ru_ru: Ошибка при вызове isc_dsql_free_statement

source: SELECT
ru_ru: Выбор (SELECT)

source: Error retrieving Next record
ru_ru: Ошибка при получении следующей записи

source: Invalid field type
ru_ru: Недопустимый тип поля

source: ' not found in the resultset
ru_ru: ' не найдено в ResultSet

source: Field '
ru_ru: Поле '

source: Error allocating buffer
ru_ru: Ошибка при выделении буфера

source: Don't understand type : %d
ru_ru: Не удалось распознать тип: %d

source: Host=
ru_ru: Хост=

source: Port=
ru_ru: Порт=

source: Service Name=
ru_ru: Имя службы=

source: Error creating database connection
ru_ru: Ошибка при создании соединения с базой данных

source: Invalid Date
ru_ru: Недопустимая дата

source: Result as string: '%s'
ru_ru: Результат в виде строки: '%s'

source: TABLE
ru_ru: Таблица (TABLE)

source: VIEW
ru_ru: Представление (VIEW)

source: COMMIT
ru_ru: Фиксация (COMMIT)

source: ROLLBACK
ru_ru: Откат (ROLLBACK)

source: Not implemented
ru_ru: Не реализован

source: ResultSet NOT closed and cleaned up by the PreparedStatement dtor
ru_ru: ResultSet не закрыт и не очищен dtor PreparedStatement

source: :memory:
ru_ru: :память:

source: ' does not exist.
ru_ru: ' не существует.

source: The specified database file '
ru_ru: Указанный файл базы данных '

source: Beginning transaction
ru_ru: Начало транзакции

source: begin transaction;
ru_ru: начать транзакцию;

source: Committing transaction
ru_ru: Фиксация транзакции

source: commit transaction;
ru_ru: зафиксировать транзакцию;

source: Rolling back transaction
ru_ru: Откат транзакции

source: rollback transaction;
ru_ru: откатить транзакцию;

source: Error with RunQueryWithResults
ru_ru: Ошибка в RunQueryWithResults

source: Unknown error advancing result set
ru_ru: Неизвестная ошибка при перемещении по результирующему набору

source: INT
ru_ru: Целое число (INT)

source: INTEGER
ru_ru: Целое число (INTEGER)

source: LONG
ru_ru: Длинное целое (LONG)

source: STRING
ru_ru: Строка (STRING)

source: FLOAT
ru_ru: Число с плавающей точкой (FLOAT)

source: BOOL
ru_ru: Логическое значение (BOOL)

source: BLOB
ru_ru: Большой двоичный объект (BLOB)

source: DATE
ru_ru: Дата (DATE)

source: DATETIME
ru_ru: Дата и время (DATETIME)

source: TIMESTAMP
ru_ru: Метка времени (TIMESTAMP)

source: USE
ru_ru: Использование (USE)

source: TABLE_NAME
ru_ru: Имя таблицы (TABLE_NAME)

source: COLUMN_NAME
ru_ru: Имя столбца (COLUMN_NAME)

source: Edit content
ru_ru: Изменить содержимое

source: No Database opened
ru_ru: Нет открытых баз данных

source: Statement not accessible
ru_ru: Инструкция недоступна

source: Out of memory
ru_ru: Недостаточно памяти

source: Cannot decode binary
ru_ru: Не удалось декодировать двоичный файл

source: Invalid field index
ru_ru: Недопустимый индекс поля

source: Invalid field name
ru_ru: Недопустимое имя поля

source: Invalid row index
ru_ru: Недопустимый индекс строки

source: Invalid scalar query
ru_ru: Недопустимый скалярный запрос

source: Null Results pointer
ru_ru: Указатель на нулевое количество результатов

source: Error binding string param
ru_ru: Ошибка привязки строкового параметра

source: Error binding int param
ru_ru: Ошибка привязки параметра int

source: Error binding int64 param
ru_ru: Ошибка привязки параметра int64

source: Error binding double param
ru_ru: Ошибка привязки параметра double

source: Error binding blob param
ru_ru: Ошибка привязки параметра blob

source: Error binding date/time param
ru_ru: Ошибка привязки параметра даты и времени

source: Error binding NULL param
ru_ru: Ошибка привязки параметра NULL

source: Error clearing bindings
ru_ru: Ошибка очистки привязок

source: Meta data support not available
ru_ru: Поддержка метаданных недоступна

source: Encryption support not available
ru_ru: Поддержка шифрования недоступна

source: Loadable extension support not available
ru_ru: Поддержка загружаемых расширений недоступна

source: Common Settings
ru_ru: Общие параметры

source: wxAuiManager member name
ru_ru: Имя участника wxAuiManager

source: Background Colour
ru_ru: Цвет фона

source: Pane border size
ru_ru: Размер границы панели

source: Sash
ru_ru: Управляющий элемент для изменения размера окна

source: Sash colour
ru_ru: Цвет управляющего элемента для изменения размера окна

source: Set the wxAUI sash size
ru_ru: Установить размер управляющего элемента для изменения размера окна для wxAUI

source: Gradient type
ru_ru: Тип градиента

source: Active caption colour
ru_ru: Цвет заголовка активного окна

source: Active caption gradient colour
ru_ru: Цвет градиента заголовка активного окна

source: Inactive caption colour
ru_ru: Цвет заголовка неактивного окна

source: Inactive caption gradient colour
ru_ru: Цвет градиента заголовка неактивного окна

source: Active caption text colour
ru_ru: Цвет текста заголовка активного окна

source: Inactive caption text colour
ru_ru: Цвет текста заголовка неактивного окна

source: Triggered when any button is pressed for any docked panes
ru_ru: Активируется при нажатии любой кнопки для любой закреплённой панели.

source: Triggered when a docked or floating pane is closed.
ru_ru: Активируется при закрытии закреплённой или перемещаемой панели.

source: Triggered when a pane is maximized.
ru_ru: Активируется при развёртывании панели.

source: Triggered when a pane is restored.
ru_ru: Активируется при восстановлении панели.

source: Triggered when a pane is made 'active'. This event is new since wxWidgets 2.9.4.
ru_ru: Активируется, когда панель становится «активной». Это событие появилось с выходом версии 2.9.4 wxWidgets.

source: This event can be caught to override the default renderer in order to custom draw your wxAuiManager window (not recommended).
ru_ru: Это событие можно захватить, чтобы переопределить отрисовщик по умолчанию и выполнить пользовательскую отрисовку окна wxAuiManager (не рекомендуется).

source: A page is about to be closed
ru_ru: Страница будет закрыта

source: A page has been closed
ru_ru: Страница была закрыта

source: The page selection was changed
ru_ru: Выбор страницы был изменён

source: The page selection is about to be changed. This event can be vetoed
ru_ru: Выбор страницы будет изменён. Это событие может быть запрещено

source: The window list button has been pressed
ru_ru: Была нажата кнопка списка окон

source: Dragging is about to begin
ru_ru: Будет начато перетаскивание

source: Dragging has ended
ru_ru: Перетаскивание завершено

source: Emitted during a drag and drop operation
ru_ru: Создано при перетаскивании

source: Whether to allow a tab to be dropped. This event must be specially allowed
ru_ru: Разрешить ли перетаскивание вкладки. Это событие требует специального разрешения

source: Notify that the tab has been dragged
ru_ru: Уведомлять о перетаскивании вкладки

source: Double clicked on the tabs background area
ru_ru: Выполнен двойной щелчок по фоновой области вкладки

source: The middle mouse button is pressed on a tab
ru_ru: Средняя кнопка мыши нажата на вкладке

source: The middle mouse button is released on a tab
ru_ru: Средняя кнопка мыши отпущена на вкладке

source: The right mouse button is pressed on a tab
ru_ru: Правая кнопка мыши нажата на вкладке

source: The right mouse button is released on a tab
ru_ru: Правая кнопка мыши отпущена на вкладке

source: Caption Visible
ru_ru: Отображаемый заголовок

source: Resizable
ru_ru: С изменяемым размером

source: ToolBar Pane
ru_ru: Панель инструментов

source: Docking
ru_ru: Закрепление

source: Direction
ru_ru: Направление

source: Layer
ru_ru: Слой

source: Row
ru_ru: Строка

source: Best Size
ru_ru: Оптимальный размер

source: Min Size
ru_ru: Минимальный размер

source: Max Size
ru_ru: Максимальный размер

source: Buttons
ru_ru: Кнопки

source: Close Button
ru_ru: Кнопка «Закрыть»

source: Minimize Button
ru_ru: Кнопка «Свернуть»

source: Maximize Button
ru_ru: Кнопка «Развернуть»

source: Pin Button
ru_ru: Кнопка «Закрепить»

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, when the button is clicked.
ru_ru: Обрабатывать событие wxEVT_COMMAND_BUTTON_CLICKED при нажатии кнопки.

source: Load and play animation on creation
ru_ru: Загрузить и воспроизвести анимацию после создания

source: Select the animation file
ru_ru: Выбрать файл анимации

source: Sets the bitmap to show on the control when it's not playing an animation
ru_ru: Устанавливает значок, который будет отображаться на элементе управления, когда он не воспроизводит анимацию

source: Combobox drop down choices
ru_ru: Варианты на выбор при раскрытии поля со списком

source: The zero-based position of any initially selected string, or -1 if none are to be selected
ru_ru: Позиция любой первоначально выбранной строки с отсчётом от нуля или -1, если ни одна из строк не выбрана

source: The combobox initial value
ru_ru: Начальное значение поля со списком

source: Process a wxEVT_COMMAND_COMBOBOX_SELECTED event, when an item on the list is selected. Note that calling GetValue returns the new value of selection.
ru_ru: Обрабатывать событие wxEVT_COMMAND_COMBOBOX_SELECTED при выборе элемента списка. Обратите внимание, что вызов GetValue возвращает новое значение выбора.

source: Process a wxEVT_COMMAND_TEXT_UPDATED event, when the combobox text changes.
ru_ru: Обрабатывать событие wxEVT_COMMAND_TEXT_UPDATED при изменении текста поля со списком.

source: Process a wxEVT_COMMAND_TEXT_ENTER event, when <RETURN> is pressed in the combobox.
ru_ru: Обрабатывать событие wxEVT_COMMAND_TEXT_ENTER при нажатии <RETURN> в поле со списком.

source: Process a wxEVT_LISTBOX event, when an item on the list is selected
ru_ru: Обрабатывать событие wxEVT_LISTBOX при выборе элемента списка

source: Process a wxEVT_LISTBOX_DCLICK event, when the listbox is double-clicked
ru_ru: Обрабатывать событие wxEVT_LISTBOX_DCLICK при двойном щелчке по списку

source: A wxHtmlCell was clicked. See wxHtmlCellEvent
ru_ru: Выполнен щелчок по wxHtmlCell. Смотрите wxHtmlCellEvent

source: The mouse passed over a wxHtmlCell. See wxHtmlCellEvent
ru_ru: Указатель мыши наведён на wxHtmlCell. Смотрите wxHtmlCellEvent

source: A wxHtmlCell which contains an hyperlink was clicked. See wxHtmlLinkEvent
ru_ru: Выполнен щелчок по wxHtmlCell с гиперссылкой. Смотрите wxHtmlLinkEvent

source: The List Box Items. A semi-colon list of strings. This list may contain HTML fragments
ru_ru: Элементы списка. Список строк через точку с запятой. Этот список может содержать фрагменты HTML

source: This event fires when the user changes the current selection in the control
ru_ru: Это событие создаётся при изменении пользователем текущего выбора в элементе управления.

source: The Title Title is rendered in bold and should be single line
ru_ru: Заголовок. Заголовок выделяется полужирным шрифтом и должен располагаться в одну строку

source: Message can have multiple lines but is not wrapped automatically include explicit line breaks in the string if you want to have multiple lines
ru_ru: Сообщение может состоять из нескольких строк, но перенос на новую строку не осуществляется автоматически; добавьте в текст явные разрывы строк, если необходимо использовать несколько строк

source: The banner orientation changes how the text in it is displayed and also defines where is the bitmap truncated if it's too big to fit but doesn't do anything for the banner position, this is supposed to be taken care of in the usual way, e.g. using sizers
ru_ru: Ориентация баннера изменяет отображение текста в нём, а также определяет область усечения значка, если он слишком велик, но не выполняет никаких действий для расположения баннера. Эту задачу можно решить обычным способом, например, с помощью сайзеров

source: Select the bitmap file Important: You can set text and title OR a bitmap, but not both
ru_ru: Выберите файл значка. Важно: вы можете установить текст и заголовок ИЛИ значок, но не и то, и другое

source: Select the bitmap file
ru_ru: Выбрать файл значка

source: Make this button the default button
ru_ru: Сделать эту кнопку кнопкой по умолчанию

source: A unique name for the bitmap (across your project) This name can be used later to load the bitmap from the generated class by simply calling: wxBitmap bmp = myimglist.Bitmap("my-bitmap-name")
ru_ru: Уникальное имя для значка (в вашем проекте) Это имя может быть использовано позднее для загрузки значка из создаваемого класса посредством вызова: wxBitmap bmp = myimglist.Bitmap(«my-bitmap-name»)

source: The bitmap
ru_ru: Значок

source: The button initial state
ru_ru: Первоначальное состояние кнопки

source: Handles a toggle button click event.
ru_ru: Обрабатывает событие нажатия кнопки переключения.

source: My Button
ru_ru: Моя кнопка

source: The button label
ru_ru: Метка кнопки

source: Select the bitmap file (wx2.9.X and later)
ru_ru: Выбрать файл значка (версия wx2.9.X или более поздняя)

source: The position of the bitmap inside the button. By default it is positioned to the left of the text, near to the left button border.
ru_ru: Расположение значка на кнопке. По умолчанию он располагается слева от текста, возле левой границы кнопки.

source: Sets x/y margins between the bitmap and the button label (wx2.9.X and later)
ru_ru: Устанавливает поля x/y между значком и меткой кнопки (версия wx2.9.X или более поздняя)

source: A day was double clicked in the calendar.
ru_ru: Выполнен двойной щелчок по дню в календаре.

source: The selected day changed.
ru_ru: Выбранный день изменён.

source: The selected month changed.
ru_ru: Выбранный месяц изменён.

source: The selected date changed.
ru_ru: Выбранная дата изменена.

source: User clicked on the week day header
ru_ru: Пользователь щёлкнул по заголовку дня недели

source: The selected year changed.
ru_ru: Выбранный год изменён

source: My CheckBox
ru_ru: Мой флажок

source: The Checkbox label
ru_ru: Метка флажка

source: Process a wxEVT_COMMAND_CHECKBOX_CLICKED event, when the checkbox is clicked.
ru_ru: Обрабатывать событие wxEVT_COMMAND_CHECKBOX_CLICKED при щелчке по флажку.

source: Process a wxEVT_COMMAND_LISTBOX_SELECTED event when an item on the list is selected or the selection changes.
ru_ru: Обрабатывать событие wxEVT_COMMAND_LISTBOX_SELECTED при выборе элемента списка или изменении выбора.

source: Process a wxEVT_COMMAND_LISTBOX_DOUBLECLICKED event when the listbox is double-clicked.
ru_ru: Обрабатывать событие wxEVT_COMMAND_LISTBOX_DOUBLECLICKED при двойном щелчке по списку.

source: Process a wxEVT_COMMAND_CHECKLISTBOX_TOGGLED event when an item in the check list box is checked or unchecked.
ru_ru: Обрабатывать событие wxEVT_COMMAND_CHECKLISTBOX_TOGGLED при установке флажка для элемента контрольного списка или его снятии.

source: The List Box Items. A semi-colon list of strings
ru_ru: Элементы списка. Список строк через точку с запятой

source: The page selection is about to be changed. This event can be vetoed
ru_ru: Выбор страницы будет изменён. Это событие может быть запрещено

source: The Choice drop down options. A semi-colon list of strings
ru_ru: Варианты на выбор при раскрытии поля со списком. Список строк через точку с запятой

source: Selected string index
ru_ru: Индекс выбранной строки

source: Process a wxEVT_COMMAND_CHOICE_SELECTED event, when an item on the list is selected.
ru_ru: Обрабатывать событие wxEVT_COMMAND_CHOICE_SELECTED при выборе элемента списка.

source: The user expanded or collapsed the collapsible pane
ru_ru: Пользователь свернул или развернул свёртываемую панель

source: Process a navigation key event
ru_ru: Обрабатывать событие клавиши навигации

source: The label
ru_ru: Метка

source: Set the state of the collapsible pane
ru_ru: Установить состояние свёртываемой панели
