Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Version Number
ru_ru: Номер версии

source: Icon File
ru_ru: Файл значков

source: Bundle Identifier
ru_ru: Идентификатор пакета

source: 4-Character Signature
ru_ru: Четырёхсимвольная подпись

source: Cannot access or create file!
ru_ru: Не удалось получить доступ к файлу или создать его!

source: Failed to write Info.plist file!
ru_ru: Не удалось записать файл Info.plist!

source: MacBundler : manage OS X app bundles
ru_ru: MacBundler: управление пакетами приложения OS X

source: Manage OS X app bundles
ru_ru: Управление пакетами приложения OS X

source: No project is active, cannot continue.
ru_ru: Нет активного проекта, продолжение невозможно.

source: Cannot retrieve active project, cannot continue.
ru_ru: Не удалось получить активный проект, продолжение невозможно.

source: This menu item can only be invoked when right-clicking a project.
ru_ru: Этот пункт меню может быть вызван только щелчком правой кнопкой мыши по проекту.

source: Cannot continue, impossible to access project settings.
ru_ru: Не удалось продолжить, невозможно получить доступ к параметрам проекта.

source: The following file: %s already exists, overwrite it?
ru_ru: Следующий файл: %s уже существует, перезаписать его?

source: Could not create Info.plist file
ru_ru: Не удалось создать файл Info.plist

source: Sorry, could not copy icon
ru_ru: Не удалось скопировать значок

source: Sorry, could not convert selected icon to icns format
ru_ru: Не удалось преобразовать выбранный значок в формат icns

source: Make active project output a bundle
ru_ru: Создать пакет из выходных данных активного проекта

source: Make this project output a bundle
ru_ru: Создать пакет из выходных данных этого проекта

source: MemCheck plugin detects memory leaks. Uses Valgrind (memcheck tool) as backend.
ru_ru: Модуль MemCheck выявляет утечки памяти. Использует Valgrind (инструмент MemСheck) в качестве серверной части.

source: Detects memory management problems. Uses Valgrind - memcheck skin.
ru_ru: Обнаруживает проблемы управления памятью. Использует Valgrind — оболочку MemСheck.

source: &Run MemCheck
ru_ru: &Запустить MemCheck

source: &Load MemCheck log from file...
ru_ru: &Загрузить журнал MemCheck из файла…

source: &Settings...
ru_ru: &Параметры...

source: Another instance is already running. Please stop it before executing another one
ru_ru: Уже работает ещё один экземпляр. Остановите его перед запуском следующего

source: Launching MemCheck...
ru_ru: Запуск MemCheck...

source: MemCheck command:
ru_ru: Команда MemCheck:

source: Open log file
ru_ru: Открыть файл журнала

source: Output log file cannot be properly loaded.
ru_ru: Не удалось должным образом загрузить выходной файл журнала.

source: Processing error.
ru_ru: Ошибка обработки.

source: -- MemCheck process completed
ru_ru: — Процесс MemCheck завершён

source: Please wait, working...
ru_ru: Выполняется, подождите...

source: Label
ru_ru: Метка

source: Search string
ru_ru: Поиск в строке

source: Search 'nonworkspace'
ru_ru: Поиск «вне рабочего пространства»

source: Current
ru_ru: Текущая

source: Suppress
ru_ru: Подавить

source: Jump to location
ru_ru: Перейти к расположению

source: Mark all
ru_ru: Отметить все

source: Unmark all
ru_ru: Снять все метки

source: Suppress this error
ru_ru: Подавить эту ошибку

source: Suppress all marked errors
ru_ru: Подавить все отмеченные ошибки

source: Copy line as string to clipboard
ru_ru: Копировать строчку как строку в буфер обмена

source: Copy error as string to clipboard
ru_ru: Копировать ошибку как строку в буфер обмена

source: Copy marked errors to clipboard
ru_ru: Копировать отмеченные ошибки в буфер обмена

source: Total: %lu Filtered: %lu Selected: %d
ru_ru: Всего: %lu Отфильтровано: %lu Выбрано: %d

source: Add suppression file(s)
ru_ru: Добавить файл(ы) подавления

source: Add suppression file(s)...
ru_ru: Добавить файл(ы) подавления…

source: Remove suppression file(s)
ru_ru: Удалить файл(ы) подавления

source: Run check
ru_ru: Выполнить проверку

source: Load MemCheck log from file.
ru_ru: Загрузить журнал MemCheck из файла.

source: Stop Process
ru_ru: Остановить процесс

source: Expand all
ru_ru: Развернуть все

source: Jump to next error
ru_ru: Перейти к следующей ошибке

source: Jump to previous error
ru_ru: Перейти к предыдущей ошибке

source: Clear output
ru_ru: Очистить вывод

source: Open plain output in editor window.
ru_ru: Открыть простой вывод в окне редактора.

source: Errors
ru_ru: Ошибки

source: Object
ru_ru: Объект

source: First result page.
ru_ru: Первая страница результатов.

source: of
ru_ru: из

source: Choose suppression file to use.
ru_ru: Выбрать файл подавления.

source: Clear filter
ru_ru: Очистить фильтр

source: Invert
ru_ru: Обратить

source: RegExp
ru_ru: Регулярное выражение

source: Total: 0 Filtered: 0 Selected: 0
ru_ru: Всего: 0 Отфильтровано: 0 Выбрано: 0

source: Suppress all
ru_ru: Подавить все

source: Suppress selected
ru_ru: Подавить выбранные

source: Engine:
ru_ru: Движок:

source: At this time (1Q 2014) only valgrind supported - development state.
ru_ru: На данный момент (1 квартал 2014 года) поддерживается только Valgrind — состояние разработки.

source: Errors on page:
ru_ru: Ошибок на странице:

source: Show locations only from my workspace.
ru_ru: Показывать расположения только из моего рабочего пространства.

source: Remove duplicate records.
ru_ru: Удалять повторяющиеся записи.

source: Remove suppressed errors.
ru_ru: Удалять подавленные ошибки.

source: Remove errors only if suppression rule was added without any change.
ru_ru: Удалять ошибки только в том случае, если правило подавления было добавлено без изменений.

source: Command Line
ru_ru: Командная строка

source: Valgrind executable:
ru_ru: Исполняемый файл Valgrind:

source: Select valgrind executable
ru_ru: Выберите исполняемый файл Valgrind

source: Command line options
ru_ru: Параметры командной строки

source: Mandatory:
ru_ru: Обязательные:

source: Please do not use these options again and do not change their values! Plugin won't work.
ru_ru: Не используйте эти параметры снова и не изменяйте их значения! Модуль не будет работать.

source: Regular:
ru_ru: Обычные:

source: Reload defaults
ru_ru: Перезагрузить значения по умолчанию

source: Temporary output file
ru_ru: Временный выходной файл

source: Use log file in workspace private folder.
ru_ru: Использовать файл журнала в личной папке рабочего пространства.

source: It is used internally by this plugin. Valgrind outputs to this file and afterwards the plugin processes this file and shows result.
ru_ru: Файл журнала используется этим модулем для внутренних целей. Valgrind выводит данные в этот файл, после чего модуль обрабатывает его и показывает результат.

source: Suppression
ru_ru: Подавление

source: Suppression files
ru_ru: Файлы подавления

source: Use workspace specific supp file as default.
ru_ru: Использовать по умолчанию файл подавления, относящийся к рабочему пространству.

source: This file is located in workspace private folder. If you don't like this option, you have to add at least one file to list below.
ru_ru: Этот файл располагается в личной папке рабочего пространства. Если вам не нравится этот вариант, то вам необходимо добавить хотя бы один файл в список ниже.

source: MemCheck Settings
ru_ru: Параметры MemCheck

source: Show Current the Layout of the current file
ru_ru: Показывает текущий макет текущего файла

source: Outline Plugin
ru_ru: Модуль Outline

source: Run code style checking on PHP source files
ru_ru: Выполнить проверку стиля кода в исходных файлах PHP

source: Lint Current Source
ru_ru: Выполнить анализ текущего исходного кода

source: PHP Linter
ru_ru: Анализатор кода PHP

source: PHPLint: can not lint file. Missing PHP executable path
ru_ru: PHPLint: не удалось выполнить анализ файла. Отсутствует путь к исполняемому файлу PHP

source: Lint on file load
ru_ru: Выполнять анализ при загрузке файла

source: When saving a file, automatically lint it
ru_ru: При сохранении файла автоматически выполнять его анализ

source: Lint on file save
ru_ru: Выполнять анализ при сохранении файла

source: Select the PHP_CodeSniffer phar file location
ru_ru: Выберите расположение phar-файла PHP_CodeSniffer

source: Select the PHPMD phar file location
ru_ru: Выберите расположение phar-файла PHPMD

source: PHPMD-rules:
ru_ru: PHPMD-правила:

source: Select the xml rules file to use with PHPMD
ru_ru: Выберите файл правил XML для использования с PHPMD

source: Select the Phpstan phar file location
ru_ru: Выберите расположение phar-файла PHPStan

source: PHP Linter Options
ru_ru: Параметры анализатора кода PHP

source: Uses PHP Refactoring Browser to provide refactoring capabilities for php
ru_ru: Использует PHP Refactoring Browser для оптимизации кода PHP

source: PHP Refactoring
ru_ru: Оптимизация кода PHP

source: Extract Method
ru_ru: Извлечь метод

source: Rename Local Variable
ru_ru: Переименовать локальную переменную

source: Rename Class Property
ru_ru: Переименовать свойство класса

source: Convert Local to Instance Variable
ru_ru: Преобразовать локальную переменную в переменную экземпляра

source: Optimize use statements
ru_ru: Оптимизировать операторы use

source: Refactoring
ru_ru: Оптимизация кода

source: Name the new method
ru_ru: Указать имя нового метода

source: Method name may not contain spaces
ru_ru: Имя метода не может содержать пробелы

source: New name for
ru_ru: Новое имя для

source: This will sync namespaces and classes with folder and filenames, for all files in the selected folder, to comply with psr-0 Continue?
ru_ru: Для всех файлов в выбранной папке будет выполнена синхронизация пространств имён и классов с именами файлов и папок по стандарту psr-0. Продолжить?

source: Can not refactor file: Failed to write temporary file
ru_ru: Не удалось оптимизировать файл: Не удалось записать временный файл

source: Can not refactor file: failed to read temporary file content
ru_ru: Не удалось оптимизировать файл: Не удалось прочитать содержимое временного файла

source: Can not refactor file: Missing PHP executable path
ru_ru: Не удалось оптимизировать файл: отсутствует путь к исполняемому файлу PHP

source: Can not refactor file: Missing PHP Refactoring Browser path
ru_ru: Не удалось оптимизировать файл: отсутствует путь к PHP Refactoring Browser

source: on line
ru_ru: в строке

source: Can only refactor well formed code:
ru_ru: Можно оптимизировать только правильно сформированный код:

source: Expected patch format. Received:
ru_ru: Ожидался формат исправления. Получено:

source: Rename Class and Namespaces
ru_ru: Переименовать класс и пространства имён

source: PHP Refactoring PHAR file:
ru_ru: Phar-файл оптимизации кода PHP:

source: Select the PHP Refactoring Browser phar file location
ru_ru: Выберите расположение phar-файла PHP Refactoring Browser

source: Apply changes without previewing
ru_ru: Применять изменения без предварительного просмотра

source: Please review the changes before applying them:
ru_ru: Проверьте изменения перед их применением:

source: PHP Refactoring Options
ru_ru: Параметры оптимизации кода PHP

source: PHP Refcatoring Preview
ru_ru: Предварительный просмотр оптимизации кода PHP

source: Successfully connected to host!
ru_ru: Успешное подключение к хосту!

source: Default folder must be set to full path (i.e. it should start with a '/')
ru_ru: Для папки по умолчанию должен быть задан полный путь (то есть он должен начинаться с «/»)

source: Importing syntax highlight file will override any duplicate syntax highlight settings. Continue?
ru_ru: Импорт файла подсветки синтаксиса переопределит все дублирующие параметры подсветки синтаксиса. Продолжить?

source: Generating
ru_ru: Создание

source: Could not locate any MinGW compiler installed on your machine, would you like to install one now?
ru_ru: Не удалось обнаружить компилятор MinGW, установленный на вашем компьютере. Установить его сейчас?

source: After the installation process is done Click the 'Scan' button
ru_ru: После завершения установки нажмите кнопку «Найти»

source: Continue
ru_ru: Продолжить

source: Restart debugger
ru_ru: Перезапустить отладчик

source: Show Current Line
ru_ru: Показать текущую строку

source: Step In
ru_ru: Шаг с заходом

source: Toggle Rewind Commands
ru_ru: Включить или отключить команды перемотки

source: Start Reverse Debug Recording
ru_ru: Запустить обратную запись отладки

source: New comparison
ru_ru: Создать сравнение

source: Show similar files only
ru_ru: Показать только похожие файлы

source: Parent folder
ru_ru: Родительская папка

source: Copy from Right to Left
ru_ru: Копировать справа налево

source: Copy from Left to Right
ru_ru: Копировать слева направо

source: Diff
ru_ru: Сравнение

source: Next Diff
ru_ru: Следующее различие

source: Previous Diff
ru_ru: Предыдущее различие

source: Copy Right
ru_ru: Копировать справа

source: Copy Left
ru_ru: Копировать слева

source: Copy All
ru_ru: Копировать всё

source: View Type
ru_ru: Тип представления

source: does not exist!
ru_ru: не существует!

source: Left Side File:
ru_ru: Файл слева:

source: Right Side File:
ru_ru: Файл справа:

source: Failed to load file content:
ru_ru: Не удалось загрузить содержимое файла:

source: Refreshing the view will lose all your changes Do you want to continue?
ru_ru: Обновление представления приведёт к потере всех ваших изменений. Продолжить?

source: Failed to save content to file:
ru_ru: Не удалось сохранить содержимое в файл:

source: Closing the diff viewer, will lose all your changes. Continue?
ru_ru: Закрытие средства просмотра различий приведёт к потере всех ваших изменений. Продолжить?

source: Copy all: left <- right
ru_ru: Копировать всё: налево <- справа

source: Copy all: left -> right
ru_ru: Копировать всё: слева -> направо

source: Single View
ru_ru: Единственное представление

source: Horizontal Split
ru_ru: Горизонтальное разделение

source: Vertical Split
ru_ru: Вертикальное разделение

source: Ignore Whitespace
ru_ru: Игнорировать пробелы

source: Show Line Numbers
ru_ru: Показывать номера строк

source: Show Overview Bar
ru_ru: Показывать панель обзора

source: Select folders for comparison:
ru_ru: Папки для сравнения:

source: Left
ru_ru: Слева

source: Right
ru_ru: Справа

source: Diff Folders
ru_ru: Сравнение папок

source: Delete environment variables set '%s' ?
ru_ru: Удалить набор переменных среды «%s»?

source: Failed to open file: '%s' for write
ru_ru: Не удалось открыть файл: '%s' для записи

source: Environment exported to: '%s' successfully
ru_ru: Среда экспортирована в: '%s' успешно

source: Define here set of environment variables which will be applied by CodeLite before launching processes. Variables are defined in the format of NAME=VALUE
ru_ru: Определите здесь набор переменных среды, которые будут применяться CodeLite перед запуском процессов. Переменные задаются в формате NAME=VALUE

source: Available environment sets:
ru_ru: Доступные наборы среды:

source: &New Set...
ru_ru: &Новый набор...

source: Delete Set
ru_ru: Удалить набор

source: &Export
ru_ru: &Экспорт

source: Export the current set to a platform specific environment file
ru_ru: Экспорт текущего набора в файл среды, относящийся к платформе

source: Environment Variables
ru_ru: Переменные среды

source: -- Open SSH Account Manager --
ru_ru: -- Открыть диспетчер учётных записей SSH --

source: Choose folder
ru_ru: Выбрать папку

source: Select a directory
ru_ru: Выбрать рабочий каталог

source: Wrong account selected!
ru_ru: Выбрана неверная учётная запись!

source: Select debugger executable:
ru_ru: Исполняемый файл отладчика:

source: Search...
ru_ru: Поиск...

source: Matches
ru_ru: Совпадения

source: Shortcut
ru_ru: Комбинация клавиш

source: Method: `
ru_ru: Метод: `

source: ` is not supported
ru_ru: ` не поддерживается

source: Action:
ru_ru: Действие:

source: Key:
ru_ru: Клавиша:

source: Hit any keyboard key. Don't use the modifier keys (e.g. 'Shift') here, use the checkboxes below
ru_ru: Нажмите любую клавишу на клавиатуре. Не используйте клавиши-модификаторы (например, «Shift»), воспользуйтесь флажками ниже

source: Modifiers:
ru_ru: Модификаторы:

source: Clear the keyboard shortcut
ru_ru: Очистить комбинацию клавиш

source: Suggest...
ru_ru: Предложить...

source: Show list of all un-assigned keyboard shortcuts
ru_ru: Показать список всех неприсвоенных комбинаций клавиш

source: Set New Key Accelerator
ru_ru: Новая комбинация клавиш

source: Project name must not contain spaces
ru_ru: Имя проекта не должно содержать пробелы

source: MSYS based compiler requires a UNIX Makefile Generator Would like CodeLite to fix this for you?
ru_ru: Для работы компилятора на основе MSYS требуется генератор файлов Makefile UNIX. Вы хотите, чтобы CodeLite устранила эту проблему?

source: Visual C++ compiler requires an NMake generator Would like CodeLite to fix this for you?
ru_ru: Для работы компилятора Visual C++ требуется генератор файлов Nmake. Вы хотите, чтобы CodeLite устранила эту проблему?

source: Create the project in its own folder
ru_ru: Создать проект в отдельной папке

source: Category:
ru_ru: Категория:

source: Compiler:
ru_ru: Компилятор:

source: Build System:
ru_ru: Система сборки:

source: New Project
ru_ru: Новый проект

source: Create new folder
ru_ru: Создать новую папку

source: Open SSH account manager
ru_ru: Открыть диспетчер учётных записей SSH

source: Could not find account:
ru_ru: Не удалось найти учётную запись:

source: Are you sure you want to delete the selected accounts?
ru_ru: Вы уверены, что хотите удалить выбранные учётные записи?

source: My Column
ru_ru: Мой столбец

source: Select language:
ru_ru: Язык:

source: Workspace file:
ru_ru: Файл рабочего пространства:

source: Switch to workspace
ru_ru: Переключить на рабочее пространство

source: Open workspace
ru_ru: Открыть рабочее пространство

source: Item
ru_ru: Элемент

source: Customise
ru_ru: Настройка

source: Select Virtual Folder:
ru_ru: Виртуальная папка:

source: Create new virtual folder...
ru_ru: Создать новую виртуальную папку...

source: Virtual Directory Selector
ru_ru: Переключатель виртуального каталога

source: New Virtual Folder Name:
ru_ru: Имя новой виртуальной папки:

source: Error occurred while creating virtual folder:
ru_ru: Произошла ошибка при создании виртуальной папки:

source: Static Text Label
ru_ru: Статическая текстовая метка

source: Please define the value of the following variables:
ru_ru: Определите значение следующих переменных:

source: Skip
ru_ru: Пропустить

source: Import - Environment variable
ru_ru: Импорт — Переменная среды

source: Line to add:
ru_ru: Строка для добавления:

source: File's full path:
ru_ru: Полный путь к файлу:

source: Add a missing header file
ru_ru: Добавить недостающий заголовочный файл

source: Current working directory:
ru_ru: Текущий рабочий каталог:

source: Running program:
ru_ru: Выполняющаяся программа:

source: Program exited with return code:
ru_ru: Программа завершилась с кодом возврата:

source: Change Active Bookmark Type...
ru_ru: Изменить тип активной закладки...

source: More...
ru_ru: Дополнительно...

source: Normal bookmark
ru_ru: Обычная закладка

source: Find bookmark
ru_ru: Найти закладку

source: Bookmark Type
ru_ru: Тип закладки

source: Cant open project '
ru_ru: Не удалось открыть проект '

source: Cant find build configuration for project '
ru_ru: Не удалось найти конфигурацию сборки для проекта '

source: Cant find proper compiler for project '
ru_ru: Не удалось найти подходящий компилятор для проекта '

source: ' which is required
ru_ru: ' который требуется

source: CodeLite can not find project '
ru_ru: CodeLite не удалось найти проект '

source: for building project '
ru_ru: для сборки проекта '

source: '. Would you like to remove it from the dependency list?
ru_ru: '. Вы хотите удалить его из списка зависимостей?

source: Eran Ifrah (author & project admin)
ru_ru: Eran Ifrah (автор и администратор проекта)

source: Contributors:
ru_ru: Участники:

source: About
ru_ru: О программе

source: Author:
ru_ru: Автор:

source: 2007 - 2023, by Eran Ifrah
ru_ru: Eran Ifrah, 2007—2023

source: Home Page:
ru_ru: Домашняя страница:

source: License
ru_ru: Лицензия

source: Credits
ru_ru: Участники

source: Welcome to the setup wizard
ru_ru: Добро пожаловать в мастер настройки

source: This wizard will help you setup CodeLite to fit your coding style. Click Next to continue
ru_ru: Этот мастер поможет вам настроить CodeLite в соответствии с вашим стилем написания кода. Нажмите кнопку «Далее», чтобы продолжить

source: Not this time!
ru_ru: Не сейчас!

source: If your CodeLite is already configured the way you like it, click to skip the Wizard
ru_ru: Если нужная вам настройка CodeLite уже выполнена, нажмите, чтобы пропустить мастер

source: Development Profile
ru_ru: Профиль разработки

source: Select the profile that best describes you
ru_ru: Выберите профиль, наиболее соответствующий вашей деятельности

source: C/C++ development
ru_ru: Разработка C/C++

source: Web development (PHP, JS etc)
ru_ru: Веб-разработка (PHP, JS и т.д.)

source: C/C++ development (Blockchain using EOSIO)
ru_ru: Разработка C/C++ (блокчейн на основе EOSIO)

source: Setup compilers
ru_ru: Установить компиляторы

source: Let CodeLite configure your installed compilers or help you install one
ru_ru: Разрешите CodeLite настроить установленные компиляторы или помочь вам установить один из них

source: Click to scan your computer for installed compilers
ru_ru: Щелкните, чтобы выполнить поиск установленных компиляторов на вашем компьютере

source: Click to download a MinGW compiler
ru_ru: Щелкните, чтобы загрузить компилятор MinGW

source: Install
ru_ru: Установить

source: Compiler Name
ru_ru: Имя компилятора

source: Installation Path
ru_ru: Путь установки

source: Customise colours
ru_ru: Настроить цвета

source: Select the editor theme from the list below. You can always change this from the menu: Settings -> Colours and fonts...
ru_ru: Выберите тему редактора из списка ниже. Этот выбор можно будет изменить с помощью меню: Настройка -> Цвета и шрифты…

source: Theme:
ru_ru: Тема:

source: Set the IDE global colour This colour affects various controls
ru_ru: Установите глобальный цвет IDE. Этот цвет используется для различных элементов управления

source: Should CodeLite use TABS or SPACES for indentation?
ru_ru: CodeLite следует использовать табуляцию или пробелы для добавления отступа?

source: Whitespace & Indentation
ru_ru: Пробел и добавление отступа

source: Indent using SPACES
ru_ru: Отступ с использованием пробелов

source: Indent using TABS
ru_ru: Отступ с использованием табуляции

source: Whitespace Visibility:
ru_ru: Видимость пробелов:

source: By:
ru_ru: Автор:

source: System Default
ru_ru: Системная по умолчанию

source: Dark
ru_ru: Тёмная

source: Grey
ru_ru: Серая

source: Light
ru_ru: Светлая

source: You can always run this setup wizard from the menu: Help -> Run the Setup Wizard
ru_ru: Вы всегда можете запустить этот мастер настройки из меню: Справка -> Запустить мастер настройки…

source: Spacer
ru_ru: Разделитель

source: Separator
ru_ru: Разделитель

source: CodeLite - Diff View
ru_ru: CodeLite — представление различий

source: ' to the clipboard
ru_ru: ' в буфер обмена

source: Copy '
ru_ru: Копировать '

source: ' copied!
ru_ru: ' скопирован!

source: File system scan completed
ru_ru: Проверка файловой системы завершена

source: File System Workspace
ru_ru: Рабочее пространство файловой системы

source: You should have at least one workspace configuration. 0 found Open the project settings and add one
ru_ru: У вас должна быть как минимум одна конфигурация рабочего пространства. Найдено: 0. Откройте параметры проекта и добавьте её

source: Don't know how to run '
ru_ru: Не удалось запустить '
