Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: This won't be a problem on Linux, but it may be on other, case-insensitive platforms
ru_ru: Это не вызовет проблем в Linux, но может привести к ним в других, нечувствительных к регистру системах

source: Add the file anyway?
ru_ru: Всё равно добавить файл?

source: Possible name-clash
ru_ru: Возможен конфликт имён

source: %u file(s) not added, probably due to a name-clash
ru_ru: Файлы (%u) не добавлены, вероятно, из-за конфликта имён

source: Working directory is set to:
ru_ru: Рабочий каталог установлен в:

source: Program exited
ru_ru: Программа завершила работу

source: Failed to locate the configured default terminal application required by CodeLite, please install it or check your configuration!
ru_ru: Не удалось определить расположение сконфигурированного приложения терминала по умолчанию, необходимого для CodeLite. Установите его или проверьте вашу конфигурацию!

source: ': debugger not loaded
ru_ru: ': отладчик не загружен

source: Failed to launch debugger '
ru_ru: Не удалось запустить отладчик '

source: Make sure that you have an open workspace and that the active project is of type 'Executable'
ru_ru: Убедитесь, что у вас открыто рабочее пространство и что активный проект имеет тип «Исполняемый файл»

source: Could not find project configuration!
ru_ru: Не удалось найти конфигурацию проекта!

source: Make sure that everything is set properly in your project settings
ru_ru: Убедитесь, что в параметрах проекта всё установлено правильно

source: Could not launch terminal for debugger
ru_ru: Не смог запустить терминал для отладчика

source: Failed to initialize debugger:
ru_ru: Не удалось инициализировать отладчик:

source: Debug session started successfully!
ru_ru: Сеанс отладки успешно запущен!

source: Program Received signal
ru_ru: Программой получен сигнал

source: Stack trace is available in the 'Call Stack' tab
ru_ru: Трассировка стека доступна на вкладке «Стек вызовов»

source: Assertion failed! Stack trace is available in the 'Call Stack' tab
ru_ru: Ошибка при выполнении утверждения! Трассировка стека доступна на вкладке «Стек вызовов»

source: Debugger exited with the following error string: %s
ru_ru: Отладчик завершил работу со следующей строкой ошибки: %s

source: Continuing...
ru_ru: Продолжение...

source: This would terminate the current debug session, continue?
ru_ru: Это завершит текущий сеанс отладки, продолжить?

source: Compile Single File
ru_ru: Компиляция одного файла

source: Preprocess File
ru_ru: Предварительная обработка файла

source: Build cancelled. The following compilers referred by the workspace could not be found:
ru_ru: Сборка отменена. Не удалось найти следующие компиляторы, на которые ссылается рабочее пространство:

source: Please fix your project settings by selecting a valid compiler
ru_ru: Исправьте свои параметры проекта, выбрав допустимый компилятор

source: Build Aborted
ru_ru: Сборка прервана

source: Compilers updated successfully! You can now build your workspace
ru_ru: Компиляторы успешно обновлены! Теперь можно создать рабочее пространство

source: What would you like to call the current state?
ru_ru: Что вы хотите считать текущим состоянием?

source: Label current state
ru_ru: Установить метку для текущего состояния

source: Go to line number (1 - %i):
ru_ru: Перейти к номеру строки (1 - %i):

source: Go To Line
ru_ru: Перейти к строке

source: '%s' is not a valid line number
ru_ru: «%s» является недопустимым номером строки

source: Please insert a line number in the range of (1 - %i)
ru_ru: Пожалуйста, вставьте номер строки в диапазоне (1 - %i)

source: Select the file in which to place the function implementation:
ru_ru: Выберите файл, в который следует поместить реализацию функции:

source: Function implementation (you can edit the code below):
ru_ru: Реализация функции (вы можете изменить код ниже):

source: Move Function Implementation Preview
ru_ru: Предварительный просмотр перемещения реализации функции

source: File:
ru_ru: Файл:

source: Configuration Name:
ru_ru: Имя конфигурации:

source: Copy Settings from:
ru_ru: Копировать параметры из:

source: -- None --
ru_ru: -- Источник не выбран --

source: Configuration Name is empty
ru_ru: Имя конфигурации не указано

source: Location:
ru_ru: Расположение:

source: Add New File
ru_ru: Добавить новый файл

source: select a folder
ru_ru: выберите папку

source: Copy Value to Clipboard
ru_ru: Копировать значение в буфер обмена

source: Create the folder on the file system as well
ru_ru: Создать папку также в файловой системе

source: Enter new expression:
ru_ru: Введите новое выражение:

source: Edit Item
ru_ru: Изменить элемент

source: Browse for folder
ru_ru: Выбор папки

source: Workspace Name:
ru_ru: Имя рабочего пространства:

source: Generated File:
ru_ru: Созданный файл:

source: Create the workspace under a separate directory
ru_ru: Создать рабочее пространство в отдельном каталоге

source: Choose a folder:
ru_ru: Папка:

source: The selected project path '
ru_ru: Выбранный путь к проекту '

source: ' Contains some invalid characters Continue anyways?
ru_ru: ' Содержит недопустимые символы. Всё равно продолжить?

source: Invalid path:
ru_ru: Недопустимый путь:

source: A workspace file with this name already exists
ru_ru: Файл рабочего пространства с этим именем уже существует

source: Sort
ru_ru: Сортировать

source: Guides
ru_ru: Управление

source: Caret / Scrolling
ru_ru: Курсор/прокрутка

source: Save Options
ru_ru: Параметры сохранения

source: Code
ru_ru: Код

source: Hidden Tabs
ru_ru: Скрытые вкладки

source: Keep open
ru_ru: Оставить открытой

source: Don't close this pane when an editor gets focus
ru_ru: Не закрывать эту панель, когда редактор получит фокус

source: Scroll on Output
ru_ru: Прокручивать при выводе

source: Clear All
ru_ru: Очистить все

source: Fold All Results
ru_ru: Свернуть все результаты

source: Repeat
ru_ru: Повторить

source: Uncheck All
ru_ru: Снять все отметки

source: Manage Plugins
ru_ru: Управление модулями

source: Version
ru_ru: Версия

source: Author
ru_ru: Автор

source: Is Loaded?
ru_ru: Загружен?

source: Project enabled
ru_ru: Проект включён

source: When unchecked, this project will not be built for the current build configuration
ru_ru: Если флажок не установлен, то сборка этого проекта не будет выполнена для текущей конфигурации сборки

source: Dynamic Library
ru_ru: Динамическая библиотека

source: Static Library
ru_ru: Статическая библиотека

source: Executable
ru_ru: Исполняемый файл

source: Sets the type of the project
ru_ru: Устанавливает тип проекта

source: Makefile Generator
ru_ru: Генератор файлов Makefile

source: Select the Makefile generator to use. By default, CodeLite uses its builtin Makefile generator
ru_ru: Выберите генератор файлов Makefile. По умолчанию CodeLite использует свой встроенный генератор файлов Makefile

source: Arguments
ru_ru: Аргументы

source: Set the Makefile generator arguments
ru_ru: Задайте аргументы генератора файлов Makefile

source: Compiler
ru_ru: Компилятор

source: Select the compiler to use. The compiler controls two aspects of the project: - If the project is _not_ a custom build, then this compiler is used for compilation - CodeLite uses the compiler definition for parsing the output
ru_ru: Выберите компилятор. Компилятор управляет двумя аспектами проекта: - Если проект _не_ является пользовательской сборкой, то этот компилятор используется для компиляции - CodeLite использует определение компилятора для анализа вывода

source: Intermediate Directory
ru_ru: Промежуточный каталог

source: The name of the folder used for the generated objects during compilation
ru_ru: Имя папки, используемой для объектов, создаваемых во время компиляции

source: Output File
ru_ru: Выходной файл

source: The name of the output file (e.g. the executable file name)
ru_ru: Имя выходного файла (например, имя исполняемого файла)

source: Execution
ru_ru: Выполнение

source: Pause when execution ends
ru_ru: Приостановить по окончании выполнения

source: After the execution of the program ends, show a console with the message "Hit any key to continue..." This is useful when you wish to view the output printed to stdout before the console terminates
ru_ru: После окончания выполнения программы показывать консоль с сообщением «Hit any key to continue...» («Нажмите любую клавишу, чтобы продолжить...») Это полезно, когда вам нужно просмотреть вывод, направляемый в stdout, прежде чем консоль завершит работу

source: This program is a GUI application
ru_ru: Эта программа является приложением с графическим интерфейсом

source: By marking the project as a GUI project, CodeLite will launch the program without any console terminal wrapping the process execution
ru_ru: Если отметить проект как проект с графическим интерфейсом, CodeLite будет запускать программу без обёртывания выполнения процесса в консольном терминале

source: Executable to Run / Debug
ru_ru: Исполняемый файл для выполнения/отладки

source: The executable to run / debug
ru_ru: Исполняемый файл для выполнения/отладки

source: Working Directory
ru_ru: Рабочий каталог

source: The working directory to set before executing or debugging the program
ru_ru: Рабочий каталог, который необходимо установить перед выполнением или отладкой программы

source: Program Arguments
ru_ru: Аргументы программы

source: The command line arguments to pass to the program when executing or debugging it
ru_ru: Аргументы командной строки для передачи программе при её выполнении или отладке

source: Debugging
ru_ru: Отладка

source: Select the debugger type to use for this project
ru_ru: Выберите тип отладчика, который следует использовать для этого проекта

source: Use separate debugger args
ru_ru: Использовать отдельные аргументы отладчика

source: When enabled (.e.g. set to True) codelite will pass the arguments set in 'Debug Program Arguments'
ru_ru: Если флажок установлен (например, установлено значение True), CodeLite будет передавать аргументы, указанные в поле «Аргументы программы отладки»

source: Debug Program Arguments
ru_ru: Аргументы программы отладки

source: Arguments to pass to the debugger
ru_ru: Аргументы для передачи отладчику

source: Compiler is not required for this project
ru_ru: Для этого проекта не требуется компилятор

source: Copy settings for this page from another project
ru_ru: Копировать параметры для этой страницы из другого проекта

source: Options
ru_ru: Параметры

source: Append to global settings
ru_ru: Добавить к глобальным параметрам

source: Overwrite global settings
ru_ru: Перезаписать глобальные параметры

source: Prepend to global settings
ru_ru: Добавить перед глобальными параметрами

source: Use with Global Settings
ru_ru: Использование с глобальными параметрами

source: Define how CodeLite will merge the compiler settings defined in the 'Global Settings' with the settings defined on this page
ru_ru: Определите, как CodeLite будет объединять параметры компилятора, указанные в разделе «Глобальные параметры», с параметрами, указанными на этой странице

source: C++ Compiler Options
ru_ru: Параметры компилятора C++

source: Additional compiler options to pass to the compiler provided as a semi-colon delimited list
ru_ru: Дополнительные параметры для передачи компилятору, представленные в виде списка с пунктами, разделёнными точкой с запятой

source: C Compiler Options
ru_ru: Параметры компилятора C

source: Additional C compiler options to pass to the compiler provided as a semi-colon delimited list (used for C files only)
ru_ru: Дополнительные параметры для передачи компилятору C, представленные в виде списка с пунктами, разделёнными точкой с запятой (используется только для файлов C)

source: Assembler Options
ru_ru: Параметры ассемблера

source: Additional assembler options to pass to the assembler provided as a semi-colon delimited list (used for .s files only)
ru_ru: Дополнительные параметры для передачи ассемблеру, представленные в виде списка с пунктами, разделёнными точкой с запятой (используется только для .s-файлов)

source: Include Paths
ru_ru: Пути поиска включаемых файлов

source: Include path to pass to the compiler (provided as semi-colon delimited list)
ru_ru: Пути поиска включаемых файлов для передачи компилятору (представленные в виде списка с пунктами, разделёнными точкой с запятой)

source: Preprocessors
ru_ru: Препроцессоры

source: macros ("defines") to pass to the compiler (provided as semi-colon delimited list)
ru_ru: макросы («defines») для передачи компилятору (представленные в виде списка с пунктами, разделёнными точкой с запятой)

source: Pre Compiled Header
ru_ru: Предварительно скомпилированный заголовок

source: Header File
ru_ru: Заголовочный файл

source: Pre compiled header
ru_ru: Предварительно скомпилированный заголовок

source: Explicitly Include PCH
ru_ru: Явно включать PCH

source: Explicitly include the PCH file in the command line using a compiler switch (.e.g -include /path/to/pch)
ru_ru: Явно включать файл PCH в командную строку, используя переключатель компилятора (например, -include /путь/к/pch)

source: PCH Compile Flags
ru_ru: Флаги компиляции PCH

source: Use separate compilation flags for the PCH file
ru_ru: Использовать отдельные флаги компиляции для файла PCH

source: Replace
ru_ru: Заменить

source: Append
ru_ru: Добавить

source: Just Include
ru_ru: Просто включить

source: PCH Compile Flags Policy
ru_ru: Политика флагов компиляции PCH

source: When compiling a PCH, use the value set in PCH compile Flags as follows: - Append: append the value - Replace: replace any other compile flags with this value (not recommended) - Just Include: don't attempt to build the PCH, just include it
ru_ru: При компиляции PCH-файла значение, установленное во флагах его компиляции, будет использоваться следующим образом: — Добавить: добавить значение. — Заменить: заменить другие флаги компиляции этим значением (не рекомендуется). — Просто включить: не пытаться выполнить сборку PCH-файла, а просто включить этот файл

source: Linker is not required for this project
ru_ru: Для этого проекта не требуется компоновщик

source: Use with global settings
ru_ru: Использование с глобальными параметрами

source: Define how CodeLite will merge the linker settings defined in the 'Global Settings' with the settings defined on this page
ru_ru: Определите, как CodeLite будет объединять параметры компоновщика, указанные в разделе «Глобальные параметры», с параметрами, указанными на этой странице

source: Add additional linker options separated by semi-colon
ru_ru: Добавьте дополнительные параметры компоновщика, разделяя их точкой с запятой

source: Libraries Search Path
ru_ru: Путь поиска библиотек

source: Add additional library search paths separated by semi-colon
ru_ru: Добавьте дополнительные пути поиска библиотек, разделяя их точкой с запятой

source: Libraries
ru_ru: Библиотеки

source: Enter any extra library names, separated by';' e.g. Foo or Foo;Bar
ru_ru: Введите любые дополнительные имена библиотек, разделяя их точкой с запятой, например Foo или Foo;Bar

source: Select debugger path. Leave empty to use the default:
ru_ru: Выберите путь к отладчику. Оставьте поле пустым, чтобы использовать значение по умолчанию:

source: Debugger Search Paths
ru_ru: Пути поиска отладчика

source: &Add..
ru_ru: &Добавить..

source: &Delete...
ru_ru: &Удалить...

source: Enter here any commands that should be passed to the debugger on startup:
ru_ru: Введите здесь любые команды, которые следует передать отладчику при запуске:

source: Remote Attach Commands
ru_ru: Команды удалённого присоединения

source: Enter here any commands that should be passed to the debugger after attaching the remote target:
ru_ru: Введите здесь любые команды, которые следует передать отладчику после присоединения удалённой цели:

source: Debugging a remote target
ru_ru: Отладка удалённой цели

source: Host / tty:
ru_ru: Хост/tty:

source: Extended Protocol
ru_ru: Расширенный протокол

source: Enable extended mode. In extended mode, the remote server is made persistent. i.e. it does not go down after the debug session ends
ru_ru: Включить расширенный режим. В расширенном режиме удалённый сервер становится постоянным. То есть он не отключается после завершения сеанса отладки

source: Resources
ru_ru: Ресурсы

source: Resource Compiler Options
ru_ru: Параметры компилятора ресурсов

source: Resource compiler options provided as semi-colon list
ru_ru: Параметры компилятора ресурсов представлены в виде списка с пунктами, разделёнными точкой с запятой

source: Additional Search Path
ru_ru: Дополнительный путь поиска

source: Resource compiler search path, as semi colon list
ru_ru: Путь поиска компилятора ресурсов в виде списка с пунктами, разделёнными точкой с запятой

source: Environment variable set to use:
ru_ru: Набор переменных среды:

source: Debugger 'PreDefined Types' set to use:
ru_ru: Набор предопределённых типов отладчика:

source: Additional environment variables:
ru_ru: Дополнительные переменные среды:

source: Enable custom build
ru_ru: Включить пользовательскую сборку

source: Working Directory:
ru_ru: Рабочий каталог:

source: Target
ru_ru: Цель

source: Additional compiler options to pass to the compiler provided as a semi-colon delimited list These settings are used by _all_ build configurations (e.g. Release and Debug)
ru_ru: Дополнительные параметры для передачи компилятору, представленные в виде списка с пунктами, разделёнными точкой с запятой. Эти параметры используются для _всех_ конфигураций сборки (например, выпуска и отладки)

source: Additional C compiler options to pass to the compiler provided as a semi-colon delimited list These settings are used by _all_ build configurations (e.g. Release and Debug)
ru_ru: Дополнительные параметры для передачи компилятору С, представленные в виде списка с пунктами, разделёнными точкой с запятой. Эти параметры используются для _всех_ конфигураций сборки (например, выпуска и отладки)

source: Additional Include Paths
ru_ru: Дополнительные пути поиска включаемых файлов

source: Compiler search paths for header files. These settings are used by _all_ build configurations (e.g. Release and Debug)
ru_ru: Пути поиска компилятора для заголовочных файлов. Эти параметры используются для _всех_ конфигураций сборки (например, выпуска и отладки)

source: Additional preprocessors definitions provided as a semi-colon delimited list These settings are used by _all_ build configurations (e.g. Release and Debug)
ru_ru: Дополнительные определения препроцессоров, представленные в виде списка с пунктами, разделёнными точкой с запятой. Эти параметры используются для _всех_ конфигураций сборки (например, выпуска и отладки)

source: Additional linker options provided as a semi-colon delimited list These settings are used by _all_ build configurations (e.g. Release and Debug)
ru_ru: Дополнительные параметры компоновщика, представленные в виде списка с пунктами, разделёнными точкой с запятой. Эти параметры используются для _всех_ конфигураций сборки (например, выпуска и отладки)

source: Library Path
ru_ru: Путь к библиотеке

source: Additional library search path provided as a semi-colon delimited list These settings are used by _all_ build configurations (e.g. Release and Debug)
ru_ru: Дополнительные пути поиска библиотек представлены в виде списка с пунктами, разделёнными точкой с запятой. Эти настройки используются для _всех_ конфигураций сборки (например, выпуска и отладки)

source: Dependencies:
ru_ru: Зависимости:

source: Rule action:
ru_ru: Действие правила:

source: Define here a custom makefile rule to be executed in the pre-build steps. See the wiki for more help
ru_ru: Определите здесь пользовательское правило Makefile, которое будет выполняться на этапах перед сборкой. Дополнительные сведения доступны в Wiki

source: Search paths:
ru_ru: Пути поиска:

source: Macros (clang only):
ru_ru: Макросы (только clang):

source: Target Name:
ru_ru: Имя цели:

source: Project Name:
ru_ru: Имя проекта:

source: Configuration:
ru_ru: Конфигурация:

source: Project Settings
ru_ru: Параметры проекта

source: Build Target
ru_ru: Цель сборки

source: Copy Compiler Settings
ru_ru: Копировать параметры компилятора

source: Environment
ru_ru: Среда

source: Pre / Post Build Commands
ru_ru: Команды, выполняемые перед сборкой и после сборки

source: Pre Build
ru_ru: Перед сборкой

source: Post Build
ru_ru: После сборки

source: Customize
ru_ru: Настройка

source: Custom Build
ru_ru: Пользовательская сборка

source: Custom Makefile Rules
ru_ru: Пользовательские правила Makefile

source: Global Settings
ru_ru: Глобальные параметры

source: Save Changes
ru_ru: Сохранить изменения

source: Save changes before loading new configuration?
ru_ru: Сохранить изменения перед загрузкой новой конфигурации?

source: Project Settings
ru_ru: Параметры проекта

source: This project is disabled
ru_ru: Этот проект отключён

source: The settings on this page are ignored during build
ru_ru: Параметры на этой странице игнорируются во время сборки

source: Set the commands to run in the pre build stage
ru_ru: Установите команды, которые следует выполнить на этапе перед сборкой

source: Set the commands to run in the post build stage
ru_ru: Установите команды, которые следует выполнить на этапе после сборки

source: Commands starting with the hash sign ('#'), will not be executed
ru_ru: Команды, начинающиеся с символа «решётка» («#»), выполняться не будут

source: Compiler options
ru_ru: Параметры компилятора

source: Target '%s' already exist!
ru_ru: Цель «%s» уже существует!

source: Adjust settings to fit this generator?
ru_ru: Настроить параметры в соответствии с этим генератором?

source: Choose a directory
ru_ru: Выбрать каталог

source: Linker options
ru_ru: Параметры компоновщика

source: Local
ru_ru: Локальный

source: Debugger:
ru_ru: Отладчик:

source: Executable:
ru_ru: Исполняемый файл:

source: Provide an alternate debugger executable to use. This is currently only supported for GDB Leave empty to use the default
ru_ru: Укажите альтернативный исполняемый файл отладчика. Этот файл сейчас поддерживается только для GDB. Оставьте поле пустым, чтобы использовать значение по умолчанию

source: Select debugger executable
ru_ru: Выберите исполняемый файл отладчика

source: Debuggee:
ru_ru: Отлаживаемый объект:

source: Enter the filepath to the program that you want to debug. Alternatively, if you enter the path below, putting just the filename here will suffice.
ru_ru: Введите путь к файлу программы, которую необходимо отладить. Как вариант, если ввести путь ниже, будет достаточно указать здесь только имя файла.

source: Select executable to debug
ru_ru: Выберите исполняемый файл для отладки

source: Arguments:
ru_ru: Аргументы:

source: Optionally, enter the path where the program that you want to debug can be found
ru_ru: При необходимости введите путь к программе, которую необходимо отладить

source: Browse for working directory
ru_ru: Выбор рабочего каталога

source: Startup commands:
ru_ru: Команды запуска:

source: SSH Account:
ru_ru: Учётная запись SSH:

source: Select debugger executable on the remote machine
ru_ru: Выберите исполняемый файл отладчика на удалённом компьютере

source: Executable to debug on the remote machine
ru_ru: Исполняемый файл для отладки на удалённом компьютере

source: Quick Debug
ru_ru: Быстрая отладка

source: Choose debugger:
ru_ru: Отладчик:

source: Select gdb
ru_ru: Выбрать GDB

source: Select working directory
ru_ru: Выбрать рабочий каталог

source: Case Sensitive
ru_ru: С учётом регистра

source: Whole word
ru_ru: Только слово целиком

source: In Selection
ru_ru: В выделенном фрагменте

source: No matches found
ru_ru: Совпадений не найдено

source: Selected %lu matches
ru_ru: Выбрано %lu совп.

source: result
ru_ru: результат

source: Found
ru_ru: Найдено:

source: Made %d replacements
ru_ru: Сделано %d зам.
