Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Select project:
ru_ru: Выбрать проект:

source: Pin Project
ru_ru: Закрепить проект

source: Build project
ru_ru: Сборка проекта

source: Rebuild
ru_ru: Восстановить

source: Rebuild project
ru_ru: Восстановить проект

source: Clean
ru_ru: Очистить

source: Clean project
ru_ru: Очистить проект

source: Stop Build
ru_ru: Остановить сборку

source: Project Only
ru_ru: Только проект

source: Build Order...
ru_ru: Порядок сборки...

source: Open Containing Folder
ru_ru: Открыть содержащую папку

source: Open Shell
ru_ru: Открыть командный интерпретатор

source: Make Active (double click)
ru_ru: Сделать активным (двойной щелчок)

source: Import Files From Directory...
ru_ru: Импорт файлов из каталога...

source: Reconcile Project...
ru_ru: Согласовать проект...

source: New Virtual Folder
ru_ru: Создать виртуальную папку

source: Remove Project
ru_ru: Удалить проект

source: Rename Project
ru_ru: Переименовать проект

source: Save As Template...
ru_ru: Сохранить как шаблон...

source: Project Editor Preferences...
ru_ru: Параметры редактора проекта...

source: Clear Background Colour
ru_ru: Очистить цвет фона

source: Plugins...
ru_ru: Модули...

source: New Workspace Folder
ru_ru: Создать папку рабочего пространства

source: Add an Existing Project...
ru_ru: Добавить существующий проект…

source: Are you sure you want to delete the following workspace folders:
ru_ru: Вы уверены, что хотите удалить следующие папки рабочего пространства:

source: Are you sure you want to delete the workspace folder:
ru_ru: Вы уверены, что хотите удалить папку рабочего пространства:

source: Enter folder name:
ru_ru: Введите имя папки:

source: New Folder Name
ru_ru: Имя новой папки

source: Open Project
ru_ru: Открыть проект

source: Find :
ru_ru: Найти:

source: Find what
ru_ru: Найти

source: &Find
ru_ru: &Найти

source: Begin search
ru_ru: Начать поиск

source: Replace:
ru_ru: Заменить:

source: Replace with
ru_ru: Заменить на

source: &Replace
ru_ru: &Заменить

source: Search for matches and place them in the 'Replace' window as candidates for possible replace operation
ru_ru: Поиск соответствий и помещение их в окно «Замена» в качестве вариантов возможной замены

source: Files:
ru_ru: Файлы:

source: File extensions to include in the search Wildcards are supported
ru_ru: Расширения файлов, которые следует включать в поиск. Поддерживаются подстановочные знаки

source: Search these file types
ru_ru: Искать эти типы файлов

source: Where:
ru_ru: Где:

source: Search in these folders To exclude a file from the search, use wildcard that starts with an hyphen ("-") For example, to exclude all matches from the node_modules folder, one can use something like: /home/user/path/to/root/folder -*node_modules*
ru_ru: Поиск в этих папках. Чтобы исключить файл из поиска, используйте подстановочный знак, начинающийся с дефиса («-»). Например, чтобы исключить все совпадения из папки node_modules, можно использовать следующее: /home/user/path/to/root/folder -*node_modules*

source: Add new search location
ru_ru: Добавить новое расположение для поиска

source: Encoding:
ru_ru: Кодировка:

source: Close this dialog
ru_ru: Закрыть это диалоговое окно

source: Case
ru_ru: С учётом регистра

source: Toggle case sensitive search
ru_ru: Включить или отключить поиск с учётом регистра

source: Word
ru_ru: Только слово целиком

source: Toggle whole word search
ru_ru: Включить или отключить поиск только слова целиком

source: Regex
ru_ru: Регулярное выражение

source: The 'Find What' field is a regular expression
ru_ru: Поле «Найти» является регулярным выражением

source: Pipe filter
ru_ru: Использовать фильтр с вертикальной чертой

source: Use the pipe character ("|") as a special separator for applying additional filters. This has the similar effect as using the "grep" command line tool
ru_ru: Используйте знак вертикальной черты («|») в качестве специального разделителя для применения дополнительных фильтров. Это даёт результат, аналогичный использованию инструмента командной строки «grep»

source: Save before
ru_ru: Сохранять до начала поиска

source: Save any modified files before search starts
ru_ru: Сохранять любые изменённые файлы до начала поиска

source: File System:
ru_ru: Файловая система:

source: Symlinks
ru_ru: Символические ссылки

source: When enabled, follow symbolic links folders
ru_ru: Если включено, будут использоваться символические ссылки на папки

source: Hidden folders
ru_ru: Скрытые папки

source: Search in hidden folders
ru_ru: Поиск в скрытых папках

source: Presets:
ru_ru: Шаблоны:

source: Search for TODO patterns in the code This options enables regular expression
ru_ru: Поиск TODO-шаблонов в коде. Этот параметр позволяет использовать регулярное выражение

source: Search for ATTN patterns in the code This options enables regular expression
ru_ru: Поиск ATTN-шаблонов в коде. Этот параметр позволяет использовать регулярное выражение

source: Search for BUG patterns in the code This options enables regular expression
ru_ru: Поиск BUG-шаблонов в коде. Этот параметр позволяет использовать регулярное выражение

source: Search for FIXME patterns in the code This options enables regular expression
ru_ru: Поиск FIXME-шаблонов в коде. Этот параметр позволяет использовать регулярное выражение

source: Add Folder...
ru_ru: Добавить папку...

source: Remove
ru_ru: Удалить

source: Remove the selected path
ru_ru: Удалить выбранный путь

source: Find In Files
ru_ru: Найти в файлах

source: Edit Search Locations
ru_ru: Изменить расположение для поиска

source: Clear history
ru_ru: Очистить журнал

source: Add Exclude Pattern
ru_ru: Добавить шаблон исключения

source: 'Find What' is empty
ru_ru: Поле «Найти» пусто

source: Find / Replace
ru_ru: Поиск и замена

source: Stop current search
ru_ru: Остановить текущий поиск

source: Show Recent Searches
ru_ru: Показать предыдущие поисковые запросы

source: Another search is currently running, try again later
ru_ru: Выполняется другой поиск. Повторите попытку позже

source: '; Match case:
ru_ru: '; С учётом регистра:

source: ====== Searching for: '
ru_ru: ====== Поиск: '

source: ; Match whole word:
ru_ru: ; Только слово целиком:

source: ; Regular expression:
ru_ru: ; Регулярное выражение:

source: ====== Search cancelled by user ======
ru_ru: ====== Поиск отменён пользователем ======

source: Reached the end of the 'Find In Files' results
ru_ru: Достигнут конец результатов поиска в файлах

source: Reached the start of the 'Find In Files' results
ru_ru: Достигнуто начало результатов поиска в файлах

source: Search result is no longer valid
ru_ru: Результат поиска больше не действителен

source: Clear History
ru_ru: Очистить журнал

source: Failed to open file:
ru_ru: Не удалось открыть файл:

source: Failed to download file:
ru_ru: Не удалось загрузить файл:

source: Configuration Manager...
ru_ru: Диспетчер конфигураций...

source: Batch Build...
ru_ru: Пакетная сборка...

source: Build Project
ru_ru: Сборка проекта

source: Build Workspace
ru_ru: Выполнить сборку рабочего пространства

source: Rebuild Workspace
ru_ru: Пересобрать рабочее пространство

source: Clean Workspace
ru_ru: Очистить рабочее пространство

source: Compile Current File
ru_ru: Компилировать текущий файл

source: Compile Current File's Project
ru_ru: Компилировать проект текущего файла

source: Clean Project
ru_ru: Очистить проект

source: Rebuild Project
ru_ru: Пересобрать проект

source: Build and Run Project
ru_ru: Собрать и выполнить проект

source: Next Build Error
ru_ru: Следующая ошибка сборки

source: Swap Header/Implementation file
ru_ru: Переключение между заголовочным файлом и файлом реализации

source: Goto Declaration
ru_ru: Объявление Goto

source: Goto Implementation
ru_ru: Реализация Goto

source: Open Include File
ru_ru: Открыть включаемый файл

source: Add Include File
ru_ru: Добавить включаемый файл

source: C++ | Code Generation / Refactoring
ru_ru: Генерация или оптимизация кода C++ |

source: Generate Setters/Getters...
ru_ru: Создать методы считывания и присваивания...

source: Move Function Implementation to...
ru_ru: Переместить реализацию функции в...

source: Add Function Implementation...
ru_ru: Добавить реализацию функции...

source: Implement all Un-implemented Functions...
ru_ru: Реализовать все нереализованные функции...

source: Debugger
ru_ru: Отладчик

source: Start/Continue Debugger
ru_ru: Начать или продолжить работу отладчика

source: Restart Debugger
ru_ru: Перезапустить отладчик

source: Attach to process...
ru_ru: Подключиться к процессу...

source: Pause debugger
ru_ru: Приостановить отладчик

source: Stop debugger
ru_ru: Остановить отладчик

source: Step Into
ru_ru: Шаг с заходом

source: Step Out
ru_ru: Шаг с выходом

source: Step Into Instruction
ru_ru: Шаг с заходом по инструкциям

source: Next
ru_ru: Следующий

source: Next Instruction
ru_ru: Следующая инструкция

source: Show Cursor
ru_ru: Показать курсор

source: Toggle Breakpoint
ru_ru: Поставить или убрать точку останова

source: Disable All Breakpoints
ru_ru: Отключить все точки останова

source: Enable All Breakpoints
ru_ru: Включить все точки останова

source: Delete All Breakpoints
ru_ru: Удалить все точки останова

source: Quick Debug...
ru_ru: Быстрая отладка...

source: Duplicate Selection / Line
ru_ru: Дублировать выделенное или строку

source: Delete to Line End
ru_ru: Удалить до конца строки

source: Delete to Line Start
ru_ru: Удалить до начала строки

source: Delete Line
ru_ru: Удалить строку

source: Copy Line
ru_ru: Копировать строку

source: Cut Line
ru_ru: Вырезать строку

source: Split selection into lines
ru_ru: Разделить выбранный фрагмент на строки

source: Make Lowercase
ru_ru: Все строчные

source: Make Uppercase
ru_ru: Все прописные

source: Insert Comment Block
ru_ru: Вставить блок комментария

source: Comment Line
ru_ru: Закомментировать строку

source: Comment Selection
ru_ru: Закомментировать выделенный текст

source: Transpose Lines
ru_ru: Переставить строки

source: Move Line Up
ru_ru: Переместить строку вверх

source: Move Line Down
ru_ru: Переместить строку вниз

source: Convert Indentation to Tabs
ru_ru: Преобразовать отступ в шаги табуляции

source: Convert Indentation to Spaces
ru_ru: Преобразовать отступ в пробелы

source: Center Line in Editor
ru_ru: Разместить строку по центру редактора

source: Select All
ru_ru: Выбрать все

source: Match Brace
ru_ru: Парная скобка

source: Select to Brace
ru_ru: Выделить до другой скобки

source: Code Complete
ru_ru: Автозавершение кода

source: Complete Word
ru_ru: Завершить слово

source: Display Function Calltip
ru_ru: Отображать подсказку при вызове функции

source: Convert to Windows Format
ru_ru: Преобразовать в формат Windows

source: Convert to Unix Format
ru_ru: Преобразовать в формат Unix

source: Trim Trailing Spaces
ru_ru: Удалить конечные пробелы

source: Copy Path Relative to Workspace
ru_ru: Копировать путь относительно рабочего пространства

source: Copy Path to Clipboard
ru_ru: Копировать путь в буфер обмена

source: Copy Full Path to Clipboard
ru_ru: Копировать полный путь в буфер обмена

source: Copy File Name to Clipboard
ru_ru: Копировать имя файла в буфер обмена

source: New File
ru_ru: Создать файл

source: Open File...
ru_ru: Открыть файл...

source: Reload File
ru_ru: Перезагрузить файл

source: Save File
ru_ru: Сохранить файл

source: Duplicate Tab
ru_ru: Дублировать вкладку

source: Save As...
ru_ru: Сохранить как...

source: Print...
ru_ru: Печать...

source: Exit
ru_ru: Выход

source: Manage Plugins...
ru_ru: Управление модулями...

source: Plugins
ru_ru: Модули

source: Search
ru_ru: Поиск

source: Grep Selection in the Current File
ru_ru: Выбор Grep в текущем файле

source: Grep Selection in the Workspace
ru_ru: Выбор Grep в рабочем пространстве

source: Search for Selection with default browser
ru_ru: Поиск выбранного текста в браузере по умолчанию

source: Goto Anything
ru_ru: Поиск пункта меню

source: Find Previous
ru_ru: Найти ранее

source: Find Resource...
ru_ru: Найти ресурс...

source: Quick Outline...
ru_ru: Быстрый вызов Outline...

source: Search | Bookmarks
ru_ru: Поиск | Закладки

source: Toggle Bookmark
ru_ru: Добавить или снять закладку

source: Next Bookmark
ru_ru: Следующая закладка

source: Previous Bookmark
ru_ru: Предыдущая закладка

source: Remove All Currently-Active Bookmarks
ru_ru: Удалить все активные закладки

source: Open Shell From File Path
ru_ru: Открыть командный интерпретатор из пути файла

source: Search | Find In Files
ru_ru: Поиск | Найти в файлах

source: Find In Files...
ru_ru: Найти в файлах...

source: Go to Next 'Find In File' Match
ru_ru: Перейти к следующему совпадению поиска в файле

source: Go to Previous 'Find In File' Match
ru_ru: Перейти к предыдущему совпадению поиска в файле

source: Search | Find and Replace
ru_ru: Поиск | Найти и заменить

source: Find...
ru_ru: Найти...

source: Quick Add Next
ru_ru: Быстро добавить следующее

source: Quick Find All
ru_ru: Быстро найти все

source: Replace...
ru_ru: Заменить...

source: Find Next
ru_ru: Найти далее

source: Find Word At Caret
ru_ru: Найти слово в позиции курсора

source: Find Word At Caret Backward
ru_ru: Найти слово в позиции курсора в обратном направлении

source: Go To Previous Location
ru_ru: Вернуться к предыдущему расположению

source: Search | Go To
ru_ru: Поиск | Перейти

source: Go To Forward Location
ru_ru: Перейти к следующему расположению

source: Go To Line...
ru_ru: Перейти к строке...

source: Preferences
ru_ru: Параметры

source: Colours and Fonts...
ru_ru: Цвета и шрифты...

source: Keyboard shortcuts...
ru_ru: Комбинации клавиш...

source: Environment Variables...
ru_ru: Переменные среды...

source: Build Settings...
ru_ru: Параметры сборки...

source: GDB Settings...
ru_ru: Параметры GDB...

source: Code Completion...
ru_ru: Автозавершение кода...

source: Show Recent Tabs Dialog
ru_ru: Показать диалоговое окно с последними вкладками

source: Tab
ru_ru: Вкладки

source: Move Tab Left
ru_ru: Переместить вкладку влево

source: Move Tab Right
ru_ru: Переместить вкладку вправо

source: Word Wrap
ru_ru: Перенос на новую строку

source: Toggle Current Fold
ru_ru: Свернуть или развернуть текущую свёртываемую область

source: Toggle All Folds
ru_ru: Свернуть или развернуть все свёртываемые области

source: Toggle All Topmost Folds in Selection
ru_ru: Свернуть или развернуть все верхние свёртываемые области в выделении

source: Toggle Every Fold in Selection
ru_ru: Свернуть или развернуть каждую свёртываемую область в выделении

source: Display EOL
ru_ru: Отображать конец строки

source: Next tab
ru_ru: Следующая вкладка

source: Previous tab
ru_ru: Предыдущая вкладка

source: Full Screen...
ru_ru: Полноэкранный режим...

source: Output Pane
ru_ru: Область вывода

source: Workspace Pane
ru_ru: Область рабочего пространства

source: Debugger Pane
ru_ru: Область отладчика

source: Navigation Bar
ru_ru: Панель навигации

source: Toggle All Panes
ru_ru: Отобразить или скрыть все области

source: Toggle Minimal View
ru_ru: Включить или отключить минимальный вид

source: Show Menu Bar
ru_ru: Показать меню

source: Show Status Bar
ru_ru: Показывать строку состояния

source: Show Tool Bar
ru_ru: Показать панель инструментов

source: View | Show Whitespace
ru_ru: Вид | Показать пробелы

source: Show Always
ru_ru: Показывать всегда

source: Visible After First Indent
ru_ru: Отображать после первого отступа

source: Indentation Only
ru_ru: Только добавление отступа

source: View | Zoom
ru_ru: Вид | Масштаб

source: Zoom In
ru_ru: Увеличить

source: Zoom Out
ru_ru: Уменьшить

source: Reset Zoom
ru_ru: Сбросить масштаб

source: New Workspace...
ru_ru: Создать рабочее пространство...

source: Workspace
ru_ru: Рабочее пространство

source: Open Workspace...
ru_ru: Открыть рабочее пространство...

source: Close Workspace
ru_ru: Закрыть рабочее пространство

source: Reload Workspace
ru_ru: Перезагрузить рабочее пространство

source: Workspace Settings...
ru_ru: Параметры рабочего пространства...

source: Workspace Editor Preferences...
ru_ru: Параметры редактора рабочего пространства...

source: Import other IDEs solution/workspace files...
ru_ru: Импорт файлов другого решения или рабочего пространства IDE...

source: Open Active Project Settings...
ru_ru: Открыть параметры активного проекта...

source: Create New Project
ru_ru: Создать новый проект

source: Add an Existing Project
ru_ru: Добавить существующий проект

source: Parse Workspace
ru_ru: Анализ рабочего пространства

source: Output View
ru_ru: Панель вывода

source: Workspace View
ru_ru: Панель рабочего пространства

source: New file
ru_ru: Создать файл

source: Open file
ru_ru: Открыть файл

source: Backward
ru_ru: Назад

source: Forward
ru_ru: Вперёд

source: Build Active Project
ru_ru: Сборка активного проекта

source: Stop Current Build
ru_ru: Остановить текущую сборку

source: Clean Active Project
ru_ru: Очистить активный проект

source: Run Active Project
ru_ru: Выполнить активный проект

source: Stop Running Program
ru_ru: Остановить выполнение программы

source: Start or Continue debugger
ru_ru: Начать или продолжить работу отладчика

source: Applying your choices and restarting CodeLite
ru_ru: Применение выбранных вариантов и перезапуск CodeLite

source: Applying your choices, this may take a few seconds
ru_ru: Применение выбранных вариантов, это может занять несколько секунд

source: Eran Ifrah (Project admin)
ru_ru: Eran Ifrah (администратор проекта)

source: CodeLite Home
ru_ru: Главная страница CodeLite

source: CodeLite, a free, open source, C/C++/Rust/Python/PHP and JavaScript IDE
ru_ru: CodeLite, свободная интегрированная среда разработки для C/C++/Rust/Python/PHP и JavaScript с открытым исходным кодом

source: ' is modified Continue with reload?
ru_ru: ' изменён. Продолжить перезагрузку?

source: File '
ru_ru: Файл '

source: Open File
ru_ru: Открыть файл

source: Please enter a name for the tab group
ru_ru: Введите имя для группы вкладок

source: There is already a file with this name. Do you want to overwrite it?
ru_ru: Файл с таким именем же существует. Вы хотите перезаписать его?

source: Tab group saved
ru_ru: Группа вкладок сохранена

source: Select the workspace type:
ru_ru: Тип рабочего пространства:

source: Build ended with errors Continue with execute?
ru_ru: Сборка завершилась с ошибками. Продолжить выполнение?

source: Cancel
ru_ru: Отмена

source: Execute
ru_ru: Выполнить

source: Build starting...
ru_ru: Запуск сборки...

source: Would you like to build the active project before executing it?
ru_ru: Вы хотите выполнить сборку активного проекта перед его выполнением?

source: Build and Execute
ru_ru: Собрать и выполнить

source: Execute
ru_ru: Выполнить

source: A workspace reparse is needed
ru_ru: Требуется повторный анализ рабочего пространства

source: Open IDE Solution/Workspace File
ru_ru: Открыть файл решения/рабочего пространства IDE

source: Choose compiler
ru_ru: Выбрать компилятор

source: Select the compiler to use:
ru_ru: Компилятор:

source: Attempting to debug workspace with no active project? Ignoring.
ru_ru: Попытка отладки рабочего пространства без активного проекта? Игнорируется.

source: Would you like to build the project before debugging it?
ru_ru: Вы хотите выполнить сборку проекта перед его отладкой?

source: Build and Debug
ru_ru: Собрать и отладить

source: CodeLite now offers a better editor colour theme support, would you like to fix this now?
ru_ru: CodeLite теперь предоставляет улучшенную поддержку цветовой схемы редактора. Выполнить исправление сейчас?

source: You already have the latest version of CodeLite
ru_ru: У вас уже есть последняя версия CodeLite

source: A new version of CodeLite is available for download
ru_ru: Новая версия CodeLite доступна для скачивания

source: Download
ru_ru: Загрузить

source: Could not start TTY console for debugger!
ru_ru: Не удалось запустить консоль TTY для отладчика!

source: Workspace or project settings have been modified outside of CodeLite Would you like to reload the workspace?
ru_ru: Рабочее пространство или параметры проекта были изменены вне CodeLite Вы хотите перезагрузить рабочее пространство?

source: Not now
ru_ru: Не сейчас

source: Reload workspace
ru_ru: Перезагрузить рабочее пространство

source: Reload CodeLite?
ru_ru: Перезагрузить CodeLite?

source: Build
ru_ru: Сборка

source: Project Only
ru_ru: Только проект

source: Clean
ru_ru: Очистить

source: Select Folder
ru_ru: Выбрать папку

source: Select Project
ru_ru: Выбрать проект

source: Implement inherited virtual functions
ru_ru: Реализовать наследованные виртуальные функции

source: Select from the list below the functions that you want to override in your class
ru_ru: Выберите из списка ниже функции, которые вы хотите переопределить в своём классе

source: File:
ru_ru: Файл:

source: Generate the functions in this filename
ru_ru: Создать функции в этом файле

source: Visibility
ru_ru: Видимость

source: Virtual
ru_ru: Виртуальная

source: Override
ru_ru: Переопределить

source: Document
ru_ru: Документ

source: Check all
ru_ru: Отметить все

source: Uncheck all
ru_ru: Снять все отметки

source: Format text after insertion
ru_ru: Форматировать текст после вставки

source: Implement Parent Virtual Functions
ru_ru: Реализация виртуальных функций родительского класса

source: Import Files
ru_ru: Импорт файлов

source: Select the directories to import from
ru_ru: Каталоги для импорта данных

source: Check the folders you wish to import files from
ru_ru: Отметьте папки, из которых вы хотите импортировать файлы

source: Folder
ru_ru: Папка

source: Files extension to import (semicolon delimited):
ru_ru: Расширения файлов для импорта (разделённые точкой с запятой):

source: Import files without extensions
ru_ru: Импорт файлов без расширений

source: If you wish to import files without extensions, tick this option
ru_ru: Если вы хотите импортировать файлы без расширений, установите этот флажок

source: Address
ru_ru: Адрес

source: Current scope is now set to: "%s", depth: %d
ru_ru: Текущая область теперь установлена в: «%s», глубина: %d

source: Change value...
ru_ru: Изменить значение...

source: Edit expression
ru_ru: Редактировать выражение

source: Insert new value for '%s':
ru_ru: Добавить новое значение для «%s»:

source: Save changes to '
ru_ru: Сохранить изменения в '

source: Save Modified Files
ru_ru: Сохранить изменённые файлы

source: Some files are modified. Choose the files you would like to save.
ru_ru: Некоторые файлы изменены. Выберите файлы, которые вы хотите сохранить.

source: Reload Modified Files
ru_ru: Перезагрузить изменённые файлы

source: Files have been modified outside the editor. Choose which files you would like to reload.
ru_ru: Файлы были изменены вне редактора. Выберите файлы, которые вы хотите перезагрузить.

source: Please save your changes before marking the file as read only
ru_ru: Сохраните свои изменения, прежде чем отметить файл как доступный только для чтения

source: Save the current layout as:
ru_ru: Сохранить текущий макет как:

source: Perspectives...
ru_ru: Перспективы...

source: Save Perspective As...
ru_ru: Сохранить перспективу как...

source: Welcome!
ru_ru: Добро пожаловать!

source: ' already exists
ru_ru: ' уже существует

source: A file with similar name '
ru_ru: Файл с похожим именем '

source: Overwrite it?
ru_ru: Перезаписать его?

source: Warning
ru_ru: Предупреждение

source: Importing IDE solution/workspace...
ru_ru: Импорт решения/рабочего пространства IDE...

source: Solution/workspace unsupported
ru_ru: Решение или рабочее пространство не поддерживается

source: There is already a file in this folder with a name: %s that matches using case-insensitive comparison
ru_ru: В этой папке уже существует файл с именем: %s которое совпадает при использовании сравнения без учёта регистра
