Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Select the location of codelite's source tree
ru_ru: Выберите расположение дерева исходного кода СodeLite

source: Project path:
ru_ru: Путь к проекту:

source: Select the plugin project path
ru_ru: Выберите путь к проекту модуля

source: New Plugin Wizard
ru_ru: Мастер создания новых модулей

source: Class Name:
ru_ru: Имя класса:

source: The class name
ru_ru: Имя класса

source: Namespace:
ru_ru: Пространство имён:

source: Place this class inside a namespace
ru_ru: Поместите этот класс в пространство имён

source: Inherits:
ru_ru: Наследует от:

source: File name:
ru_ru: Имя файла:

source: This is the base-name for the file(s) that will be generated. If the new class is called Foo, by default the files will be Foo.cpp and Foo.h. If you'd prefer different names, type the base-name here.
ru_ru: Это базовое имя для файла(ов), которые будут созданы. Если новый класс будет назван Foo, то по умолчанию файлы будут называться Foo.cpp и Foo.h. Если вы предпочитаете другие имена, введите базовое имя здесь.

source: Block Guard:
ru_ru: Условие блокировки:

source: Set block guard to prevent multiple file inclusion. If left empty, the class name is used
ru_ru: Установите условие блокировки, чтобы предотвратить включение нескольких файлов. Если оставить поле пустым, будет использовано имя класса

source: Virtual Directory:
ru_ru: Виртуальный каталог:

source: The new class needs to be put somewhere. Select which of the project's virtual folders to use.
ru_ru: Новый класс необходимо куда-то поместить. Выберите виртуальную папку проекта.

source: Where on the filesystem should the new class's files be put? This will normally be the directory corresponding to the Virtual Directory; but you can enter an alternative directory here if you wish.
ru_ru: Где в файловой системе должны быть размещены файлы нового класса? Обычно это будет каталог, соответствующий виртуальному каталогу, но при желании вы можете указать здесь альтернативный каталог.

source: Create .hpp instead of .h
ru_ru: Создать .hpp, вместо.h

source: If checked, the generated header file will be foo.hpp instead of foo.h
ru_ru: Если флажок установлен, то создаваемый заголовочный файл будет называться foo.hpp, а не foo.h

source: Use lowercase file names
ru_ru: Использовать имена файлов в нижнем регистре

source: Use #pragma once
ru_ru: Использовать #pragma один раз

source: Advanced
ru_ru: Дополнительно

source: This is a singleton class
ru_ru: Это — singleton-класс

source: Virtual destructor
ru_ru: Виртуальный деструктор

source: Inline class
ru_ru: Встраиваемый класс

source: Put both the declaration and the implementation in the header file
ru_ru: Поместить объявление и реализацию в заголовочный файл

source: Prohibit further inheritance
ru_ru: Запретить дальнейшее наследование

source: Declare this class non-copyable
ru_ru: Объявить этот класс недоступным для копирования

source: Declare this class non-movable
ru_ru: Объявить этот класс неперемещаемым

source: New Class
ru_ru: Новый класс

source: ' is not a valid C++ qualifier
ru_ru: ' является недопустимым спецификатором C++

source: ': directory does not exist
ru_ru: ': каталог не существует

source: Empty file name
ru_ru: Пустое имя файла

source: A file with this name: '%s' already exists, continue anyway?
ru_ru: Файл с таким именем: «%s» уже существует, всё равно продолжить?

source: Please select a virtual directory
ru_ru: Выберите виртуальный каталог

source: Select Generated Files Path:
ru_ru: Путь к созданным файлам:

source: Choose a name to give the project
ru_ru: Выберите имя для проекта

source: Project Path:
ru_ru: Путь к проекту:

source: Application Type:
ru_ru: Тип приложения:

source: GUI application with Main Frame
ru_ru: Приложение с графическим интерфейсом с главным фреймом

source: GUI dialog-based application (wxFormBuilder)
ru_ru: Диалоговое приложение с графическим интерфейсом (wxFormBuilder)

source: GUI frame-based application (wxFormBuilder)
ru_ru: Фреймовое приложение с графическим интерфейсом (wxFormBuilder)

source: Simple main with wxWidgets enabled
ru_ru: Простое главное с включённым wxWidgets

source: The normal choice will be 'GUI application', but choose 'Simple main' for a wx console app
ru_ru: Обычный выбор — «Приложение с графическим интерфейсом», но для создания консольного приложения wx следует выбрать вариант «Простое главное»

source: Advanced Settings:
ru_ru: Дополнительные параметры:

source: Create the project under a separate directory
ru_ru: Создать проект в отдельном каталоге

source: Use precompiled headers
ru_ru: Использовать предварительно скомпилированные заголовки

source: Use MS Windows resources
ru_ru: Использовать ресурсы MS Windows

source: Add -mwindows flag to avoid a terminal console in MSWin GUI apps
ru_ru: Добавить флаг -mwindows, чтобы не использовать консоль терминала в приложениях MS Windows с графическим интерфейсом

source: Without this flag, there will be an unnecessary, visible terminal window when your app runs on MSWindows
ru_ru: Без этого флага при запуске вашего приложения в MS Windows появится лишнее видимое окно терминала

source: Basics
ru_ru: Основные

source: Use Unicode Build of wxWidgets
ru_ru: Использовать сборку Unicode wxWidgets

source: Uses an unicode configuration if found.
ru_ru: Использует конфигурацию Unicode, если она имеется.

source: Use Static wxWidgets libraries
ru_ru: Использовать статические библиотеки wxWidgets

source: Uses a static configuration if found.
ru_ru: Использует статическую конфигурацию, если она имеется.

source: Use Universal wxWidgets libraries
ru_ru: Использовать универсальные библиотеки wxWidgets

source: Uses an universal configuration if found.
ru_ru: Использует универсальную конфигурацию, если она имеется.

source: Use selected wxWidgets version.
ru_ru: Использовать выбранную версию wxWidgets.

source: Prefix:
ru_ru: Префикс:

source: Path of the wxWidgets installation (optional).
ru_ru: Путь установки wxWidgets (необязательно).

source: wxWidgets settings
ru_ru: Параметры wxWidgets

source: New wxWidgets Project
ru_ru: Новый проект wxWidgets

source: Default
ru_ru: По умолчанию

source: Invalid project name '
ru_ru: Недопустимое название проекта '

source: Valid characters for project name are [0-9A-Za-z_]
ru_ru: Допустимые символы для названия проекта: [0-9A-Za-z_]

source: Failed to create the path: %s A permissions problem, perhaps?
ru_ru: Не удалось создать путь: %s. Возможно, отсутствуют необходимые разрешения?

source: The Help plugin uses 'Dash' for displaying the offline documentation Please click the link below to download and install Dash
ru_ru: Модуль справки использует браузер Dash для показа документации в автономном режиме. Нажмите на ссылку ниже для загрузки и установки Dash

source: Go to Dash website
ru_ru: Перейти на веб-сайт Dash

source: The Help plugin uses 'Zeal' for displaying the offline documentation Please click the link below to download and install Zeal
ru_ru: Модуль справки использует браузер Zeal для показа документации в автономном режиме. Нажмите на ссылку ниже для загрузки и установки Zeal

source: Go to Zeal website
ru_ru: Перейти на веб-сайт Zeal

source: Download Zeal
ru_ru: Загрузить Zeal

source: Docsets
ru_ru: Наборы документов

source: Set a list of docsets to use when requesting help while inside a C/C++ files (comma separated list)
ru_ru: Задайте список наборов документов, которые будут использоваться при вызове справки во время работы с файлами C/C++ (элементы списка отделяются запятыми)

source: Set a list of docsets to use when requesting help while inside a PHP files (comma separated list)
ru_ru: Задайте список наборов документов, которые будут использоваться при вызове справки во время работы с файлами PHP (элементы списка отделяются запятыми)

source: CMake
ru_ru: Модуль интеграции CMake

source: Set a list of docsets to use when requesting help while inside a CMake files (comma separated list)
ru_ru: Задайте список наборов документов, которые будут использоваться при вызове справки во время работы с файлами CMake (элементы списка отделяются запятыми)

source: Set a list of docsets to use when requesting help while inside an HTML files (comma separated list)
ru_ru: Задайте список наборов документов, которые будут использоваться при вызове справки во время работы с файлами HTML (элементы списка отделяются запятыми)

source: Set a list of docsets to use when requesting help while inside an CSS files (comma separated list)
ru_ru: Задайте список наборов документов, которые будут использоваться при вызове справки во время работы с файлами CSS (элементы списка отделяются запятыми)

source: Set a list of docsets to use when requesting help while inside a JavaScript files (comma separated list)
ru_ru: Задайте список наборов документов, которые будут использоваться при вызове справки во время работы с файлами JavaScript (элементы списка отделяются запятыми)

source: Set a list of docsets to use when requesting help while inside a Java files (comma separated list)
ru_ru: Задайте список наборов документов, которые будут использоваться при вызове справки во время работы с файлами Java (элементы списка отделяются запятыми)

source: Help Plugin Error
ru_ru: Ошибка модуля справки

source: Provide help based on selected words
ru_ru: Предоставление справки на основе выбранных слов

source: HelpPlugin
ru_ru: Модуль справки

source: Help Plugin
ru_ru: Модуль справки

source: Search the docs for '
ru_ru: Найти в документации сведения о '

source: Language Server is still not ready...
ru_ru: Языковой сервер всё ещё не готов…

source: (hit ESCAPE key to dismiss)
ru_ru: (нажмите клавишу Escape, чтобы выйти)

source: Restarting Language Servers...
ru_ru: Перезапуск языковых серверов…

source: Ready
ru_ru: Готово

source: Select the supported languages by this server:
ru_ru: Выберите языки, поддерживаемые этим сервером:

source: Are you sure you want to delete '
ru_ru: Вы уверены, что хотите удалить '

source: Select Language Servers to add
ru_ru: Выберите языковые серверы, которые следует добавить

source: Enable Language Server Completion
ru_ru: Включить автозавершение кода с помощью языкового сервера

source: Available Language Servers
ru_ru: Доступные языковые серверы

source: Scan...
ru_ru: Найти…

source: Scan for installed Language Servers insalled
ru_ru: Проверить на наличие установленных языковых серверов

source: Add...
ru_ru: Добавить...

source: Add new Language Server
ru_ru: Добавить новый языковой сервер

source: Give this language server a unique name
ru_ru: Укажите уникальное имя для этого языкового сервера

source: Command:
ru_ru: Команда:

source: The language server executable
ru_ru: Исполняемый файл языкового сервера

source: Set the language server working directory
ru_ru: Укажите рабочий каталог языкового сервера

source: Languages:
ru_ru: Языки:

source: List of supported languages by this Language Server
ru_ru: Список языков, поддерживаемых этим языковым сервером

source: Show List of Languages
ru_ru: Показать список языков

source: Connection string:
ru_ru: Строка подключения:

source: Set the connection string here. If the server connects using 'stdio', choose the 'stdio' entry Otherwise, set a connection in the form of: tcp://127.0.0.1:12345
ru_ru: Укажите здесь строку подключения. Если сервер подключается с помощью «stdio», выберите запись «stdio». В ином случае укажите следующее: tcp://127.0.0.1:12345

source: If the language server is using TCP Type the connection string in the format of: tcp://host:port
ru_ru: Если языковой сервер использует TCP, введите строку подключения в следующем формате: tcp://host:port

source: Priority:
ru_ru: Приоритет:

source: Multiple Plugins / Servers can compete for providing code completion for a given language. Set here the server priority. The server with the highest priority will be triggered first Note that the builtin plugins are using priority in the range of 10 - 75 If you want that the LSP will be the first in the chain, set its priority to a value that is higher than 75
ru_ru: Несколько модулей или серверов могут конфликтовать друг с другом при автозавершении кода для указанного языка. Установите здесь приоритет сервера. Сервер с наивысшим приоритетом будет запускаться первым. Обратите внимание, что встроенные модули используют приоритет в диапазоне от 10 до 75. Если необходимо, чтобы модуль или сервер был первым в очереди, установите для него значение приоритета, превышающее 75

source: Display diagnostics
ru_ru: Отображать диагностику

source: Language Server Settings
ru_ru: Параметры языкового сервера

source: New Language Server
ru_ru: Создать языковой сервер

source: Outline View
ru_ru: Режим структуры

source: Support for Language Server Protocol (LSP)
ru_ru: Поддержка протокола языкового сервера (LSP)

source: Language Server
ru_ru: Языковой сервер

source: Restart Language Servers
ru_ru: Перезапустить языковые серверы

source: Find references
ru_ru: Найти ссылки

source: Rename symbol
ru_ru: Переименовать символ

source: Find symbol
ru_ru: Найти символ

source: Search for a keyboard shortcut either by its keyboard shortcut or by its description
ru_ru: Искать комбинацию клавиш либо по самой комбинации, либо по её описанию

source: Keyboard Shortcut
ru_ru: Комбинация клавиш

source: Description
ru_ru: Описание

source: &Edit...
ru_ru: &Изменить...

source: &Defaults
ru_ru: &По умолчанию

source: Keyboard Shortcuts
ru_ru: Комбинации клавиш

source: Edit
ru_ru: Правка

source: Breakpoint successfully deleted
ru_ru: Точка останова успешно удалена

source: All Breakpoints deleted
ru_ru: Все точки останова удалены

source: Pending Breakpoints reapplied
ru_ru: Ожидающие точки останова повторно применены

source: Temp.
ru_ru: Временная

source: Breakpoint
ru_ru: Точка останова

source: Watchpoint
ru_ru: Точка наблюдения

source: disabled
ru_ru: отключена

source: Edit Breakpoint...
ru_ru: Изменить точку останова...

source: Delete Breakpoint
ru_ru: Удалить точку останова

source: Edit build order for project '
ru_ru: Изменить порядок сборки для проекта '

source: You have un-saved changes, would you like to save them before changing configuration?
ru_ru: Имеются несохранённые изменения. Сохранить их перед изменением конфигурации?

source: A file with the same name already exists, continue?
ru_ru: Файл с таким именем уже существует. Продолжить?

source: total time
ru_ru: общее время

source: seconds
ru_ru: сек.

source: (Build cancelled by the user)
ru_ru: (Сборка отменена пользователем)

source: ==== build ended with
ru_ru: ==== сборка завершилась с

source: errors
ru_ru: ошибками

source: === build ended with
ru_ru: === сборка завершилась с

source: warnings
ru_ru: предупреждениями

source: === build completed
ru_ru: === сборка выполнена

source: successfully
ru_ru: успешно

source: errors,
ru_ru: ошибками,

source: warnings)
ru_ru: предупреждениями)

source: Initializing CodeLite
ru_ru: Инициализация CodeLite

source: Pattern
ru_ru: Образец

source: File name index
ru_ru: Индекс имени файла

source: Line number index
ru_ru: Индекс номера строки

source: Column index
ru_ru: Индекс столбца

source: Switch
ru_ru: Переключатель

source: Add an existing compiler
ru_ru: Добавить существующий компилятор

source: Copy compiler
ru_ru: Копировать компилятор

source: Scan for compilers
ru_ru: Найти компиляторы

source: Add compiler error pattern
ru_ru: Добавить образец ошибки компилятора

source: Add compiler warning pattern
ru_ru: Добавить образец предупреждения компилятора

source: Are you sure you want to delete this compiler option?
ru_ru: Вы уверены, что хотите удалить этот параметр компилятора?

source: Are you sure you want to delete this linker option?
ru_ru: Вы уверены, что хотите удалить этот параметр компоновщика?

source: Update compiler warning pattern
ru_ru: Обновить образец предупреждения компилятора

source: Update compiler error pattern
ru_ru: Обновить образец ошибки компилятора

source: switch:
ru_ru: переключатель:

source: Please fill all the fields
ru_ru: Заполните все поля

source: Rename...
ru_ru: Переименовать...

source: Are you sure you want to delete compiler '
ru_ru: Вы уверены, что хотите удалить компилятор '

source: Delete Compiler
ru_ru: Удалить компилятор

source: New Compiler Name
ru_ru: Имя нового компилятора

source: Rename Compiler
ru_ru: Переименовать компилятор

source: Compiler option
ru_ru: Параметр компилятора

source: Linker option
ru_ru: Параметр компоновщика

source: Select the compilers to configure:
ru_ru: Компиляторы для настройки:

source: Installation path
ru_ru: Путь установки

source: Some of the compilers referred by the workspace no longer exist. Define each missing compiler by cloning an existing compiler.
ru_ru: Некоторые компиляторы, на которые ссылается рабочее пространство, больше не существуют. Определите каждый недостающий компилятор путём клонирования существующего компилятора.

source: Compilers
ru_ru: Компиляторы

source: Find Installed Compilers
ru_ru: Найти установленные компиляторы

source: Could not find selected compiler...
ru_ru: Не удалось найти выбранный компилятор...

source: <Click to select a compiler...>
ru_ru: <Щёлкните, чтобы выбрать компилятор…>

source: ' by cloning an existing compiler
ru_ru: ' путём клонирования существующего компилятора

source: Create a new compiler named '
ru_ru: Создать новый компилятор с именем '

source: Select the workspace configuration to edit from the drop down list:
ru_ru: Выберите конфигурацию рабочего пространства для изменения из раскрывающегося списка:

source: Project
ru_ru: Проект

source: Configuration
ru_ru: Конфигурация

source: Configuration Manager
ru_ru: Диспетчер конфигураций

source: Type:
ru_ru: Тип:

source: Set the class name here For example: std::string
ru_ru: Укажите здесь имя класса. Например: std::string

source: set the class name. e.g. std::string
ru_ru: Укажите имя класса. Например, std::string

source: Expression to display for this class type
ru_ru: Выражение, которое следует отображать для этого типа класса

source: Debugger command:
ru_ru: Команда отладчика:

source: debugger command to invoke for 'expression'
ru_ru: Команда отладчика, которая будет вызываться для «выражения»

source: Debugger Type
ru_ru: Тип отладчика

source: Copy Backtrace to Clipboard
ru_ru: Копировать обратную трассировку в буфер обмена

source: Smart curly brackets
ru_ru: Автоматическое добавление фигурных скобок

source: Smart square brackets and parentheses
ru_ru: Автоматическое добавление квадратных и круглых скобок

source: Auto complete closing bracket and parentheses
ru_ru: Автоматическое добавление закрывающей квадратной скобки и круглых скобок

source: Smart quotes
ru_ru: Автоматическое добавление кавычек

source: Copying empty selection copies caret line
ru_ru: При копировании пустого выделенного фрагмента копируется текущая строка

source: Disable semicolon shift
ru_ru: Отключить сдвиг точки с запятой

source: Typing in Selection
ru_ru: Ввод при выделенном фрагменте

source: Wrap with quotes
ru_ru: Заключать в кавычки

source: Wrap with brackets
ru_ru: Заключать в скобки

source: Other
ru_ru: Другое

source: Enable zoom with mouse scroll
ru_ru: Включить изменение масштаба прокруткой колеса мыши

source: Indent line comments
ru_ru: Отступ перед комментариями строк

source: Line numbers
ru_ru: Номера строк

source: Display line numbers
ru_ru: Отображать номера строк

source: Highlight current line number
ru_ru: Подсвечивать текущий номер строки

source: Use relative line numbers
ru_ru: Использовать относительные номера строк

source: What to highlight?
ru_ru: Что следует подсветить?

source: Indentation lines
ru_ru: Строки с отступом

source: Matching braces
ru_ru: Парные фигурные скобки

source: Modified lines
ru_ru: Изменённые строки

source: Caret line
ru_ru: Текущая строка

source: Enable background colour
ru_ru: Включить цвет фона

source: Background colour
ru_ru: Цвет фона

source: Right margin indicator
ru_ru: Индикатор правого поля

source: Show right margin indicator
ru_ru: Показывать индикатор правого поля

source: Indicator column
ru_ru: Столбец индикатора

source: Debugger line
ru_ru: Строка отладки

source: Whitespace
ru_ru: Пробелы

source: Invisible
ru_ru: Невидимы

source: Visible always
ru_ru: Всегда видимы

source: Visible after indentation
ru_ru: Видимы после добавления отступа

source: Indentation visibility
ru_ru: Отображение отступа

source: EOL Style
ru_ru: Стиль конца строки

source: Line spacing
ru_ru: Межстрочный интервал

source: Select working directory:
ru_ru: Рабочий каталог:

source: Active?
ru_ru: Активный?

source: Function
ru_ru: Функция

source: Workspaces
ru_ru: Рабочие пространства

source: Open an existing workspace
ru_ru: Открыть существующее рабочее пространство

source: Create a new workspace
ru_ru: Создать новое рабочее пространство

source: Visit our GitHub project page
ru_ru: Посетите страницу нашего проекта на GitHub

source: Join the chat!
ru_ru: Присоединяйтесь к чату!

source: Local workspaces
ru_ru: Локальные рабочие пространства

source: File System
ru_ru: Файловая система

source: '%s' is already assigned to: '%s' Would you like to replace it?
ru_ru: «%s» уже присвоена: «%s». Вы хотите заменить её?

source: Check the command line options you need
ru_ru: Установите необходимые вам параметры командной строки

source: Enter other options
ru_ru: Ввести другие параметры

source: Command line
ru_ru: Командная строка

source: Build Settings
ru_ru: Настройки сборки

source: Build Panel
ru_ru: Панель сборки

source: A compiler with this name already exists
ru_ru: Компилятор с этим именем уже существует

source: Confirm
ru_ru: Подтвердить

source: Remove Compiler?
ru_ru: Удалить компилятор?

source: Clone a compiler
ru_ru: Клонировать компилятор

source: Scan computer for installed compilers
ru_ru: Проверить наличие на компьютере установленных компиляторов

source: Select the compiler folder
ru_ru: Выбрать папку компилятора

source: New compiler found!
ru_ru: Новый компилятор найден!

source: Set a name to the compiler
ru_ru: Задать имя компилятора

source: Explorer
ru_ru: Проводник

source: Debugger to use:
ru_ru: Используемый отладчик:

source: Filter:
ru_ru: Фильтр:

source: Processes:
ru_ru: Процессы:

source: &Attach
ru_ru: &Подключить

source: &Refresh
ru_ru: &Обновить

source: Attach debugger to process:
ru_ru: Подключить отладчик к процессу:

source: Select the configurations to build/clean:
ru_ru: Конфигурации для сборки/очистки:

source: &Build
ru_ru: &Сборка

source: &Clean
ru_ru: &Очистить

source: &Uncheck All
ru_ru: &Снять все отметки

source: Move Up
ru_ru: Переместить вверх

source: Move Down
ru_ru: Переместить вниз

source: Batch Build
ru_ru: Пакетная сборка

source: &Add
ru_ru: &Добавить

source: Add a new breakpoint or watchpoint
ru_ru: Добавить новую точку останова или точку наблюдения

source: &Edit
ru_ru: &Правка

source: Edit the selected item
ru_ru: Изменить выбранный элемент

source: &Delete
ru_ru: &Удалить

source: Delete the selected item
ru_ru: Удалить выбранный пункт

source: Delete &All
ru_ru: Удалить &все

source: Delete all breakpoints and watchpoints
ru_ru: Удалить все точки останова и точки наблюдения

source: Set Pending
ru_ru: Установить ожидание

source: If this button is visible, there are breakpoints that you tried to set, but that the debugger refused. This most often happens when the breakpoint is inside a library that hadn't been loaded when the debugger started. Click to offer the breakpoints to the debugger again.
ru_ru: Если эта кнопка видна, значит, есть точки останова, которые вы пытались установить, но отладчик отказал в установке. Чаще всего это происходит, когда точка останова находится в библиотеке, которая не была загружена при запуске отладчика. Нажмите, чтобы снова предложить точки останова отладчику.

source: Select the type of the breakpoint:
ru_ru: Тип точки останова:
