Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Inactive Caption Text Colour
ru_ru: Цвет текста заголовка неактивного окна

source: Gradient Type
ru_ru: Тип градиента

source: Bitmap Mask
ru_ru: Маска значка

source: Base Class Suffix
ru_ru: Суффикс базового класса

source: Interval
ru_ru: Интервал

source: One Shot Timer
ru_ru: Разовый таймер

source: Output File Name
ru_ru: Имя выходного файла

source: Inherited Class
ru_ru: Унаследованный класс

source: Keywords Set 1
ru_ru: Набор ключевых слов 1

source: Keywords Set 2
ru_ru: Набор ключевых слов 2

source: Keywords Set 3
ru_ru: Набор ключевых слов 3

source: Keywords Set 4
ru_ru: Набор ключевых слов 4

source: Keywords Set 5
ru_ru: Набор ключевых слов 5

source: Ribbon Theme
ru_ru: Тема панели ленты

source: Minimum #Rows
ru_ru: Минимальное количество строк

source: Maximum #Rows
ru_ru: Максимальное количество строк

source: Backend
ru_ru: Серверная часть

source: wxMediaCtrl Controls
ru_ru: Элементы управления wxMediaCtrl

source: wxFrame Type
ru_ru: Тип wxFrame

source: Show Effect
ru_ru: Показать эффект

source: Property Editor Control
ru_ru: Элемент управления редактора свойств

source: Construct the Dropdown Menu:
ru_ru: Создать раскрывающееся меню:

source: Text Hint
ru_ru: Текстовая подсказка

source: Load and play
ru_ru: Загрузить и воспроизвести

source: Proportion:
ru_ru: Пропорция:

source: Enable Spell Checking
ru_ru: Включить проверку орфографии

source: Keep as a class member
ru_ru: Сохранить как член класса

source: Invalid XRC! could not save DesignerPreview.xrc
ru_ru: Недопустимый XRC! Не удалось сохранить DesignerPreview.xrc

source: Show Preview
ru_ru: Предварительный просмотр

source: Show Preview...
ru_ru: Предварительный просмотр…

source: Close Preview
ru_ru: Закрыть предварительный просмотр

source: Close Preview...
ru_ru: Закрыть предварительный просмотр…

source: Delete Item
ru_ru: Удалить элемент

source: Align Left
ru_ru: Выровнять по левому краю

source: Align Center
ru_ru: Выровнять по центру

source: Align Center Horizontally
ru_ru: Выровнять по центру по горизонтали

source: Align Right
ru_ru: Выровнять по правому краю

source: Align Top
ru_ru: Выровнять по верхнему краю

source: Align Middle
ru_ru: Выровнять по середине

source: Align Center Vertically
ru_ru: Выровнять по центру по вертикали

source: Align Bottom
ru_ru: Выровнять по нижнему краю

source: All Borders
ru_ru: Все границы

source: Left Border
ru_ru: Левая граница

source: Top Border
ru_ru: Верхняя граница

source: Right Border
ru_ru: Правая граница

source: Bottom Border
ru_ru: Нижняя граница

source: Set Sizer Proportion to 1
ru_ru: Установить для пропорции сайзера значение 1

source: Expand Item
ru_ru: Развернуть элемент

source: Move Left
ru_ru: Переместить влево

source: Move Left into parent sizer
ru_ru: Переместить влево в родительский сайзер

source: Move Right
ru_ru: Переместить вправо

source: Move Right into a sibling sizer
ru_ru: Переместить вправо в сайзер того же уровня

source: Error occurred while opening file '
ru_ru: Произошла ошибка при открытии файла '

source: ' for writing
ru_ru: ' для записи

source: Current file has been modified Continue?
ru_ru: Текущий файл был изменён. Продолжить?

source: Open wxCrafter project
ru_ru: Открыть проект wxCrafter

source: Can't paste it here
ru_ru: Не удалось выполнить вставку сюда

source: This name is already in use. Try again?
ru_ru: Это имя уже используется. Повторить попытку?

source: Only one wxAui Manager is allowed
ru_ru: Допускается только один диспетчер wxAui

source: Can't insert this item here There is already a main sizer
ru_ru: Не удалось вставить этот элемент сюда. Главный сайзер уже существует

source: Can't insert this item here This item is managed by wxAUI
ru_ru: Не удалось вставить этот элемент сюда. Этот элемент управляется wxAUI

source: Current file has been modified Close anyway?
ru_ru: Текущий файл был изменён. Всё равно закрыть?

source: Generate C++ code
ru_ru: Создать код С++

source: Generate XRC
ru_ru: Создать XRC

source: Choose a control
ru_ru: Выбрать элемент управления

source: wxAui Manager can not be placed onto a control with a main sizer
ru_ru: Диспетчер wxAui не может быть помещён на элемент управления с главным сайзером

source: wxRibbonPanel can only have one direct child
ru_ru: wxRibbonPanel может иметь только один прямой дочерний элемент

source: A Main Sizer can not be placed into a wxAui managed window
ru_ru: Главный сайзер не может быть помещён в окно, управляемое wxAui

source: Can't insert this item here
ru_ru: Не удалось вставить этот элемент сюда

source: Rename '
ru_ru: Переименовать '

source: Enter the new name:
ru_ru: Введите новое имя:

source: You need to enable at least one of 'Generate C++ code' and 'Generate XRC'
ru_ru: Необходимо включить как минимум одну из следующих опций: «Создать код С++» и «Создать XRC»

source: Please set the base classes generated files output directory This can be done by selecting the root item of the tree and edit the properties
ru_ru: Укажите выходной каталог создаваемых файлов базовых классов. Это можно сделать, выбрав корневой элемент дерева и изменив свойства

source: You must save the project before generating code
ru_ru: Необходимо сохранить проект перед созданием кода

source: Select wxCrafter files:
ru_ru: Файлы wxCrafter:

source: Please close the current wxCrafter project before batch generating code
ru_ru: Закройте текущий проект wxCrafter перед пакетным созданием кода

source: Generating Code...
ru_ru: Создание кода...

source: Generated Code For the following projects:
ru_ru: Создаваемый код для следующих проектов:

source: codelite's virtual folder for the generated files
ru_ru: Виртуальная папка CodeLite для создаваемых файлов

source: A wxInitDialogEvent is sent as a dialog or panel is being initialised. Handlers for this event can transfer data to the window. The default handler calls wxWindow::TransferDataToWindow
ru_ru: wxInitDialogEvent отправляется при инициализации диалогового окна или панели. Обработчики этого события могут выполнять передачу данных окну. Обработчик по умолчанию вызывает wxWindow::TransferDataToWindow

source: Process a close event. This event applies to wxFrame and wxDialog classes
ru_ru: Обрабатывать событие закрытия. Это событие применяется к классам wxFrame и wxDialog

source: Process a wxEVT_ACTIVATE event
ru_ru: Обрабатывать событие wxEVT_ACTIVATE

source: Process a wxEVT_ACTIVATE_APP event
ru_ru: Обрабатывать событие wxEVT_ACTIVATE_APP

source: Dialog Icons
ru_ru: Значки диалогового окна

source: Select a 16x16 bitmap
ru_ru: Выбрать значок 16x16

source: Select a 32x32 bitmap
ru_ru: Выбрать значок 32x32

source: Select a 64x64 bitmap
ru_ru: Выбрать значок 64x64

source: Select a 128x128 bitmap
ru_ru: Выбрать значок 128x128

source: Select a 256x256 bitmap
ru_ru: Выбрать значок 256x256

source: Frame Type
ru_ru: Тип фрейма

source: Select the wxFrame type you want
ru_ru: Выбрать необходимый тип wxFrame

source: Frame Icons
ru_ru: Значки фрейма

source: The filenames for the generated files
ru_ru: Имена для создаваемых файлов

source: The bitmaps size
ru_ru: Размер значков

source: True if masks should be created for all images
ru_ru: Значение true, если маски должны быть созданы для всех изображений

source: My Wizard
ru_ru: Мой мастер

source: The default bitmap used in the left side of the wizard.
ru_ru: Значок по умолчанию, используемый в левой части мастера.

source: The page has just been changed (this event cannot be vetoed)
ru_ru: Страница только что была изменена (это событие невозможно запретить).

source: The page is being changed (this event can be vetoed).
ru_ru: Выполняется изменение страницы (это событие можно запретить).

source: The page was shown and laid out.
ru_ru: Выполнено отображение и компоновка страницы.

source: The user attempted to cancel the wizard (this event may also be vetoed).
ru_ru: Пользователь попытался отменить работу мастера (это событие также можно запретить).

source: The wizard help button was pressed.
ru_ru: Была нажата кнопка справки мастера.

source: The wizard finished button was pressed.
ru_ru: Была нажата кнопка завершения работы мастера.

source: Wizard Icons
ru_ru: Значки мастера

source: ==> Breakpoints:
ru_ru: ==> Точки останова:

source: Lost connection to dap server
ru_ru: Соединение с сервером DAP разорвано

source: Launch
ru_ru: Запустить

source: Attach
ru_ru: Присоединить

source: Set Breakpoint...
ru_ru: Установить точку останова...

source: Debug File Name
ru_ru: Имя файла отладки

source: Stack
ru_ru: Стек

source: Scope Variables
ru_ru: Переменные области видимости

source: DAP UI
ru_ru: Пользовательский интерфейс DAP

source: wxFormBuilder path:
ru_ru: Путь к wxFormBuilder:

source: wxFormBuilder Settings...
ru_ru: Параметры wxFormBuilder...

source: Select wxFormBuilder exe:
ru_ru: Выбрать wxFormBuilder exe:

source: Invalid C++ class name
ru_ru: Недопустимое имя класса C++

source: wxFormBuilder integration with CodeLite
ru_ru: Интеграция wxFormBuilder с CodeLite

source: New wxDialog...
ru_ru: Создать wxDialog...

source: New wxDialog with Default Buttons...
ru_ru: Создать wxDialog с кнопками по умолчанию...

source: New wxFrame...
ru_ru: Создать wxFrame...

source: New wxPanel...
ru_ru: Создать wxPanel...

source: Can't find wxFormBuilder template file '%s'
ru_ru: Не удалось найти файл шаблона wxFormBuilder «%s»

source: Please select a 'fbp' (Form Builder Project) file only
ru_ru: Выберите только файл «fbp» (Form Builder Project)

source: New wxDialog with Default Buttons
ru_ru: Создать wxDialog с кнопками по умолчанию

source: Open with wxFormBuilder...
ru_ru: Открыть с помощью wxFormBuilder...
