Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Enable Auto Save
ru_ru: Включить автосохранение

source: Save interval:
ru_ru: Сохранить интервал:

source: Check and save modified files interval (in seconds)
ru_ru: Интервал проверки наличия и сохранения изменённых файлов (в секундах)

source: Auto Save Settings
ru_ru: Параметры автосохранения

source: Automatically save modified source files
ru_ru: Автоматически сохранять изменённые исходные файлы

source: Settings...
ru_ru: Параметры...

source: Auto Save
ru_ru: Модуль автосохранения

source: exists. Would you like to overwrite it?
ru_ru: существует. Вы хотите перезаписать его?

source: A custom
ru_ru: Пользовательский

source: Don't Overwrite
ru_ru: Не перезаписывать

source: Overwrite
ru_ru: Перезаписать

source: Remember my answer and don't annoy me again
ru_ru: Запомнить ответ и не показывать это сообщение снова

source: CMake application path is invalid!
ru_ru: Недопустимый путь к приложению CMake!

source: CMake Help
ru_ru: Справка CMake

source: CMake integration for CodeLite
ru_ru: Интеграция CMake для CodeLite

source: CMake integration with CodeLite
ru_ru: Интеграция CMake с CodeLite

source: Open CMakeLists.txt
ru_ru: Открыть CMakeLists.txt

source: Run CMake
ru_ru: Выполнить CMake

source: Export CMakeLists.txt
ru_ru: Экспорт CMakeLists.txt

source: Failed to execute:
ru_ru: Не удалось выполнить:

source: Build
ru_ru: Сборка

source: CMake program:
ru_ru: Программа CMake:

source: Select a file
ru_ru: Выбрать файл

source: Path to cmake executable.
ru_ru: Путь к исполняемому файлу cmake.

source: Default Generator:
ru_ru: Генератор по умолчанию:

source: You can specify default generator for all projects (if is not overridden by project settings). If generator is not selected the CMake uses platform's default.
ru_ru: Вы можете установить генератор по умолчанию для всех проектов (если он не переопределён настройками проекта). Если генератор не выбран, CMake использует стандартный генератор платформы.

source: Version:
ru_ru: Версия:

source: Select Topic:
ru_ru: Выбрать тему:

source: Reload
ru_ru: Перезагрузить

source: Reloads Help from CMake
ru_ru: Перезагрузить справку из CMake

source: Double click to insert in the current editor.
ru_ru: Дважды щёлкните, чтобы вставить в текущий редактор.

source: CMakePlugin Settings
ru_ru: Параметры CMakePlugin

source: Create application call graph from profiling information provided by gprof tool.
ru_ru: Создайте граф вызовов приложения на основе данных профилирования, предоставленных инструментом gprof.

source: Show call graph
ru_ru: Показать граф вызовов

source: Show call graph for selected/active project
ru_ru: Показать граф вызовов для выбранного/активного проекта

source: About...
ru_ru: О модуле...

source: Call Graph
ru_ru: Граф вызовов

source: Show call graph for selected project
ru_ru: Показать граф вызовов для выбранного проекта

source: Create application call graph from profiling information provided by gprof tool.
ru_ru: Создайте граф вызовов приложения на основе данных профилирования, предоставленных инструментом gprof.

source: v1.1.1
ru_ru: Версия 1.1.1

source: 2012 - 2015 (C) Tomas Bata University, Zlin, Czech Republic
ru_ru: © Университет Томаша Бати, Злин, Чешская Республика, 2012—2015

source: Unable to get opened workspace.
ru_ru: Не удалось получить открытое рабочее пространство.

source: Unable to get current build matrix.
ru_ru: Не удалось получить текущую матрицу сборки.

source: Please select the binary to analyze
ru_ru: Выберите двоичный файл для анализа

source: selected binary was canceled
ru_ru: выбор двоичного файла был отменён

source: bin/exe isn't executable
ru_ru: bin/exe не является исполняемым файлом

source: Please select the gprof file
ru_ru: Выберите файл gprof

source: selected gprof was canceled
ru_ru: выбор gprof был отменён

source: wxProcess::GetInputStream() can't be opened, aborting
ru_ru: Не удалось открыть wxProcess::GetInputStream(), прерывание

source: The CallGraph plugin has suggested node threshold %d to speed-up the call graph creation. You can alter it on the call graph panel.
ru_ru: Модуль графа вызовов предложил порог узла %d для ускорения создания графа вызовов. Вы можете изменить его на панели графа вызовов.

source: Failed to open file CallGraph.png. Please check the project settings, rebuild the project and try again.
ru_ru: Не удалось открыть файл CallGraph.png. Проверьте параметры проекта, восстановите проект и попробуйте ещё раз.

source: "The call-graph is empty; the node threshold ceiling is %d !"
ru_ru: «Граф вызовов пуст; пороговое значение узла равно %d!»

source: Node threshold [%] :
ru_ru: Порог узла [%]:

source: Edge threshold [%] :
ru_ru: Порог ребра [%]:

source: Hide parameters
ru_ru: Скрыть параметры

source: Hide namespaces
ru_ru: Скрыть пространства имён

source: Refresh
ru_ru: Обновить

source: Save call graph to...
ru_ru: Сохранить граф вызовов в...

source: Close call graph
ru_ru: Закрыть граф вызовов

source: Zoom in
ru_ru: Увеличить

source: Zoom out
ru_ru: Уменьшить

source: Zoom 100%
ru_ru: Масштаб 100%

source: Zoom 1:1
ru_ru: Масштаб 1:1

source: Function name
ru_ru: Имя функции

source: Total time [%]
ru_ru: Общее время [%]

source: Self time [s]
ru_ru: Время в теле функции [с]

source: Called
ru_ru: Вызовов

source: Save call graph...
ru_ru: Сохранить граф вызовов...

source: CallGraph failed to save file with DOT language, please build the project again.
ru_ru: Модулю графа вызовов не удалось сохранить файл с языком DOT, выполните сборку проекта ещё раз.

source: Select path for Gprof:
ru_ru: Выберите путь для Gprof:

source: Select...
ru_ru: Выбрать...

source: Select path for Dot:
ru_ru: Выберите путь для Dot:

source: Settings for CALL graph
ru_ru: Параметры графа вызовов

source: Resolutions:
ru_ru: Разрешения:

source: Node threshold (0 - 100) [%]:
ru_ru: Порог узла (0—100) [%]:

source: Edge threshold (0 - 100) [%]:
ru_ru: Порог ребра (0—100) [%]:

source: Options:
ru_ru: Параметры:

source: Number of node load level colors (max 10):
ru_ru: Цвета для номеров уровня загрузки узлов (макс. 10):

source: Strip parameters
ru_ru: Параметры полосы

source: Number of edge load level colors (max 10):
ru_ru: Цвета для номеров уровня загрузки рёбер (макс. 10):

source: &Ok
ru_ru: &ОК

source: &Cancel
ru_ru: &Отмена

source: Select gprof...
ru_ru: Выбрать gprof...

source: Select dot...
ru_ru: Выбрать dot...

source: Please check the external tools' paths settings.
ru_ru: Проверьте параметры путей к внешним инструментам.

source: CodeDesigner RAD integration with CodeLite
ru_ru: Интеграция CodeDesigner RAD с CodeLite

source: Open with CodeDesigner...
ru_ru: Открыть с помощью CodeDesigner...

source: New simple state chart...
ru_ru: Создать простую диаграмму состояний...

source: New hierarchical state chart...
ru_ru: Создать иерархическую диаграмму состояний...

source: New class diagram...
ru_ru: Создать диаграмму классов...

source: Please select a 'cdp' (CodeDesigner Project) file only
ru_ru: Выберите только файл «cdp» (CodeDesigner Project)

source: Failed to launch CodeDesigner, no path specified Please set CodeDesigner path from Plugins -> CodeDesigner -> Settings...
ru_ru: Не удалось запустить CodeDesigner, не указан путь Установите путь к CodeDesigner с помощью меню Модули -> CodeDesigner -> Параметры...

source: New Class Diagram
ru_ru: Создать диаграмму классов

source: New Hierarchical State Chart
ru_ru: Создать иерархическую диаграмму состояний

source: New Simple State Chart
ru_ru: Создать простую диаграмму состояний

source: Can't find CodeDesigner template file '%s'
ru_ru: Не удалось найти файл шаблона CodeDesigner «%s»

source: Failed to copy template file to '%s'
ru_ru: Не удалось скопировать файл шаблона в «%s»

source: Failed to read file '%s'
ru_ru: Не удалось прочитать файл «%s»

source: Failed to write file '%s'
ru_ru: Не удалось записать файл «%s»

source: Insert generated files into...
ru_ru: Вставить сгенерированные файлы в...

source: Select CodeDesigner executable:
ru_ru: Исполняемый файл CodeDesigner:

source: CodeDesigner project settings:
ru_ru: Параметры проекта CodeDesigner:

source: Package name:
ru_ru: Имя пакета:

source: Diagram name:
ru_ru: Имя диаграммы:

source: Language:
ru_ru: Язык:

source: Application entry point
ru_ru: Точка входа приложения

source: Generate source code
ru_ru: Генерировать исходный код

source: CodeLite settings:
ru_ru: Параметры CodeLite:

source: Project tree folder:
ru_ru: Папка дерева проекта:

source: OK
ru_ru: ОК

source: Cancel
ru_ru: Отмена

source: New CodeDesigner project
ru_ru: Создать проект CodeDesigner

source: Diagram name cannot be empty
ru_ru: Имя диаграммы не может быть пустым

source: Package name cannot be empty
ru_ru: Имя пакета не может быть пустым

source: Folder name cannot be empty
ru_ru: Имя папки не может быть пустым

source: CodeDesigner path:
ru_ru: Путь к CodeDesigner:

source: Communication port:
ru_ru: Порт связи:

source: CodeDesigner RAD Settings...
ru_ru: Параметры CodeDesigner RAD...

source: Enabled
ru_ru: Включено

source: Format on save?
ru_ru: Форматировать при сохранении?

source: Inplace edit
ru_ru: Редактирование по месту

source: Working directory
ru_ru: Рабочий каталог

source: Supported languages
ru_ru: Поддерживаемые языки

source: Command
ru_ru: Команда

source: format error. Process exit code:
ru_ru: ошибка формата. Код завершения процесса:

source: Source Code Formatter (Supports C/C++/Obj-C/JavaScript/PHP files)
ru_ru: Модуль форматирования исходного кода (поддерживает файлы C/C++/Obj-C/JavaScript/PHP)

source: Source Code Formatter
ru_ru: Модуль форматирования исходного кода

source: Format Current Source
ru_ru: Отформатировать текущий источник

source: Options...
ru_ru: Параметры...

source: Format Source
ru_ru: Отформатировать источник

source: Format Source Code
ru_ru: Отформатировать исходный код

source: Format Options
ru_ru: Параметры форматирования

source: Source Code Formatter Options...
ru_ru: Параметры модуля форматирования исходного кода...

source: Code Formatter: scanning for files...
ru_ru: Модуль форматирования кода: поиск файлов…

source: Project contains no supported files
ru_ru: Проект не содержит поддерживаемых файлов

source: files Continue?
ru_ru: Продолжить?

source: You are about to beautify
ru_ru: Вы собираетесь отформатировать файлов:

source: Successfully formatted
ru_ru: Успешно отформатировано файлов:

source: Done
ru_ru: Готово

source: Lose all your modifications and restore default settings?
ru_ru: Не сохранять изменения и восстановить параметры по умолчанию?

source: name
ru_ru: Имя

source: Defaults
ru_ru: Параметры по умолчанию

source: Revert all changes and load factory defaults
ru_ru: Отменить все изменения и загрузить параметры по умолчанию

source: Source Code Formatter Options
ru_ru: Параметры модуля форматирования исходного кода

source: The uncompromising python code formatter
ru_ru: Высокопроизводительный модуль форматирования кода Python

source: black - a python formatter
ru_ru: black — модуль форматирования Python

source: Parse cmake listfiles and format them nicely
ru_ru: Анализ файлов списков CMake и их правильное форматирование

source: cmake-format - a CMake formatter
ru_ru: cmake-format — модуль форматирования CMake

source: A tool to format C/C++/Java/JavaScript/JSON/Objective-C/Protobuf/C# code
ru_ru: Инструмент для форматирования кода C/C++/Java/JavaScript/JSON/Objective-C/Protobuf/C#

source: clang-format - a C/C++ formatter
ru_ru: clang-format — модуль форматирования C/C++

source: commandline JSON processor
ru_ru: Процессор JSON командной строки

source: jq - a json formatter
ru_ru: jq — модуль форматирования JSON

source: PHP Code Beautifier and Fixer
ru_ru: Средство форматирования и исправления кода PHP

source: PHP formatter
ru_ru: Модуль форматирования PHP

source: The PHP Coding Standards Fixer
ru_ru: Средство исправления стандартов кодирования PHP

source: Format Rust code
ru_ru: Форматирование кода Rust

source: Rust formatter
ru_ru: Модуль форматирования Rust

source: xmllint - command line XML tool
ru_ru: xmllint — инструмент для работы с XML командной строки

source: Xml formatter
ru_ru: Модуль форматирования XML

source: commandline YAML processor
ru_ru: Процессор YAML командной строки

source: Yaml formatter
ru_ru: Модуль форматирования YAML

source: PHP: parsed
ru_ru: PHP: проанализирован

source: Send command to the process
ru_ru: Отправить команду процессу

source: Terminal
ru_ru: Терминал

source: Failed to start child process
ru_ru: Не удалось запустить дочерний процесс

source: Executing:
ru_ru: Выполнение:

source: Failed to execute command: %s
ru_ru: Не удалось выполнить команду: %s

source: Can't open file:
ru_ru: Не удалось открыть файл:

source: Can't write data to file:
ru_ru: Не удалось записать данные в файл:

source: Failed to unlink file:
ru_ru: Не удалось удалить связь файла:

source: Failed to rename file:
ru_ru: Не удалось переименовать файл:

source: Failed to list directory:
ru_ru: Не удалось показать содержимое каталога:

source: Failed to open remote file:
ru_ru: Не удалось открыть удалённый файл:

source: Could not stat file:
ru_ru: Не удалось получить данные о файле:

source: Could not read file:
ru_ru: Не удалось прочитать файл:

source: SFTP: failed to create directory:
ru_ru: SFTP: не удалось создать каталог:

source: Failed to rename path.
ru_ru: Не удалось переименовать путь.

source: Failed to remove directory:
ru_ru: Не удалось удалить каталог:

source: Failed to unlink path:
ru_ru: Не удалось удалить путь:

source: Could not stat:
ru_ru: Не удалось получить данные:

source: Failed to read symlink target.
ru_ru: Не удалось прочитать цель символической ссылки.

source: Failed to chmod file:
ru_ru: Не удалось изменить права доступа к файлу:

source: Accept server authentication?
ru_ru: Принять аутентификацию сервера?

source: Host key for server changed: it is now:
ru_ru: Ключ хоста для сервера изменился: теперь это:

source: The host key for this server was not found but another type of key exists.
ru_ru: Ключ хоста для этого сервера не был найден, но существует другой тип ключа.

source: An attacker might change the default server key to confuse your client into thinking the key does not exist
ru_ru: Злоумышленник может изменить ключ сервера по умолчанию, чтобы ввести клиент в заблуждение и заставить его думать, что ключа не существует

source: Could not find known host file.
ru_ru: Не удалось найти известный файл хоста.

source: If you accept the host key here, the file will be automatically created.
ru_ru: Если вы примете здесь ключ хоста, то файл будет создан автоматически.

source: Public key hash:
ru_ru: Хэш открытого ключа:

source: The server is unknown. Do you trust the host key?
ru_ru: Сервер неизвестен. Вы доверяете ключу узла?

source: ssh_userauth_none failed
ru_ru: Ошибка ssh_userauth_none

source: Login failed: invalid username/password
ru_ru: Ошибка входа: неверное имя пользователя или пароль

source: Authentication error:
ru_ru: Ошибка аутентификации:

source: Interactive Keyboard is not enabled for this server
ru_ru: Интерактивная клавиатура не включена для этого сервера

source: Public Key error:
ru_ru: Ошибка открытого ключа:

source: <New...>
ru_ru: <Создать...>

source: <Edit...>
ru_ru: <Изменить...>

source: ----------Build Started--------
ru_ru: ----------Сборка начата--------

source: ----------Build Ended----------
ru_ru: ----------Сборка завершена----------

source: ----------Building project:[
ru_ru: ----------Сборка проекта:[

source: ----------Cleaning project:[
ru_ru: ----------Очистка проекта:[

source: <Entire Workspace>
ru_ru: <Всё рабочее пространство>

source: <Active Project>
ru_ru: <Активный проект>

source: <Current File's Project>
ru_ru: <Проект текущего файла>

source: <Current File>
ru_ru: <Текущий файл>

source: <Open Files>
ru_ru: <Открытые файлы>

source: <Workspace Folder>
ru_ru: <Папка рабочего пространства>

source: <Use Defaults>
ru_ru: <Использовать по умолчанию>

source: Number of files scanned:
ru_ru: Число проверенных файлов:

source: Matches found:
ru_ru: Найдено соответствий:

source: seconds
ru_ru: сек.

source: , elapsed time:
ru_ru: , прошло времени:

source: Failed to open the following files for scan:
ru_ru: Не удалось открыть следующие файлы для проверки:

source: Left File:
ru_ru: Левый файл:

source: Right File:
ru_ru: Правый файл:

source: Choose a file...
ru_ru: Выбрать файл...

source: Opened files:
ru_ru: Открытые файлы:

source: Select File for Comparison
ru_ru: Выберите файл для сравнения

source: Select file:
ru_ru: Выбрать файл:

source: Untitled
ru_ru: Безымянный

source: CodeLite Diff Plugin
ru_ru: Модуль сравнения CodeLite

source: Diff Tool
ru_ru: Модуль сравнения

source: New File Comparison
ru_ru: Новое сравнение файлов

source: New Folder Comparison
ru_ru: Новое сравнение папок

source: Start new diff
ru_ru: Запустите новое сравнение

source: Start new folders diff
ru_ru: Запустить новое сравнение папок

source: Compare with...
ru_ru: Сравнить с...

source: Enable continuous build
ru_ru: Включить непрерывную сборку

source: &Clear All
ru_ru: &Очистить всё

source: Failed Files:
ru_ru: Файлы с ошибками:

source: Continuous build plugin which compiles files on save and report errors
ru_ru: Модуль непрерывной сборки, который компилирует файлы после их сохранения и сообщает об ошибках

source: Compiling
ru_ru: Компиляция

source: Copyright Plugin - a small plugin that allows you to place copyright block on top of your source files
ru_ru: Модуль авторского права — небольшой модуль, который позволяет вам помещать блок со сведениями об авторских правах в свои исходные файлы

source: Copyright Plugin - Place copyright block on top of your source files
ru_ru: Модуль авторского права — поместите блок со сведениями об авторских правах в свои исходные файлы

source: Copyright
ru_ru: Авторские права

source: Insert Copyright Block
ru_ru: Вставить блок со сведениями об авторских правах

source: Batch Insert of Copyright Block
ru_ru: Пакетная вставка блока со сведениями об авторских правах

source: Copyrights
ru_ru: Авторские права

source: Template file name '%s', does not exist!
ru_ru: Имя файла шаблона «%s» не существует!

source: Failed to read template file '%s'
ru_ru: Не удалось прочитать файл шаблона «%s»

source: There is no active editor
ru_ru: Нет активного редактора

source: Template file contains text which is not comment, continue anyway?
ru_ru: Файл шаблона содержит текст, который не является комментарием. Всё равно продолжить?

source: File contains ignore string, skipping it
ru_ru: Файл содержит игнорируемую строку, поэтому будет пропущен

source: Batch insert requires a workspace to be opened
ru_ru: Пакетная вставка требует, чтобы было открыто рабочее пространство

source: You are about to modify %u files. Continue?
ru_ru: Файлы (%u) будут изменены. Продолжить?

source: Processing file ...
ru_ru: Обработка файла...

source: File contains ignore string, skipping it:
ru_ru: Файл содержит игнорируемую строку, поэтому будет пропущен:

source: Inserting comment to file:
ru_ru: Вставка комментария в файл:

source: Template file contains text which is not comment, continue anyways?
ru_ru: Файл шаблона содержит текст, который не является комментарием. Всё равно продолжить?

source: Insert Copyrights Block
ru_ru: Вставить блок со сведениями об авторских правах

source: Template File Path:
ru_ru: Путь к файлу шаблона:

source: Select the path to the file containing the template header to be prepended to the source files
ru_ru: Выберите путь к файлу, содержащему заголовок шаблона, который будет добавлен к исходным файлам

source: File Masking:
ru_ru: Маскирование файла:

source: Ignore String:
ru_ru: Игнорировать строку:

source: Set here a string that once found in the source file CodeLite will not prepend the Copyrights block to the file
ru_ru: Укажите здесь строку, после нахождения которой в исходном файле CodeLite не будет добавлять блок сведений об авторских правах в файл

source: Backup modified files
ru_ru: Резервное копирование изменённых файлов

source: &Save
ru_ru: &Сохранить

source: Copyrights Settings
ru_ru: Параметры сведений об авторских правах

source: Choose a file:
ru_ru: Файл:

source: Select projects to insert copyrights block:
ru_ru: Выберите проекты для вставки блока сведений об авторских правах:

source: Check &All
ru_ru: Отметить &все

source: &Un-Check All
ru_ru: &Cнять флажок со всех

source: &Insert
ru_ru: &Вставить

source: Batch Insert Of Copyrights
ru_ru: Пакетная вставка авторских прав

source: Virtual name cannot be empty
ru_ru: Виртуальное имя не может быть пустым

source: ......... Generated successfully!
ru_ru: ......... Сгенерирован успешно!

source: ......... Error!!!
ru_ru: ......... Ошибка!!!

source: Table %s has no primary key defined!
ru_ru: Для таблицы %s не определён первичный ключ!

source: File name
ru_ru: Имя файла

source: Error (%d): %s
ru_ru: Ошибка (%d): %s

source: DB Error
ru_ru: Ошибка базы данных

source: Unknown error.
ru_ru: Неизвестная ошибка.

source: MySQL connection is not supported.
ru_ru: Соединение MySQL не поддерживается.

source: PostgreSQL connection is not supported.
ru_ru: Соединение PostgreSQL не поддерживается.

source: SQLite connection is not supported.
ru_ru: Соединение SQLite не поддерживается.

source: Open connection
ru_ru: Открыть соединение

source: Close selected connection
ru_ru: Закрыть выбранное соединение

source: Refresh View
ru_ru: Обновить представление

source: Databases
ru_ru: Базы данных

source: Databases (%s)
ru_ru: Базы данных (%s)

source: Tables
ru_ru: Таблицы

source: Views
ru_ru: Представления

source: Close
ru_ru: Закрыть

source: Close connection?
ru_ru: Закрыть соединение?

source: Add database
ru_ru: Добавить базу данных

source: Database name
ru_ru: Имя базы данных

source: Database created successfully
ru_ru: База данных создана успешно

source: Can't create new db in this database engine!
ru_ru: Не удалось создать новую базу данных в этом ядре СУБД!

source: Error
ru_ru: Ошибка

source: Remove database '%s'?
ru_ru: Удалить базу данных «%s»?

source: Drop database
ru_ru: Сбросить базу данных

source: Database dropped successfully
ru_ru: База данных успешно сброшена

source: Remove table '%s'?
ru_ru: Удалить таблицу «%s»?

source: Drop table
ru_ru: Сбросить таблицу

source: Table dropped successfully
ru_ru: Таблица успешно сброшена

source: Remove view '%s'?
ru_ru: Удалить представление «%s»?

source: Drop view
ru_ru: Сбросить представление

source: View dropped successfully
ru_ru: Представление успешно сброшено

source: Import database from SQL file ...
ru_ru: Импорт базы данных из файла SQL...

source: Dump data into file ...
ru_ru: Выгрузить данные в файл...

source: Data was saved to
ru_ru: Данные были сохранены в

source: Export database...
ru_ru: Экспорт базы данных...

source: The database has been exported to '%s'.
ru_ru: База данных была экспортирована в «%s».

source: Successful!
ru_ru: Успешно!

source: Fail!
ru_ru: Сбой!

source: Close Connection
ru_ru: Закрыть соединение

source: Refresh Connection
ru_ru: Обновить соединение

source: Open SQL panel
ru_ru: Открыть панель SQL

source: Open SQL command panel for the database
ru_ru: Открыть панель команды SQL для базы данных

source: Run SQL command for deleting Database
ru_ru: Выполнить команду SQL для удаления базы данных

source: Create classes from DB
ru_ru: Создать классы из базы данных

source: Create C++ classes for the database
ru_ru: Создать классы C++ для базы данных

source: Import database from file
ru_ru: Импорт базы данных из файла

source: Run SQL commands stored in *.sql file
ru_ru: Выполнить команды SQL, хранящиеся в файле *.sql

source: Export database to file
ru_ru: Экспорт базы данных в файл

source: Export database CREATE SQL statements into *.sql file
ru_ru: Экспорт SQL-инструкций CREATE базы данных в файл *.sql
