Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Sets the colour used to print the label when the mouse is not over the control and the link has already been clicked before (i.e. the link has been visited)
ru_ru: Устанавливает цвет, используемый для отображении метки, если указатель мыши не наведён на элемент управления и щелчок по ссылке уже выполнялся раньше (т.е. выполнялся переход по ссылке).

source: Sets the colour used to print the label of the hyperlink when the mouse is over the control
ru_ru: Устанавливает цвет, используемый для отображения метки гиперссылки, если указатель мыши наведён на элемент управления.

source: My Label
ru_ru: Моя метка

source: The label of the button. It may only be empty if the button ID is one of the stock ids in which case the corresponding stock label (see wxGetStockLabel()) will be used
ru_ru: Метка кнопки. Она может быть пустой только тогда, когда идентификатор кнопки является одним из стандартных идентификаторов; в этом случае будет использоваться соответствующая стандартная метка (смотрите wxGetStockLabel())

source: Process a wxEVT_COMMAND_LISTBOX_SELECTED event, when an item on the list is selected or the selection changes.
ru_ru: Обрабатывать событие wxEVT_COMMAND_LISTBOX_SELECTED при выборе элемента списка или изменении выбора.

source: Process a wxEVT_COMMAND_LISTBOX_DOUBLECLICKED event, when the listbox is double-clicked.
ru_ru: Обрабатывать событие wxEVT_COMMAND_LISTBOX_DOUBLECLICKED при двойном щелчке по списку.

source: wxListCtrl Column
ru_ru: Столбец wxListCtrl

source: Column caption
ru_ru: Заголовок столбца

source: Column Width Set it to -1 for auto sizing. Or set it to -2 to fit the column width to heading or to extend to fill all the remaining space for the last column Value > 0 will set the width in pixels
ru_ru: Ширина столбца Задайте -1 для автоподбора. Или задайте -2 для подгонки ширины столбца под заголовок или для расширения, чтобы заполнить всё оставшееся пространство для последнегостолбца Значение > 0 установит ширину в пикселях

source: The item has been selected
ru_ru: Элемент был выбран

source: The item has been deselected
ru_ru: Выбор элемента отменён

source: The right mouse button has been clicked on an item
ru_ru: Выполнен щелчок правой кнопкой мыши по элементу

source: The middle mouse button has been clicked on an item
ru_ru: Выполнен щелчок средней кнопкой мыши по элементу

source: The item has been activated (ENTER or double click)
ru_ru: Элемент был активирован (клавишей «Ввод» или двойным щелчком кнопкой мыши)

source: The currently focused item has changed
ru_ru: Текущий элемент в фокусе изменился

source: A key has been pressed
ru_ru: Клавиша была нажата

source: A column (m_col) has been left-clicked
ru_ru: Выполнен щелчок левой кнопкой мыши по столбцу (m_col)

source: A column (m_col) has been right-clicked
ru_ru: Выполнен щелчок правой кнопкой мыши по столбцу (m_col)

source: The user started resizing a column - can be vetoed
ru_ru: Пользователь начал изменение размера столбца — можно запретить

source: The divider between columns is being dragged
ru_ru: Выполняется перетаскивание разделителя столбцов

source: A column has been resized by the user
ru_ru: Размер столбца изменён пользователем

source: Begin dragging with the left mouse button
ru_ru: Начать перетаскивание левой кнопкой мыши

source: Begin dragging with the right mouse button.
ru_ru: Начать перетаскивание правой кнопкой мыши

source: Begin editing a label. This can be prevented by calling Veto()
ru_ru: Начать изменение метки. Это можно предотвратить, вызвав Veto()

source: Finish editing a label. This can be prevented by calling Veto()
ru_ru: Завершить изменение метки. Это можно предотвратить, вызвав Veto()

source: Delete an item
ru_ru: Удалить элемент

source: Delete all items
ru_ru: Удалить все элементы

source: An item has been inserted
ru_ru: Выполнена вставка элемента

source: Select the media control backend, leave empty for the default
ru_ru: Выбрать серверную часть элемента управления мультимедиа. Оставьте поле пустым, чтобы использовать значение по умолчанию

source: Show the player controls
ru_ru: Показать элементы управления проигрывателем

source: Sent when a media has loaded enough data that it can start playing
ru_ru: Отправляется после загрузки достаточного количества данных медиафайла для воспроизведения.

source: Sent when a media has switched to the wxMEDIASTATE_STOPPED state. You may be able to Veto this event to prevent it from stopping, causing it to continue playing - even if it has reached that end of the media (note that this may not have the desired effect - if you want to loop the media, for example, catch the EVT_MEDIA_FINISHED and play there instead).
ru_ru: Отправляется после переключения медиафайла в состояние wxMEDIASTATE_STOPPED. Можно запретить это событие, чтобы предотвратить остановку, принудительно продолжая воспроизведение, даже если достигнут конец медиафайла (обратите внимание, что это может не дать желаемого эффекта — если требуется зациклить медиафайл, захватите, например, EVT_MEDIA_FINISHED и воспроизводите с помощью него).

source: Sent when a media has finished playing in a wxMediaCtrl.
ru_ru: Отправляется после завершения воспроизведения медиафайла в wxMediaCtrl.

source: Sent when a media has switched its state (from any media state)
ru_ru: Отправляется после переключения состояния медиафайла (из любого состояния медиафайла).

source: Sent when a media has switched to the wxMEDIASTATE_PLAYING state
ru_ru: Отправляется после переключения медиафайла в состояние wxMEDIASTATE_PLAYING.

source: Sent when a media has switched to the wxMEDIASTATE_PAUSED state
ru_ru: Отправляется после переключения медиафайла в состояние wxMEDIASTATE_PAUSED.

source: Menu item has been clicked
ru_ru: Выполнен щелчок по пункту меню

source: C++ variable name
ru_ru: Имя переменной C++

source: Menu Item
ru_ru: Пункт меню

source: The menu item label
ru_ru: Метка пункта меню

source: Short help string
ru_ru: Короткая строка справки

source: Menu item image
ru_ru: Изображение пункта меню

source: The type of menu item: normal, radio, checkable or separator
ru_ru: Тип пункта меню: обычный, с переключателем, флажком или разделителем

source: For a checkable menu item, should this be checked
ru_ru: Следует ли установить флажок для этого пункта меню с флажками?

source: The menu is about to open
ru_ru: Меню будет открыто

source: A particular menu item has been highlit
ru_ru: Определённый пункт меню был выделен

source: The currently selected menu item has changed
ru_ru: Выбранный пункт меню изменился

source: The menu is about to close
ru_ru: Меню будет закрыто

source: Menu
ru_ru: Меню

source: A title for the popup menu
ru_ru: Заголовок всплывающего меню

source: The tab's label
ru_ru: Метка вкладки

source: Tab Image
ru_ru: Изображение вкладки

source: Select this page
ru_ru: Выбрать эту страницу

source: Add a NULL page. This is only makes sense when the notebook is of type wxTreebook
ru_ru: Добавить пустую страницу. Это имеет смысл только в том случае, если блокнот имеет тип wxTreebook

source: Expand this node
ru_ru: Развернуть этот узел

source: Respond to wxEVT_PG_SELECTED event, generated when a property selection has been changed, either by user action or by indirect program function. For instance, collapsing a parent property programmatically causes any selected child property to become unselected, and may therefore cause this event to be generated.
ru_ru: Отвечать на событие wxEVT_PG_SELECTED, создаваемое при изменении выбора свойства либо действием пользователя, либо косвенной функцией программы. Например, свёртывание родительского свойства программным путём приводит к отмене выбора дочернего свойства и, следовательно, может привести к созданию этого события.

source: Respond to wxEVT_PG_CHANGED event, generated when property value has been changed by the user
ru_ru: Отвечать на событие wxEVT_PG_CHANGED, создаваемое при изменении значения свойства пользователем.

source: Respond to wxEVT_PG_CHANGING event, generated when property value is about to be changed by user. Use wxPropertyGridEvent::GetValue() to take a peek at the pending value, and wxPropertyGridEvent::Veto() to prevent change from taking place, if necessary
ru_ru: Отвечать на событие wxEVT_PG_CHANGED, создаваемое, когда пользователь собирается изменить значение свойства. Используйте wxPropertyGridEvent::GetValue(), чтобы взглянуть на ожидающее значение, и wxPropertyGridEvent::Veto(), чтобы предотвратить изменение, если это необходимо.

source: Respond to wxEVT_PG_HIGHLIGHTED event, which occurs when mouse moves over a property. Event's property is NULL if hovered area does not belong to any property.
ru_ru: Отвечать на событие wxEVT_PG_HIGHLIGHTED, которое возникает при наведении указателя мыши на свойство. Свойство события имеет значение NULL, если область под указателем не принадлежит ни одному свойству.

source: Respond to wxEVT_PG_RIGHT_CLICK event, which occurs when property is clicked on with right mouse button.
ru_ru: Отвечать на событие wxEVT_PG_RIGHT_CLICK, которое возникает при выполнении щелчка правой кнопкой мыши по свойству.

source: Respond to wxEVT_PG_DOUBLE_CLICK event, which occurs when property is double-clicked on with left mouse button.
ru_ru: Отвечать на событие wxEVT_PG_RIGHT_CLICK, которое возникает при выполнении двойного щелчка левой кнопкой мыши по свойству.

source: Respond to wxEVT_PG_ITEM_COLLAPSED event, generated when user collapses a property or category.
ru_ru: Отвечать на событие wxEVT_PG_ITEM_COLLAPSED, создаваемое при свёртывании пользователем свойства или категории.

source: Respond to wxEVT_PG_ITEM_EXPANDED event, generated when user expands a property or category.
ru_ru: Отвечать на событие wxEVT_PG_ITEM_EXPANDED, создаваемое при развёртывании пользователем свойства или категории.

source: Respond to wxEVT_PG_LABEL_EDIT_BEGIN event, generated when user is about to begin editing a property label. You can veto this event to prevent the action.
ru_ru: Отвечать на событие wxEVT_PG_LABEL_EDIT_BEGIN, создаваемое, когда пользователь собирается начать изменение метки свойства. Вы можете запретить это событие, чтобы предотвратить действие.

source: Respond to wxEVT_PG_LABEL_EDIT_ENDING event, generated when user is about to end editing of a property label. You can veto this event to prevent the action.
ru_ru: Отвечать на событие wxEVT_PG_LABEL_EDIT_ENDING, создаваемое, когда пользователь собирается завершить изменение метки свойства. Вы можете запретить это событие, чтобы предотвратить действие.

source: Respond to wxEVT_PG_COL_BEGIN_DRAG event, generated when user starts resizing a column - can be vetoed.
ru_ru: Отвечать на событие wxEVT_PG_COL_BEGIN_DRAG, создаваемое, когда пользователь начинает изменение размера столбца — можно запретить.

source: Respond to wxEVT_PG_COL_DRAGGING, event, generated when a column resize by user is in progress. This event is also generated when user double-clicks the splitter in order to recenter it.
ru_ru: Отвечать на событие wxEVT_PG_COL_DRAGGING, создаваемое при изменении размера столбца пользователем. Это событие также создаётся при выполнении двойного щелчка по разделителю для изменения его положения.

source: Respond to wxEVT_PG_COL_END_DRAG event, generated after column resize by user has finished.
ru_ru: Отвечать на событие wxEVT_PG_COL_END_DRAG, создаваемое после завершения изменения размера столбца пользователем.

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, when the custom editor button is clicked.
ru_ru: Обрабатывать событие wxEVT_COMMAND_BUTTON_CLICKED при нажатии кнопки пользовательского редактора.

source: Sets x coordinate of the splitter
ru_ru: Устанавливает координату x разделителя

source: Moves splitter as left as possible, while still allowing all labels to be shown in full
ru_ru: Перемещает разделитель как можно левее, при этом сохраняя возможность отображения всех меток полностью

source: The property name
ru_ru: Имя свойства

source: The property label
ru_ru: Метка свойства

source: The property help string
ru_ru: Строка справки по свойству

source: Property background colour
ru_ru: Цвет фона свойства

source: Set custom editor control to a property
ru_ru: Установить элемент управления пользовательского редактора для свойства

source: The property kind
ru_ru: Тип свойства

source: Initial string value
ru_ru: Начальное значение строки

source: For properties that accepts array of strings (wxEnumProperty, wxEditEnumProperty and wxFlagsProperty) set the strings display name
ru_ru: Для свойств, которые принимают массив строк (wxEnumProperty, wxEditEnumProperty и wxFlagsProperty), укажите отображаемые имена строк

source: For properties that accepts array of strings (wxEnumProperty, wxEditEnumProperty and wxFlagsProperty) set the strings values (optional for wxEnumProperty and wxEditEnumProperty)
ru_ru: Для свойств, которые принимают массив строк (wxEnumProperty, wxEditEnumProperty и wxFlagsProperty), укажите значения строк (необязательно для wxEnumProperty и wxEditEnumProperty)

source: Initial value, relevant to wxBoolProperty
ru_ru: Начальное значение, соответствующее wxBoolProperty

source: wxFileProperty's wildcard
ru_ru: Подстановочный знак wxFileProperty

source: Initial Colour
ru_ru: Исходный цвет

source: My RadioBox
ru_ru: Мой переключатель

source: An array of choices with which to initialize the radiobox
ru_ru: Массив вариантов, с помощью которых инициализируется переключатель

source: The zero-based position of the selected button
ru_ru: Позиция выбранной кнопки с отсчётом от нуля

source: Specifies the maximum number of rows (if style contains wxRA_SPECIFY_ROWS) or columns (if style contains wxRA_SPECIFY_COLS) for a two-dimensional radiobox
ru_ru: Устанавливает максимальное количество строк (если стиль содержит wxRA_SPECIFY_ROWS) или столбцов (если стиль содержит wxRA_SPECIFY_COLS) для двухмерного переключателя.

source: Process a wxEVT_COMMAND_RADIOBOX_SELECTED event, when a radiobutton is clicked.
ru_ru: Обрабатывать событие wxEVT_COMMAND_RADIOBOX_SELECTED при нажатии кнопки-переключателя.

source: My RadioButton
ru_ru: Моя кнопка-переключатель

source: Initial value
ru_ru: Начальное значение

source: Process a wxEVT_COMMAND_RADIOBUTTON_SELECTED event, when the radiobutton is clicked.
ru_ru: Обрабатывать событие wxEVT_COMMAND_RADIOBUTTON_SELECTED при нажатии кнопки-переключателя.

source: Triggered after the transition from one page being active to a different page being active.
ru_ru: Активируется после того, как активной становится другая страница.

source: Triggered prior to the transition from one page being active to a different page being active, and can veto the change.
ru_ru: Активируется перед тем, как активной становится другая страница, и может запретить изменение.

source: Triggered when the middle mouse button is pressed on a tab.
ru_ru: Активируется при нажатии средней кнопки мыши на вкладке.

source: Triggered when the middle mouse button is released on a tab.
ru_ru: Активируется при отпускании средней кнопки мыши на вкладке.

source: Triggered when the right mouse button is pressed on a tab.
ru_ru: Активируется при нажатии правой кнопки мыши на вкладке.

source: Triggered when the right mouse button is released on a tab.
ru_ru: Активируется при отпускании правой кнопки мыши на вкладке.

source: Triggered when the left mouse button is double clicked on a tab.
ru_ru: Активируется при двойном щелчке левой кнопкой мыши по вкладке.

source: Select the ribbon bar theme
ru_ru: Выбрать тему панели ленты

source: Button
ru_ru: Кнопка

source: Help string
ru_ru: Строка справки

source: The button type
ru_ru: Тип кнопки

source: Triggered when the normal (non-dropdown) region of a button on the button bar is clicked.
ru_ru: Активируется при щелчке по обычной (не раскрывающейся) области кнопки на панели кнопок.

source: Triggered when the dropdown region of a button on the button bar is clicked. wxRibbonButtonBarEvent::PopupMenu() should be called by the event handler if it wants to display a popup menu (which is what most dropdown buttons should be doing).
ru_ru: Активируется при щелчке по раскрывающейся области кнопки на панели кнопок. wxRibbonButtonBarEvent::PopupMenu() должно быть вызвано обработчиком событий, если необходимо отобразить всплывающее меню (что должно выполняться большинством кнопок раскрывающегося списка).

source: Triggered when the normal (non-dropdown) region of a tool on the toolbar is clicked.
ru_ru: Активируется при щелчке по обычной (не раскрывающейся) области инструмента на панели инструментов.

source: Triggered when the dropdown region of a tool on the toolbar is clicked. wxRibbonToolBarEvent::PopupMenu() should be called by the event handler if it wants to display a popup menu (which is what most dropdown buttons should be doing).
ru_ru: Активируется при щелчке по раскрывающейся области инструмента на панели инструментов. wxRibbonButtonBarEvent::PopupMenu() должно быть вызвано обработчиком событий, если необходимо отобразить всплывающее меню (что должно выполняться большинством кнопок раскрывающегося списка).

source: Triggered when the user selects an item from the gallery. Note that the ID is that of the gallery, not of the item.
ru_ru: Активируется при выборе пользователем элемента из коллекции. Обратите внимание, что идентификатор относится к коллекции, а не к элементу.

source: Similar to EVT_RIBBONGALLERY_SELECTED but triggered every time a gallery item is clicked, even if it is already selected. Note that the ID of the event is that of the gallery, not of the item, just as above. This event is available since wxWidgets 2.9.2.
ru_ru: Аналогично EVT_RIBBONGALLERY_SELECTED, но активируется при каждом щелчке по элементу коллекции, даже если он уже выбран. Обратите внимание, что идентификатор события относится к коллекции, а не к элементу, как и выше. Это событие доступно начиная с версии 2.9.2 wxWidgets.

source: Triggered when the item being hovered over by the user changes. The item in the event will be the new item being hovered, or NULL if there is no longer an item being hovered. Note that the ID is that of the gallery, not of the item.
ru_ru: Активируется при изменении элемента под указателем мыши. Элемент в событии будет новым элементом под указателем мыши или NULL, если под указателем мыши больше нет элемента. Обратите внимание, что идентификатор относится к коллекции, а не к элементу.

source: Triggered when the "extension" button of the gallery is pressed
ru_ru: Активируется при нажатии кнопки «расширения» коллекции.

source: Page Icon
ru_ru: Значок страницы

source: Page Label
ru_ru: Метка страницы

source: Selected
ru_ru: Выбрано

source: The Label
ru_ru: Метка

source: Icon to be used in place of the panel's children when the panel is minimised
ru_ru: Значок, который следует использовать вместо дочерних элементов панели при её свёртывании

source: Triggered when the user activate the panel extension button
ru_ru: Активируется при нажатии пользователем кнопки расширения панели.

source: Set the minimum number of rows to distribute tool groups over
ru_ru: Установить минимальное количество строк для распределения групп инструментов.

source: Set the maximum number of rows to distribute tool groups over. Use -1 as default value
ru_ru: Установить максимальное количество строк для распределения групп инструментов. Использовать -1 в качестве значения по умолчанию.

source: wxRibbonToolBar Separator
ru_ru: Разделитель wxRibbonToolBar

source: Process a wxEVT_COMMAND_RICHTEXT_CHARACTER event, generated when the user presses a character key. Valid event functions: GetFlags, GetPosition, GetCharacter.
ru_ru: Обрабатывать событие wxEVT_COMMAND_RICHTEXT_CHARACTER, создаваемое при нажатии пользователем клавиши символа. Допустимые функции события: GetFlags, GetPosition, GetCharacter.

source: Process a wxEVT_COMMAND_RICHTEXT_DELETE event, generated when the user presses the backspace or delete key. Valid event functions: GetFlags, GetPosition
ru_ru: Обрабатывать событие wxEVT_COMMAND_RICHTEXT_DELETE, создаваемое при нажатии пользователем клавиши Backspace или Delete. Допустимые функции события: GetFlags, GetPosition.

source: Process a wxEVT_COMMAND_RICHTEXT_RETURN event, generated when the user presses the return key. Valid event functions: GetFlags, GetPosition.
ru_ru: Обрабатывать событие wxEVT_COMMAND_RICHTEXT_RETURN, создаваемое при нажатии пользователем клавиши «Ввод». Допустимые функции события: GetFlags, GetPosition.

source: Process a wxEVT_COMMAND_RICHTEXT_STYLE_CHANGED event, generated when styling has been applied to the control. Valid event functions: GetPosition, GetRange.
ru_ru: Обрабатывать событие wxEVT_COMMAND_RICHTEXT_STYLE_CHANGED, создаваемое, когда стиль был применён к элементу управления. Допустимые функции события: GetPosition, GetRange.

source: Process a wxEVT_COMMAND_RICHTEXT_STYLESHEET_CHANGING event, generated when the control's stylesheet has changed, for example the user added, edited or deleted a style. Valid event functions: GetRange, GetPosition.
ru_ru: Обрабатывать событие wxEVT_COMMAND_RICHTEXT_STYLESHEET_CHANGING, создаваемое при изменении таблицы стилей элемента управления, например, при добавлении, изменении или удалении стиля пользователем. Допустимые функции события: GetRange, GetPosition.

source: Process a wxEVT_COMMAND_RICHTEXT_STYLESHEET_REPLACING event, generated when the control's stylesheet is about to be replaced for example when a file is loaded into the control. Valid event functions: Veto, GetOldStyleSheet, GetNewStyleSheet.
ru_ru: Обрабатывать событие wxEVT_COMMAND_RICHTEXT_STYLESHEET_REPLACING, создаваемое перед заменой таблицы стилей элемента управления, например, при загрузке файла в элемент управления. Допустимые функции события: Veto, GetOldStyleSheet, GetNewStyleSheet.

source: Process a wxEVT_COMMAND_RICHTEXT_STYLESHEET_REPLACED event, generated when the control's stylesheet has been replaced for example when a file is loaded into the control Valid event functions: GetOldStyleSheet, GetNewStyleSheet.
ru_ru: Обрабатывать событие wxEVT_COMMAND_RICHTEXT_STYLESHEET_REPLACED, создаваемое после замены таблицы стилей элемента управления, например, при загрузке файла в элемент управления. Допустимые функции события: GetOldStyleSheet, GetNewStyleSheet.

source: Process a wxEVT_COMMAND_RICHTEXT_CONTENT_INSERTED event generated when content has been inserted into the control. Valid event functions: GetPosition, GetRange.
ru_ru: Обрабатывать событие wxEVT_COMMAND_RICHTEXT_CONTENT_INSERTED, создаваемое при вставке содержимого в элемент управления. Допустимые функции события: GetPosition, GetRange.

source: Process a wxEVT_COMMAND_RICHTEXT_CONTENT_DELETED event, generated when content has been deleted from the control Valid event functions: GetPosition, GetRange.
ru_ru: Обрабатывать событие wxEVT_COMMAND_RICHTEXT_CONTENT_DELETED, создаваемое при удалении содержимого из элемента управления. Допустимые функции события: GetPosition, GetRange.

source: Process a wxEVT_COMMAND_RICHTEXT_BUFFER_RESET event, generated when the buffer has been reset by deleting all content. You can use this to set a default style for the first new paragraph.
ru_ru: Обрабатывать событие wxEVT_COMMAND_RICHTEXT_BUFFER_RESET, создаваемое при сбросе буфера путём удаления всего содержимого. Можно использовать это действие для установки стиля по умолчанию для первого нового абзаца.
