Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Dump data to file
ru_ru: Выгрузить данные в файл

source: Dump data from database into .sql file
ru_ru: Выгрузить данные из базы данных в файл .sql

source: Open SQL command panel for the table
ru_ru: Открыть панель команд SQL для таблицы

source: Run SQL command to delete the table
ru_ru: Выполнить команду SQL для удаления таблицы

source: Create classes from Table
ru_ru: Создать классы из таблицы

source: Create C++ classes for the table
ru_ru: Создать классы C++ для таблицы

source: Copy Column Name
ru_ru: Копировать имя столбца

source: Open SQL command panel for the view
ru_ru: Открыть панель команд SQL для представления

source: Run SQL command to delete the view
ru_ru: Выполнить команду SQL, чтобы удалить представление

source: Wizard for creating db structure
ru_ru: Мастер создания структуры базы данных

source: on ERD diagram base.
ru_ru: на базе диаграммы ERD.

source: All tables which really exist in
ru_ru: Все таблицы, которые действительно существуют в

source: the database, will be deleted during
ru_ru: базе данных, будут удалены во время

source: this process, but you can do a backup
ru_ru: этого процесса, но вы можете создать резервную копию

source: in the second step.
ru_ru: на втором шаге.

source: Select target database:
ru_ru: Выбрать целевую базу данных:

source: The first time you have to select a target database!
ru_ru: В первый раз необходимо выбрать целевую базу данных!

source: Backup data file
ru_ru: Файл резервной копии

source: Select file
ru_ru: Выбрать файл

source: Backup database structure
ru_ru: Резервная структура базы данных

source: Backup structure file
ru_ru: Резервный файл структуры

source: Backup!
ru_ru: Резервная копия!

source: Backing up database data before changing the structure is really good idea. Do you want to continue without doing so?
ru_ru: Рекомендуется выполнить резервное копирование информации базы данных перед изменением структуры.Продолжить без резервного копирования?

source: Backup
ru_ru: Резервное копирование

source: Data saved!
ru_ru: Данные сохранены!

source: Structure saved!
ru_ru: Структура сохранена!

source: Write log:
ru_ru: Журнал записи:

source: Write !!
ru_ru: Записать!

source: Show SQL
ru_ru: Показать SQL

source: Data structure written successfully!
ru_ru: Структура данных успешно записана!

source: Unknown error!
ru_ru: Неизвестная ошибка!

source: Question
ru_ru: Вопрос

source: Would you like to continue without writing the database structure?
ru_ru: Продолжить без записи структуры базы данных?

source: Writing structure ended.
ru_ru: Запись структуры завершена.

source: File for data restore:
ru_ru: Файл для восстановления данных:

source: Restore log:
ru_ru: Журнал восстановления:

source: Restore
ru_ru: Восстановить

source: Open
ru_ru: Открыть

source: Open diagram
ru_ru: Открыть диаграмму

source: Save
ru_ru: Сохранить

source: Save diagram
ru_ru: Сохранить диаграмму

source: Save SQL
ru_ru: Сохранить SQL

source: Commit ERD
ru_ru: Зафиксировать ERD

source: Export canvas to image
ru_ru: Экспорт холста в изображение

source: Print
ru_ru: Печать

source: Print diagram
ru_ru: Печать диаграммы

source: Preview
ru_ru: Предварительный просмотр

source: Print preview
ru_ru: Предварительный просмотр печати

source: Copy
ru_ru: Копировать

source: Copy item
ru_ru: Копировать элемент

source: Cut
ru_ru: Вырезать

source: Cut item
ru_ru: Вырезать элемент

source: Paste
ru_ru: Вставить

source: Paste item
ru_ru: Вставить элемент

source: Undo
ru_ru: Отменить

source: Redo
ru_ru: Восстановить

source: Tool
ru_ru: Инструмент

source: Design tool
ru_ru: Инструмент разработки

source: Database table
ru_ru: Таблица базы данных

source: View
ru_ru: Вид

source: Database view
ru_ru: Представление базы данных

source: Constraint 1:N
ru_ru: Ограничение 1:N

source: Foreign key connection
ru_ru: Соединение внешнего ключа

source: Align into circle
ru_ru: Выровнять в круг

source: Align into mesh
ru_ru: Выровнять в сетку

source: Align into vertical tree
ru_ru: Выровнять в вертикальное дерево

source: Align into horizontal tree
ru_ru: Выровнять в горизонтальное дерево

source: Zoom to all
ru_ru: Применить масштаб ко всем

source: Load canvas from file...
ru_ru: Загрузить холст из файла...

source: Save canvas to file...
ru_ru: Сохранить холст в файл...

source: Save SQL create query...
ru_ru: Сохранить SQL-запрос...

source: The SQL script has been saved to '%s'.
ru_ru: Сценарий SQL был сохранён в «%s».

source: ERD type doesn't match current database adapter.
ru_ru: Тип ERD не соответствует текущему адаптеру базы данных.

source: The chart has been saved to '%s'.
ru_ru: Диаграмма была сохранена в «%s».

source: New table
ru_ru: Новая таблица

source: New view
ru_ru: Новое представление

source: Add new ERD table
ru_ru: Добавить новую таблицу ERD

source: Add new ERD view
ru_ru: Добавить новое представление ERD

source: Copy diagram SQL to the clipboard
ru_ru: Копировать диаграмму SQL в буфер обмена

source: Create foreign key for table
ru_ru: Создать внешний ключ для таблицы

source: Create view for table
ru_ru: Создать представление для таблицы

source: Copy table SQL to the clipboard
ru_ru: Копировать таблицу SQL в буфер обмена

source: Add drop table statement?
ru_ru: Добавить табличный оператор отбрасывания?

source: SQL export
ru_ru: Экспорт SQL

source: SQL command has been copied to the clipboard.
ru_ru: Команда SQL была скопирована в буфер обмена.

source: Output file:
ru_ru: Выходной файл:

source: Browse
ru_ru: Обзор

source: Scale
ru_ru: Масштаб

source: Current canvas scale
ru_ru: Текущий масштаб холста

source: Custom scale
ru_ru: Пользовательский масштаб

source: Export canvas background
ru_ru: Экспорт фона холста

source: Database file:
ru_ru: Файл базы данных:

source: Connection name:
ru_ru: Имя соединения:

source: Name for this connection
ru_ru: Имя для этого соединения

source: Server:
ru_ru: Сервер:

source: Host name / IP of the server hosting the MySQL server
ru_ru: Имя хоста/IP-адрес сервера, на котором размещён сервер MySQL

source: User name:
ru_ru: Имя пользователя:

source: Database user name
ru_ru: Имя пользователя базы данных

source: Password:
ru_ru: Пароль:

source: Database password
ru_ru: Пароль базы данных

source: Name:
ru_ru: Имя:

source: Port:
ru_ru: Порт:

source: Default database:
ru_ru: База данных по умолчанию:

source: Referencing table:
ru_ru: Таблица, содержащая ссылку:

source: Column:
ru_ru: Столбец:

source: Relation
ru_ru: Отношение

source: restrict
ru_ru: ограничить

source: cascade
ru_ru: каскад

source: set null
ru_ru: присвоить пустое значение

source: no action
ru_ru: не выполнять никаких действий

source: Referenced table:
ru_ru: Таблица, на которую указывает ссылка:

source: Log
ru_ru: Журнал

source: View name:
ru_ru: Имя представления:

source: Class prefix:
ru_ru: Префикс класса:

source: Class postfix:
ru_ru: Постфикс класса:

source: Folder:
ru_ru: Папка:

source: Select a folder
ru_ru: Выбрать папку

source: Virtual folder:
ru_ru: Виртуальная папка:

source: Template:
ru_ru: Шаблон:

source: Log:
ru_ru: Журнал:

source: Generate
ru_ru: Создать

source: Table name:
ru_ru: Имя таблицы:

source: Columns:
ru_ru: Столбцы:

source: Add column
ru_ru: Добавить столбец

source: Add new column
ru_ru: Добавить новый столбец

source: Remove column
ru_ru: Удалить столбец

source: Remove selected column
ru_ru: Удалить выбранный столбец

source: Move column up
ru_ru: Переместить столбец вверх

source: Move selected column up
ru_ru: Переместить выбранный столбец вверх

source: Move column down
ru_ru: Переместить столбец вниз

source: Move selected column down
ru_ru: Переместить выбранный столбец вниз

source: Column name
ru_ru: Имя столбца

source: Type
ru_ru: Тип

source: Size
ru_ru: Размер

source: Not null
ru_ru: Ненулевое значение

source: Autoincrement
ru_ru: Автоприращение

source: Primary key
ru_ru: Первичный ключ

source: Foreign keys:
ru_ru: Внешние ключи:

source: Add foreign key
ru_ru: Добавить внешний ключ

source: Add new foreign key
ru_ru: Добавить новый внешний ключ

source: Remove foreign key
ru_ru: Удалить внешний ключ

source: Remove selected foreign key
ru_ru: Удалить выбранный внешний ключ

source: Key name
ru_ru: Имя ключа

source: Local column:
ru_ru: Локальный столбец:

source: Ref. table:
ru_ru: Таблица-ссылка:

source: Ref. column:
ru_ru: Столбец-ссылка:

source: On update
ru_ru: При обновлении

source: On delete
ru_ru: При удалении

source: Export image
ru_ru: Экспорт изображения

source: Select dbAdapter
ru_ru: Выбрать dbAdapter

source: Connection settings
ru_ru: Параметры подключения

source: Create foreign key
ru_ru: Создать внешний ключ

source: Database log
ru_ru: Журнал базы данных

source: View settings
ru_ru: Параметры представления

source: Class generator dialog
ru_ru: Диалоговое окно генератора классов

source: SQL Preview
ru_ru: Предварительный просмотр SQL

source: Table settings
ru_ru: Параметры таблицы

source: --------------- Log starts at:
ru_ru: ---------------Журнал запускается в:

source: -- selected database %s
ru_ru: -- выбрана база данных %s

source: Load SQL Script
ru_ru: Загрузить сценарий SQL

source: Execute SQL
ru_ru: Выполнить SQL

source: Executing SQL...
ru_ru: Выполнение SQL...

source: Unknown SQL error.
ru_ru: Неизвестная ошибка SQL.

source: Cant connect!
ru_ru: Не удалось подключиться!

source: Choose a file
ru_ru: Выбрать файл

source: Chose a file
ru_ru: Выбрать файл

source: Insert SELECT SQL template
ru_ru: Вставить шаблон SQL SELECT.

source: Insert SELECT SQL statement template into editor.
ru_ru: Вставить шаблон SQL-инструкции SELECT в редактор.

source: Insert INSERT SQL template
ru_ru: Вставить шаблон SQL INSERT.

source: Insert INSERT SQL statement template into editor.
ru_ru: Вставить шаблон SQL-инструкции INSERT в редактор.

source: Insert UPDATE SQL template
ru_ru: Вставить шаблон SQL UPDATE.

source: Insert UPDATE SQL statement template into editor.
ru_ru: Вставить шаблон SQL-инструкции UPDATE в редактор.

source: Insert DELETE SQL template
ru_ru: Вставить шаблон SQL DELETE.

source: Insert DELETE SQL statement template into editor.
ru_ru: Вставить шаблон SQL-инструкции DELETE в редактор.

source: column
ru_ru: столбец

source: DatabaseExplorer for CodeLite
ru_ru: Модуль обозревателя баз данных для CodeLite

source: DbExplorer
ru_ru: Модуль обозревателя баз данных

source: Database Explorer
ru_ru: Модуль обозревателя баз данных

source: Cross platform database explorer
ru_ru: Кроссплатформенный обозреватель баз данных

source: 2011 - 2015 (C) Tomas Bata University, Zlin, Czech Republic
ru_ru: © Университет Томаша Бати, Злин, Чешская Республика, 2011—2015

source: Image path cannot be empty.
ru_ru: Путь к изображению не может быть пустым.

source: Canvas scale must be decimal value.
ru_ru: Масштаб холста должен быть десятичным значением.

source: Export ERD to image...
ru_ru: Экспорт ERD в изображение...

source: New source breakpoint
ru_ru: Создать точку останова в исходном файле

source: New function breakpoint
ru_ru: Создать точку останова в функции

source: Delete All
ru_ru: Удалить все

source: New function breakppoint
ru_ru: Создать точку останова в функции

source: Function name
ru_ru: Имя функции

source: Set breakpoint in function
ru_ru: Установить точку останова в функции

source: Location (source:line)
ru_ru: Расположение (source:line)

source: Set breakpoint in source file
ru_ru: Установить точку останова в исходном файле

source: Invalid line number
ru_ru: Недопустимый номер строки

source: Name
ru_ru: Имя

source: Line
ru_ru: Строка

source: Source
ru_ru: Источник

source: Threads
ru_ru: Потоки

source: Value
ru_ru: Значение

source: Scopes
ru_ru: Области

source: Loading...
ru_ru: Загрузка...

source: Expand all threads
ru_ru: Развернуть все потоки

source: Copy all
ru_ru: Копировать всё

source: Copy this thread backtrace
ru_ru: Копировать эту обратную трассировку потока

source: Output
ru_ru: Вывод

source: Modules
ru_ru: Модули

source: Expression
ru_ru: Выражение

source: Variables
ru_ru: Переменные

source: New
ru_ru: Создать

source: Delete
ru_ru: Удалить

source: Add watch
ru_ru: Добавить наблюдение

source: Expression:
ru_ru: Выражение:

source: Scan
ru_ru: Найти

source: Help
ru_ru: Справка

source: Delete '
ru_ru: Удалить '

source: Are you sure you want to scan for dap servers? (this will override your current settings)
ru_ru: Выполнить поиск серверов DAP? (это переопределит ваши текущие параметры)

source: Enter name
ru_ru: Введите имя

source: New dap server name
ru_ru: Имя нового сервера DAP

source: General
ru_ru: Общие

source: Connection string
ru_ru: Строка подключения

source: Launch type
ru_ru: Тип запуска

source: File path options
ru_ru: Параметры пути к файлу

source: Use relative paths
ru_ru: Использовать относительные пути

source: Use forward slash
ru_ru: Использовать косую черту

source: Use volume
ru_ru: Использовать том

source: Environment variables
ru_ru: Переменные среды

source: Server environment
ru_ru: Среда сервера

source: Environment format
ru_ru: Формат среды

source: Thread, stacks & variables
ru_ru: Поток, стеки и переменные

source: Breakpoints
ru_ru: Точки останова

source: Watches
ru_ru: Наблюдения

source: Debug Adapter Client
ru_ru: Клиент адаптера отладки

source: Settings
ru_ru: Параметры

source: Debug Adapter Client...
ru_ru: Клиент адаптера отладки…

source: Could not locate project:
ru_ru: Не удалось определить расположение проекта:

source: Could not locate the requested build configuration
ru_ru: Не удалось определить расположение требуемой конфигурации сборки

source: A debug session is running Cancel debug session and continue building?
ru_ru: Сеанс отладки запущен. Отменить сеанс отладки и продолжить сборку?

source: Failed to evaluate expression:
ru_ru: Не удалось вычислить выражение:

source: ERROR: (dap) loading remote file over SSH is not supported yet
ru_ru: ОШИБКА: загрузка удалённого файла (DAP) по SSH пока не поддерживается

source: does not exist
ru_ru: не существует

source: ERROR: (dap) file:
ru_ru: ОШИБКА: файл (DAP):

source: File
ru_ru: Файл

source: Fullpath
ru_ru: Полный путь

source: Internal breakpoint was hit (id=%d), Applying user breakpoints and continuing
ru_ru: Была достигнута внутренняя точка останова (id=%d). Примененыпользовательские точки останова, и операция продолжается

source: Program exited normally.
ru_ru: Программа нормально завершила работу.

source: ERROR: failed to place breakpoint: "%s"
ru_ru: ОШИБКА: не удалось поместить точку останова: «%s»

source: Found the breakpoint ID!
ru_ru: Найден ID точки останова!

source: Successfully set breakpoint %ld at:
ru_ru: Точка останова %ld успешно установлена в:

source: Successfully set conditional breakpoint %ld at:
ru_ru: Условная точка останова %ld успешно установлена в:

source: Successfully set temporary breakpoint %ld at:
ru_ru: Временная точка останова %ld успешно установлена в:

source: Successfully set watchpoint %ld watching:
ru_ru: Точка наблюдения %ld успешно установлена:

source: Successfully set read watchpoint %ld watching:
ru_ru: Точка наблюдения чтения %ld успешно установлена:

source: Successfully set read/write watchpoint %ld watching:
ru_ru: Точка наблюдения чтения/записи %ld успешно установлена:

source: address
ru_ru: адрес

source: Successfully connected to debugger server
ru_ru: Успешное соединение с сервером отладчика

source: Applying breakpoints...
ru_ru: Применение точек останова...

source: Applying breakpoints... done
ru_ru: Применение точек останова... Готово

source: Breakpoint %i condition cleared
ru_ru: Условие точки останова %i очищено

source: Condition %s set for breakpoint %i
ru_ru: Условие %s установлено для точки останова %i

source: Debugging over SSH, using account:
ru_ru: Отладка по SSH с использованием учётной записи:

source: Current working dir:
ru_ru: Текущий рабочий каталог:

source: Launching gdb from :
ru_ru: Запуск GDB из:

source: Starting debugger :
ru_ru: Запуск отладчика:

source: Can't interrupt debuggee process: I don't know its PID!
ru_ru: Не удалось прервать отлаживаемый процесс: его PID неизвестен!

source: Failed to start debugger: permission denied
ru_ru: Не удалось запустить отладчик: разрешение отклонено

source: Clear
ru_ru: Очистить

source: Remove all containers
ru_ru: Удалить все контейнеры

source: Remove unused images
ru_ru: Удалить неиспользуемые образы

source: Containers
ru_ru: Контейнеры

source: Images
ru_ru: Изображения

source: Remove all unused images, not just dangling ones
ru_ru: Удалить все неиспользуемые образы, а не только образы, не привязанные к контейнеру

source: Restart
ru_ru: Перезапустить

source: Stop
ru_ru: Остановить

source: Pause
ru_ru: Пауза

source: Attach Terminal
ru_ru: Присоединить терминал

source: Delete Container
ru_ru: Удалить контейнер

source: Workspace Path:
ru_ru: Путь к рабочему пространству:

source: Build options:
ru_ru: Параметры сборки:

source: Set here the build options to pass to the 'docker build' command. For example: '-t my_container .'
ru_ru: Установите здесь параметры сборки для передачи команде «docker build». Например: «-t my_container».

source: Run
ru_ru: Выполнить

source: Run options:
ru_ru: Параметры выполнения:

source: Set here the build options to pass to the 'docker run' command. For example: '-i my_container .'
ru_ru: Установите здесь параметры сборки для передачи команде «docker run». Например: «-i my_container».

source: Image
ru_ru: Образ

source: Created
ru_ru: Создано

source: Status
ru_ru: Состояние

source: Ports
ru_ru: Порты

source: Names
ru_ru: Имена

source: Repository
ru_ru: Репозиторий

source: Tag
ru_ru: Метка

source: CreatedAt
ru_ru: Время создания

source: New Docker Workspace
ru_ru: Создать рабочее пространство Docker

source: Docker Settings
ru_ru: Параметры Docker

source: Dockerfile Settings
ru_ru: Параметры файлов Dockerfile

source: Can't find docker executable. Please install docker and let me know where it is
ru_ru: Не удалось найти исполняемый файл Docker. Установите Docker и укажите его расположение

source: container(s) Continue?
ru_ru: . Продолжить?

source: Choosing 'Yes' will remove
ru_ru: При выборе «Да» будут удалены контейнеры:

source: Can not create workspace in the root folder
ru_ru: Не удалось создать рабочее пространство в корневой папке

source: New Workspace
ru_ru: Новое рабочее пространство

source: Failed to create workspace Workspace already exists
ru_ru: Не удалось создать рабочее пространство Рабочее пространство уже существует

source: Run...
ru_ru: Выполнить...

source: Build...
ru_ru: Сборка…

source: Docker for CodeLite
ru_ru: Docker для CodeLite

source: Path:
ru_ru: Путь:

source: Toolchain Path:
ru_ru: Путь к цепочке инструментов:

source: Create in a separate directory
ru_ru: Создать в отдельном каталоге

source: New EOS Project
ru_ru: Создать проект EOS

source: CodeLite for EOS
ru_ru: CodeLite для EOS

source: New Project...
ru_ru: Создать проект…

source: EOS Wiki
ru_ru: Вики-сайт EOS

source: Could not find EOS CDT installation. Please install it and try again
ru_ru: Не удалось найти набор инструментов для разработки контракта EOS. Установите его и повторите попытку

source: A project with the same name: '
ru_ru: Проект с таким именем: '

source: Failed to create workspace:
ru_ru: Не удалось создать рабочее пространство:

source: Failed to create project:
ru_ru: Не удалось создать проект:

source: Enable .editorconfig support
ru_ru: Включить поддержку .editorconfig

source: EditorConfig Settings
ru_ru: Параметры модуля конфигурации редактора

source: Support for .editorconfig files in CodeLite
ru_ru: Поддержка файлов .editorconfig в CodeLite

source: EditorConfig
ru_ru: Модуль конфигурации редактора

source: Failed to launch tool '
ru_ru: Не удалось запустить инструмент '

source: Tool ID:
ru_ru: Идентификатор инструмента:

source: Identify this tool with an ID from the given list
ru_ru: Установите идентификатор для этого инструмента, выбрав его из данного списка

source: The name is used to identify this tool in the 'External Tools' toolbar
ru_ru: Имя используется для идентификации этого инструмента на панели «Внешние инструменты»

source: Tool path:
ru_ru: Путь к инструменту:

source: Path to the executable to run
ru_ru: Путь к исполняемому файлу

source: Working directory:
ru_ru: Рабочий каталог:

source: Set the working directory for this tool
ru_ru: Установите рабочий каталог для этого инструмента

source: Toolbar:
ru_ru: Панель инструментов:

source: Toolbar icon (24x24):
ru_ru: Значок панели инструментов (24x24):

source: Browse...
ru_ru: Обзор...

source: Toolbar icon (16x16):
ru_ru: Значок панели инструментов (16x16):

source: General:
ru_ru: Общие:

source: Save all files before executing this tool
ru_ru: Сохранять все файлы перед запуском этого инструмента

source: Before executing this tool, save all files
ru_ru: Сохранить все файлы перед запуском этого инструмента

source: Capture process output
ru_ru: Записывать выходные данные процесса

source: Run this tool when a file is saved
ru_ru: Запускать этот инструмент после сохранения файла

source: Whenever a file is being saved, this tool is called with the file's fullpath as the first input argument.
ru_ru: После сохранения файла этот инструмент вызывается с указанием полного пути к файлу в качестве первого входного аргумента.

source: Show list of available macros
ru_ru: Показать список доступных макросов

source: External Tool
ru_ru: Внешний инструмент

source: Path
ru_ru: Путь

source: New...
ru_ru: Создать...

source: Edit...
ru_ru: Изменить...

source: Delete...
ru_ru: Удалить...

source: Stop All
ru_ru: Остановить все

source: External Tools
ru_ru: Внешние инструменты

source: Tools
ru_ru: Инструменты

source: Are you sure you want to delete this tool?
ru_ru: Вы уверены, что хотите удалить этот инструмент?

source: A plugin that allows user to launch external tools from within CodeLite
ru_ru: Модуль, который позволяет пользователю запускать внешние инструменты из CodeLite

source: External Tool %d
ru_ru: Внешний инструмент %d

source: Configure external tools...
ru_ru: Настроить внешние инструменты...

source: Show Running Tools...
ru_ru: Показать работающие инструменты...

source: Select a program:
ru_ru: Программа:

source: Select a working directory:
ru_ru: Рабочий каталог:

source: Select an icon:
ru_ru: Значок:

source: Invalid plugin name
ru_ru: Недопустимое имя модуля

source: codelite folder does not exists
ru_ru: Папка CodeLite не существует

source: The selected plugin folder does not exist
ru_ru: Выбранная папка модуля не существует

source: Wizards Plugin - a collection of useful wizards for C++: new Class Wizard, new wxWidgets Wizard, new Plugin Wizard
ru_ru: Модуль мастеров — набор полезных мастеров для C++: мастер создания новых классов, мастер создания новых wxWidgets, мастер создания новых модулей

source: Wizards Plugin - a collection of useful utils for C++
ru_ru: Модуль мастеров — набор полезных служебных программ для C++

source: New CodeLite Plugin Wizard...
ru_ru: Мастер создания новых модулей CodeLite...

source: New Class Wizard...
ru_ru: Мастер создания новых классов...

source: Wizards
ru_ru: Мастеры

source: &New Class...
ru_ru: &Новый класс...

source: Failed to load wizard's file 'plugin.cpp.wizard'
ru_ru: Не удалось загрузить файл мастера «plugin.cpp.wizard»

source: Failed to load wizard's file 'plugin.h.wizard'
ru_ru: Не удалось загрузить файл мастера «plugin.h.wizard»

source: New C++ Class
ru_ru: Создать класс C++

source: Plugin name:
ru_ru: Имя модуля:

source: Set the plugin name. The name should be a valid C++ variable name
ru_ru: Введите имя модуля. Имя должно быть допустимым именем переменной C++

source: Description:
ru_ru: Описание:

source: Provide the plugin a short description
ru_ru: Добавьте краткое описание модуля

source: codelite root dir:
ru_ru: Корневой каталог CodeLite:
