Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Break by line, function or memory address:
ru_ru: Прерывание по номеру строки, по функции или по адресу памяти:

source: Line number
ru_ru: Номер строки

source: Enter the line-number on which you wish to break. It's assumed to refer to the current file: if it doesn't, please enter the correct filepath below.
ru_ru: Введите номер строки, на которой вы хотите выполнить прерывание. Предполагается, что он относится к текущему файлу: если это не так, то введите правильный путь к файлу ниже.

source: If you wish to break when a particular function is entered, insert its name here. In C just the name will do e.g. 'main' or 'myFoo'. For C++ class methods, you need to do 'MyClass::myFoo' Alternatively you can enter a regular expression, and tick the checkbox below. A breakpoint will then be set on all matching functions.
ru_ru: Если вы хотите выполнить прерывание при вводе определенной функции, укажите её имя здесь. В языке C достаточно просто имени, например, «main» или «myFoo». Для методов классов C++ необходимо ввести «MyClass:: myFoo» Как вариант, можно ввести регулярное выражение и установить флажок ниже. В этом случае точка останова будет установлена на всех соответствующих функциях.

source: This is a regex
ru_ru: Это — регулярное выражение

source: If you wish to insert a breakpoint on several functions, you can tick this box, then enter a suitable regular expression in the textctrl above.
ru_ru: Если вы хотите установить точку останова на нескольких функциях, вы можете установить этот флажок и ввести подходящее регулярное выражение в поле textctrl выше.

source: Memory address:
ru_ru: Адрес памяти:

source: To break on a memory address, enter the address here. e.g. 0x0a1b2c3d or 12345678
ru_ru: Чтобы выполнить прерывание по адресу памяти, укажите его здесь. Например, 0x0a1b2c3d или 12345678

source: In file:
ru_ru: В файле:

source: If you've entered a line-number, its assumed to refer to the current file. If it isn't, enter the correct filename here. For a function, a file is usually not required. However, if you have several functions with the same name, in several different files (do people _really_ do that?) and you want to break on only one of those, enter the correct filename here.
ru_ru: Если вы ввели номер строки, предполагается, что он относится к текущему файлу. Если это не так, введите корректное имя файла здесь. Для функции обычно не требуется файл. Однако, если у вас есть несколько функций с одинаковыми именами в нескольких различных файлах (люди _действительно_ делают это?) и вы хотите выполнить прерывание только для одной из них, введите корректное имя файла здесь.

source: write only
ru_ru: только для записи

source: read only
ru_ru: только для чтения

source: read-write
ru_ru: для чтения и записи

source: Type of watchpoint:
ru_ru: Тип точки наблюдения:

source: The usual type of watchpoint is 'write-only': that is, it's triggered whenever the target is changed. Alternatively you can choose for it to trigger when the target is read from, or either written to or read from.
ru_ru: Обычный тип точки наблюдения — «только для записи»: то есть она активируется при каждом изменении цели. Как вариант, можно выбрать активацию либо при считывании, либо при записи или считывании цели.

source: Data to watch:
ru_ru: Данные для наблюдения:

source: Identify the data to be watched. It can be one of: 1) Any variable name e.g. 'foo' 2) A memory address, suitably cast e.g.*(int*)0x12345678 will watch an int-sized block starting at this address. Don't include spaces in the expression: gdb can't understand them. 3) A complex expression e.g. a*b + c/d'. The expression can use any operators valid in the program's native language. NB. A watchpoint set on a local variable will automatically be removed when the variable loses scope.
ru_ru: Укажите данные для наблюдения. Это может быть один из следующих вариантов: 1) Любое имя переменной, например «foo» 2) Адрес памяти, переданный соответствующим образом. Например, при указании *(int*)0x12345678 будет выполняться наблюдение за блоком размера, выраженного целым числом, начинающимся с этого адреса. Не включайте пробелы в выражение: GDB не распознаёт их. 3) Сложное выражение, например a*b + c/d'. Выражение может использовать любые операторы, допустимые на родном языке программы. Примечание. Точка наблюдения, установленная на локальной переменной, будет автоматически удалена в случае потери переменной области видимости.

source: Conditional Breaks: Add any condition here
ru_ru: Условные точки останова: добавьте любое условие здесь

source: You can add a condition to any breakpoint or watchpoint. The debugger will then stop only if the condition is met. The condition can be any simple or complex expression in your programming language, providing it returns a bool. However any variables that you use must be in scope. If you've previously set a condition and no longer want it, just clear this textctrl.
ru_ru: Вы можете добавить условие к любой точке останова или точке наблюдения. В таком случае отладчик будет останавливаться только при выполнении условия. Условие может быть любым простым или сложным выражением в вашем языке программирования, если оно возвращает значение bool. Однако переменные, которые вы используете, должны быть в пределах области видимости. Если вы ранее установили условие и больше нет необходимости его выполнять, просто очистите этот TextCtrl.

source: Command List: Add any command(s) here
ru_ru: Список команд: добавьте любую(ые) команду(ы) здесь

source: You can add a list of commands to any breakpoint or watchpoint. When the breakpoint is hit and the program interrupted, those commands will be executed. For example, to print the value of the variable foo and then continue running the program, enter: print foo cont If you've previously entered commands, and no longer want them, just clear this textctrl.
ru_ru: Вы можете добавить список команд к любой точке останова или точке наблюдения. Эти команды будут выполняться после достижения точки останова и прерывания программы. Например, для вывода значения переменной foo и продолжения выполнения программы введите следующее: print foo cont Если вы ранее ввели команды, и больше нет необходимости их выполнять, просто очистите этот TextCtrl.

source: Disable
ru_ru: Отключить

source: If you check this box, the breakpoint (or watchpoint) will still exist, but it won't trigger. If you uncheck it in the future, the breakpoint will work again.
ru_ru: Если вы установите этот флажок, то точка останова (или точка наблюдения) всё ещё будет существовать, но не будет активирована. Если вы снимете флажок в будущем, то точка останова будет снова работать.

source: Make temporary
ru_ru: Сделать временной

source: A temporary breakpoint (or watchpoint) is one that works only once. When it's hit it behaves like any other, except that it's then deleted.
ru_ru: Временная точка останова (или точка наблюдения) — это точка, которая срабатывает только один раз. Такая точка при достижении ведёт себя так же, как и любая другая, за исключением того, что затем удаляется.

source: Ignore count:
ru_ru: Число игнорирований:

source: Enter a count >0 to ignore this breakpoint (or watchpoint) for that number of times. It then behaves as though it is disabled, except that every time it would have triggered, the ignore count decrements. When the count reaches zero, the breakpoint becomes active again.
ru_ru: Введите число > 0, чтобы проигнорировать эту точку останова (или точку наблюдения) указанное число раз. В этом случае она ведёт себя как отключённая, за исключением того, что каждый раз, когда она должна активироваться, уменьшается число игнорирований. Когда это число достигает нуля, точка останова снова активируется.

source: Breakpoint and Watchpoint Properties
ru_ru: Свойства точки останова и точки наблюдения

source: You don't seem to have entered a variable for the watchpoint to watch. Please try again.
ru_ru: Похоже, что вы не ввели переменную для точки наблюдения. Повторите попытку.

source: The breakpoint's line-number is invalid. Please try again.
ru_ru: Недопустимый номер строки точки останова. Повторите попытку.

source: You don't seem to have entered a name for the function. Please try again.
ru_ru: Похоже, что вы не ввели имя для функции. Повторите попытку.

source: Sorry, you can't change a breakpoint to a watchpoint, or vice versa, while the debugger is running
ru_ru: К сожалению, вы не можете изменить точку останова на точку наблюдения или наоборот во время работы отладчика

source: Not possible
ru_ru: Невозможно

source: You can add a condition to any breakpoint. The debugger will then stop only if the condition is met. The condition can be any simple or complex expression in your programming language, providing it returns a bool. However any variables that you use must be in scope. If you've previously set a condition and no longer want it, just clear this textctrl.
ru_ru: Вы можете добавить условие к любой точке останова. В таком случае отладчик будет останавливаться только при выполнении условия. Условие может быть любым простым или сложным выражением в вашем языке программирования, если оно возвращает значение bool. Однако переменные, которые вы используете, должны быть в пределах области видимости. Если вы ранее установили условие и больше нет необходимости его выполнять, просто очистите этот TextCtrl.

source: It is not possible to Add a conditional watchpoint. Create a normal watchpoint first, then Edit it to add the conditon
ru_ru: Невозможно создать условную точку наблюдения. Сначала создайте обычную точку наблюдения, а затем отредактируйте её, чтобы добавить условие

source: At
ru_ru: Адрес в памяти

source: Extras
ru_ru: Дополнительно

source: Ignored
ru_ru: Игнорируемые

source: Memory
ru_ru: Память

source: What
ru_ru: Адрес в исходном файле программы

source: Create a breakpoint or watchpoint
ru_ru: Создать точку останова или точку наблюдения

source: Watchpoint successfully added
ru_ru: Точка наблюдения успешно добавлена

source: Breakpoint successfully added
ru_ru: Точка останова успешно добавлена

source: Breakpoint#
ru_ru: Тип точки останова

source: Temporary conditional breakpoint
ru_ru: Временная условная точка останова

source: Temporary breakpoint
ru_ru: Временная точка останова

source: Conditional breakpoint
ru_ru: Условная точка останова

source: Normal breakpoint
ru_ru: Обычная точка останова

source: (disabled)
ru_ru: (отключена)

source: Ignore-count:
ru_ru: Число игнорирований:

source: Condition:
ru_ru: Условие:

source: Commands:
ru_ru: Команды:

source: Breakpoint
ru_ru: Точка останова

source: Watchpoint
ru_ru: Точка наблюдения

source: %i deleted
ru_ru: %i удалена

source: breakpoints disabled
ru_ru: точки останова отключены

source: breakpoints enabled
ru_ru: точки останова включены

source: Watchpoint creation unsuccessful
ru_ru: Не удалось создать точку наблюдения

source: Breakpoint creation unsuccessful
ru_ru: Не удалось создать точку останова

source: Please enter the new ignore-count
ru_ru: Введите новое число игнорирований

source: Set ignore-count
ru_ru: Задать число игнорирований

source: Properties for watchpoint
ru_ru: Параметры точки наблюдения

source: Properties for breakpoint
ru_ru: Параметры точки останова

source: Select build order for configuration:
ru_ru: Порядок сборки для конфигурации:

source: Projects
ru_ru: Проекты

source: Build Order
ru_ru: Порядок сборки

source: Up
ru_ru: Вверх

source: Down
ru_ru: Вниз

source: Apply
ru_ru: Применить

source: Skip warnings
ru_ru: Пропускать предупреждения

source: When using the menu to jump between errors/warnings, ignore warnings
ru_ru: При использовании меню для перехода к ошибкам или предупреждениям игнорировать предупреждения

source: When build completes, scroll to the first error line
ru_ru: После завершения сборки выполнить прокрутку к первой строке ошибки

source: Marker style:
ru_ru: Стиль маркера:

source: Red arrow
ru_ru: Красная стрелка

source: Annotation box
ru_ru: Поле примечания

source: None
ru_ru: Без маркера

source: Open Workspace Configuration Manager...
ru_ru: Открыть диспетчер конфигурации рабочего пространства…

source: has the read-only attribute set
ru_ru: имеет атрибут «только для чтения»

source: Would you like CodeLite to try and remove it?
ru_ru: Вы хотите, чтобы CodeLite попытался его удалить?

source: Failed to open file
ru_ru: Не удалось открыть файл

source: for write
ru_ru: для записи

source: Save As
ru_ru: Сохранить как

source: Failed to save file
ru_ru: Не удалось сохранить файл

source: Unable to create intermediate file '%s' for writing. File already exists!
ru_ru: Не удалось создать промежуточный файл «%s» для записи. Файл уже существует!

source: Failed to open file '%s' for write
ru_ru: Не удалось открыть файл «%s» для записи

source: Save file failed!
ru_ru: Не удалось сохранить файл!

source: Could not convert the file to the requested encoding
ru_ru: Не удалось преобразовать файл в требуемую кодировку

source: File text conversion failed! Check your file font encoding from Settings | Preferences | Misc | Locale
ru_ru: Не удалось преобразовать текст файла! Проверьте вашу кодировку шрифта файла из меню Настройка | Параметры | Разное | Язык

source: The file
ru_ru: Файл

source: is a read only file, continue?
ru_ru: является файлом, доступным только для чтения. Продолжить?

source: Failed to override read-only file
ru_ru: Не удалось переопределить файл только для чтения

source: Can not find the string '
ru_ru: Не удалось найти строку '

source: Type %i bookmark
ru_ru: Закладка типа %i

source: Bookmarks
ru_ru: Закладки

source: Loading file...
ru_ru: Загрузка файла...

source: Add Bookmark
ru_ru: Добавить закладку

source: Remove Bookmark
ru_ru: Удалить закладку

source: Remove All Bookmarks
ru_ru: Удалить все закладки

source: Add Breakpoint
ru_ru: Добавить точку останова

source: Add a Temporary Breakpoint
ru_ru: Добавить временную точку останова

source: Add a Disabled Breakpoint
ru_ru: Добавить отключённую точку останова

source: Add a Conditional Breakpoint..
ru_ru: Добавить условную точку останова...

source: Remove Breakpoint
ru_ru: Удалить точку останова

source: Ignore Breakpoint
ru_ru: Игнорировать точку останова

source: Disable Breakpoint
ru_ru: Отключить точку останова

source: Enable Breakpoint
ru_ru: Включить точку останова

source: Edit Breakpoint
ru_ru: Изменить точку останова

source: Run to here
ru_ru: Выполнить до текущей позиции

source: Create Conditional Breakpoint
ru_ru: Создать условную точку останова

source: Enter the condition statement
ru_ru: Введите оператор условия

source: Failed to insert breakpoint
ru_ru: Не удалось вставить точку останова

source: Temporary
ru_ru: Временная

source: Disabled
ru_ru: Отключена

source: Conditional
ru_ru: Условная

source: No breakpoint found on this line
ru_ru: На этой строке нет точек останова

source: Breakpoint deletion failed
ru_ru: Не удалось удалить точку останова

source: Breakpoint not deleted
ru_ru: Точка останова не удалена

source: More Watches
ru_ru: Больше наблюдений

source: Add Watch
ru_ru: Добавить наблюдение

source: Run to Caret Line
ru_ru: Выполнить до текущей строки

source: Jump to Caret Line
ru_ru: Перейти к текущей строке

source: Watch
ru_ru: Наблюдать

source: as
ru_ru: как

source: Found and selected
ru_ru: Найдено и выбрано совпадений:

source: Failed to reload remote file:
ru_ru: Не удалось перезагрузить удалённый файл:

source: Ask me for each file
ru_ru: Спрашивать для каждого файла

source: Save all files
ru_ru: Сохранить все файлы

source: Discard changes for all files
ru_ru: Отменить изменения для всех файлов

source: Some of the files are modified, what action should CodeLite take?
ru_ru: Некоторые файлы изменены, какие действия следует предпринять CodeLite?

source: Close All
ru_ru: Закрыть все

source: Switch:
ru_ru: Переключатель:

source: Help:
ru_ru: Справка:

source: Regex Pattern:
ru_ru: Образец регулярного выражения:

source: Compiler regular expression
ru_ru: Регулярное выражение компилятора

source: File Index in Pattern:
ru_ru: Индекс файла в образце:

source: The capture index in the regex that holds the file path
ru_ru: Индекс считывания в регулярном выражении, который содержит путь к файлу

source: Line Number in Pattern:
ru_ru: Номер строки в образце:

source: The capture index in the regex that holds the line number
ru_ru: Индекс считывания в регулярном выражении, который содержит номер строки

source: Column Index in Pattern:
ru_ru: Индекс столбца в образце:

source: The capture index in the regex that holds the column number
ru_ru: Индекс считывания в регулярном выражении, который содержит номер столбца

source: New compiler name:
ru_ru: Имя нового компилятора:

source: Copy settings from:
ru_ru: Копировать параметры из:

source: C++ Compiler
ru_ru: Компилятор C++

source: The C++ compiler path (plus optional flags). This tool is represented in the Makefile as $(CXX)
ru_ru: Путь к компилятору C++ (плюс необязательные флаги). Этот инструмент представлен в Makefile как $(CXX)

source: C Compiler
ru_ru: Компилятор C

source: The C compiler path (plus optional flags). This tool is represented in the Makefile as $(CC)
ru_ru: Путь к компилятору C (плюс необязательные флаги). Этот инструмент представлен в Makefile как $(CC)

source: Assembler Name
ru_ru: Имя ассемблера

source: The assembler tool path. This tool is referred in the Makefile as $(AS)
ru_ru: Путь к ассемблеру. Этот инструмент упоминается в Makefile как $(AS)

source: Linker
ru_ru: Компоновщик

source: The linker tool. Usually similar to the 'C++ Compiler' tool path
ru_ru: Компоновщик. Обычно имеет путь, аналогичный пути к компилятору C++

source: Shared Object Linker
ru_ru: Общий компоновщик объектов

source: The tool to create shared objects
ru_ru: Инструмент для создания общих объектов

source: Archive
ru_ru: Архив

source: The static archive tool "ar". This tool is referred in the Makefile as $(AR)
ru_ru: Статический архиватор «ar». Этот инструмент упоминается в Makefile как $(AR)

source: Resource Compiler
ru_ru: Компилятор ресурсов

source: The resource compiler. (Windows only)
ru_ru: Компилятор ресурсов. (Только Windows)

source: The Make tool. on Windows / MinGW this is usually mingw32-make.exe while on other OSs its simply 'make'
ru_ru: Инструмент Make. На Windows / MinGW это обычно mingw32-make.exe, в то время как на других ОС — просто «make»

source: Set the 'mkdir' for your OS. Leave it empty to use the default for your OS
ru_ru: Установите «mkdir» для своей ОС. Оставьте поле пустым, чтобы использовать значение по умолчанию для своей ОС

source: On various platform (e.g. Cygwin) it is recommended to use their own special gdb executable rather than the global one You can specify one here, or leave this empty to use the default
ru_ru: На другой платформе (например, Cygwin) рекомендуется использовать их собственный специальный исполняемый файл GDB, а не глобальный. Вы можете указать его здесь или оставить поле пустым, чтобы использовать значение по умолчанию

source: Patterns
ru_ru: Образцы

source: Compiler Errors Patterns:
ru_ru: Образцы ошибок компилятора:

source: Add
ru_ru: Добавить

source: Add new error pattern
ru_ru: Добавить новый образец ошибки

source: Delete the selected error pattern
ru_ru: Удалить выбранный образец ошибки

source: Edit the selected error pattern
ru_ru: Изменить выбранный образец ошибки

source: Compiler Warnings Patterns:
ru_ru: Образцы предупреждений компилятора:

source: Add new warning pattern
ru_ru: Добавить новый образец предупреждения

source: Delete the selected warning pattern
ru_ru: Удалить выбранный образец предупреждения

source: Edit the selected warning pattern
ru_ru: Изменить выбранный образец предупреждения

source: Compiler Options
ru_ru: Параметры компилятора

source: Double click on an entry to modify it:
ru_ru: Дважды щёлкните по записи, чтобы изменить её:

source: Linker Options
ru_ru: Параметры компоновщика

source: Templates
ru_ru: Шаблоны

source: Define the compilation line per file type
ru_ru: Определить строку компиляции для каждого типа файла

source: Extension
ru_ru: Расширение

source: Template
ru_ru: Шаблон

source: Add new file type
ru_ru: Добавить новый тип файла

source: Defines the linker command per project type
ru_ru: Определяет команду компоновщика для каждого типа проекта

source: Project Type
ru_ru: Тип проекта

source: Pass object list to the linker via file
ru_ru: Передать список объектов компоновщику через файл

source: Switches
ru_ru: Переключатели

source: Global Paths
ru_ru: Глобальные пути

source: Include Path:
ru_ru: Путь к включаемым файлам:

source: Set here an additional include paths. Each path should be separated with a semi-colon Note that usually you don't need to modify this field and it should be left empty
ru_ru: Укажите здесь дополнительные пути к включаемым файлам. Каждый путь должен отделяться точкой с запятой Обратите внимание на то, что обычно не требуется вносить изменения в это поле и его следует оставить пустым

source: Libraries Path:
ru_ru: Путь к библиотекам:

source: Set here an additional library search paths. Each path should be separated with a semi-colon Note that usually you don't need to modify this field and it should be left empty
ru_ru: Укажите здесь дополнительные пути поиска библиотек. Каждый путь должен отделяться точкой с запятой Обратите внимание на то, что обычно не требуется вносить изменения в это поле и его следует оставить пустым

source: Misc
ru_ru: Разное

source: Objects extension:
ru_ru: Расширение объектов:

source: Depends extension:
ru_ru: Расширение зависимостей:

source: Preprocessed extension:
ru_ru: Предобработанное расширение:

source: Generate dependencies files (*.o.d)
ru_ru: Создать файлы зависимостей (*.o.d)

source: Object name is same as the file name
ru_ru: Имя объекта совпадает с именем файла

source: By default, codelite will prepend the relative directory to the file name to compose an object name (e.g. src/a.cpp will generate object: src_a.o). Uncheck this option to make the object name exactly as the file name without any prefixes
ru_ru: По умолчанию СodeLite будет добавлять соответствующий каталог перед именем файла, чтобы составить имя объекта (например, src/a.cpp создаст объект src_a.o). Снимите этот флажок, чтобы имя объекта было точно таким же, как имя файла без префиксов

source: File extension:
ru_ru: Расширение файлов:

source: Resource
ru_ru: Ресурс

source: Pattern:
ru_ru: Образец:

source: New Compiler
ru_ru: Новый компилятор

source: Edit Compiler Template
ru_ru: Изменить шаблон компилятора

source: New File Type Template
ru_ru: Создать шаблон типа файла

source: Settings for workspace configuration '%s' have changed, would you like to save them?
ru_ru: Параметры конфигурации рабочего пространства «%s» изменились, вы хотите сохранить их?

source: Enter New Configuration Name:
ru_ru: Имя новой конфигурации:

source: New Configuration
ru_ru: Новая конфигурация

source: Open Include File "
ru_ru: Открыть включаемый файл "

source: Add Forward Declaration for "
ru_ru: Добавить опережающее объявление для "

source: Add Include File for "
ru_ru: Добавить включаемый файл для "

source: Multiple candidates found. Select a file to open:
ru_ru: Найдено несколько вариантов. Выберите файл для открытия:

source: Swap Header/Source Implementation
ru_ru: Переключение между заголовочным файлом и файлом реализации

source: No matched file was found, would you like to create one?
ru_ru: Ни одного подходящего файла не найдено, вы хотите создать его?

source: Create
ru_ru: Создать

source: Don't Create
ru_ru: Не создавать

source: Remember my answer and don't ask me again
ru_ru: Запомнить ответ и не спрашивать снова

source: Seems like you have all the getters/setters you need...
ru_ru: Похоже, что у вас есть все необходимые методы считывания и присваивания...
