Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: The name for the inherited class's files (without any file extension). wxCrafter will generate a $(FILE).cpp and $(FILE).hpp e.g. for an inherited class 'FooDialog', you might enter 'foodialog' here.
ru_ru: Имя для файлов унаследованного класса (без расширения файла). wxCrafter создаст $(FILE).cpp и $(FILE).hpp Например, для унаследованного класса «FooDialog» здесь можно ввести «foodialog».

source: MSW Only C++ macro decorator - allows exporting this class from a DLL
ru_ru: Только для Microsoft Windows. Макродекоратор C++ — позволяет выполнить экспорт этого класса из библиотеки DLL

source: The generated C++ class name
ru_ru: Имя создаваемого класса C++

source: You did not set the 'Inherited C++ Class Properties -> File name' property for the top level window: '
ru_ru: Вы не установили свойство «Свойства унаследованного класса C++ -> Имя файла» для окна верхнего уровня: '

source: This means that only base class code will be generated To fix this, select the toplevel entry from the tree-view and provide an Inherited class name and file name
ru_ru: Это означает, что будет сгенерирован только код базового класса. Чтобы исправить это, выберите запись верхнего уровня в древовидном представлении и укажите имя унаследованного класса и имя файла

source: OK, continue with code generation
ru_ru: ОК, продолжить генерацию кода

source: Don't show this message again
ru_ru: Не показывать это сообщение снова

source: Can not generate code. Make sure that all toplevel windows have a valid C++ class name
ru_ru: Не удалось сгенерировать код. Убедитесь, что все окна верхнего уровня имеют допустимое имя класса C++

source: Base class and inherited class have the same name
ru_ru: Базовый класс и унаследованный класс имеют одинаковое имя

source: The page node is going to be collapsed
ru_ru: Узел страницы будет свёрнут

source: The page node is going to be expanded
ru_ru: Узел страницы будет развёрнут

source: wxTreeListCtrl Column
ru_ru: Столбец wxTreeListCtrl

source: Alignment of both the column header and its items
ru_ru: Выравнивание как заголовка столбца, так и его элементов

source: The width of the column in pixels or the special wxCOL_WIDTH_AUTOSIZE(-2) value indicating that the column should adjust to its contents. Notice that the first column is special and will be always resized to fill all the space not taken by the other columns, i.e. the width specified here is ignored for it
ru_ru: Ширина столбца в пикселях или специальное значение wxCOL_WIDTH_AUTOSIZE(-2),указывающее на то, что столбец должен подгоняться под его содержимое. Обратите внимание, что первый столбец отличается от остальных; он будет всегда меняться в размере, заполняя пространство, не занятое другими столбцами, поэтому для него не будет учитываться указанная здесь ширина

source: Column flags, currently can include wxCOL_RESIZABLE to allow the user to resize the column and wxCOL_SORTABLE to allow the user to resort the control contents by clicking on this column
ru_ru: Флаги столбца, в настоящий момент могут включать wxCOL_RESIZABLE, что позволяет пользователю изменять размер столбца, и wxCOL_SORTABLE, что позволяет пользователю выполнять пересортировку содержимого элемента управления, щёлкая по этому столбцу

source: Process wxEVT_TREELIST_SELECTION_CHANGED event and notifies about the selection change in the control. In the single selection case the item indicated by the event has been selected and previously selected item, if any, was deselected. In multiple selection case, the selection of this item has just changed (it may have been either selected or deselected) but notice that the selection of other items could have changed as well, use wxTreeListCtrl::GetSelections() to retrieve the new selection if necessary.
ru_ru: Обрабатывать событие wxEVT_TREELIST_SELECTION_CHANGED, уведомляющее об изменении выбора в элементе управления. В случае выбора одного элемента элемент, на который указывает событие, был выбран, а предыдущий выбор, если таковой был, был отменён. В случае выбора нескольких элементов выбор этого элемента только что изменился (либо элемент был выбран, либо его выбор был отменён), но обратите внимание, что выбор других элементов также мог измениться. Используйте wxTreeListCtrl::GetSelections() для получения нового выбора, если это необходимо.

source: Process wxEVT_TREELIST_ITEM_EXPANDING event notifying about the given branch being expanded. This event is sent before the expansion occurs and can be vetoed to prevent it from happening.
ru_ru: Обрабатывать событие wxEVT_TREELIST_ITEM_EXPANDING, уведомляющее о о развёртывании указанной ветви. Это событие отправляется перед развёртыванием и его можно запретить.

source: Process wxEVT_TREELIST_ITEM_EXPANDED event notifying about the expansion of the given branch. This event is sent after the expansion occurs and can't be vetoed.
ru_ru: Обрабатывать событие wxEVT_TREELIST_ITEM_EXPANDED, уведомляющее о развёртывании указанной ветви. Это событие отправляется после развёртывания и его невозможно запретить.

source: Process wxEVT_TREELIST_ITEM_CHECKED event notifying about the user checking or unchecking the item. You can use wxTreeListCtrl::GetCheckedState() to retrieve the new item state and wxTreeListEvent::GetOldCheckedState() to get the previous one.
ru_ru: Обрабатывать событие wxEVT_TREELIST_ITEM_CHECKED, уведомляющее об установке флажка для элемента или его снятии. Можно использовать wxTreeListCtrl::GetCheckedState() для получения нового состояния элемента и wxTreeListEvent::GetOldCheckedState() — для получения предыдущего.

source: Process wxEVT_TREELIST_ITEM_ACTIVATED event notifying about the user double clicking the item or activating it from keyboard.
ru_ru: Обрабатывать событие wxEVT_TREELIST_ITEM_ACTIVATED, уведомляющее о выполнении пользователем двойного щелчка по элементу или его активации с помощью клавиатуры.

source: Process wxEVT_TREELIST_ITEM_CONTEXT_MENU event indicating that the popup menu for the given item should be displayed.
ru_ru: Обрабатывать событие wxEVT_TREELIST_ITEM_CONTEXT_MENU, указывающее на необходимость отображения всплывающего меню для указанного элемента.

source: Process wxEVT_TREELIST_COLUMN_SORTED event indicating that the control contents has just been resorted using the specified column. The event doesn't carry the sort direction, use GetSortColumn() method if you need to know it.
ru_ru: Обрабатывать событие wxEVT_TREELIST_COLUMN_SORTED, указывающее на то, что содержимое элемента управления только что было пересортировано с использованием указанного столбца. Событие не указывает направление сортировки; используйте метод GetSortColumn(), если вам требуется знать его.

source: Process a wxEVT_COMMAND_WEBVIEW_NAVIGATING event, generated before trying to get a resource. This event may be vetoed to prevent navigating to this resource. Note that if the displayed HTML document has several frames, one such event will be generated per frame
ru_ru: Обрабатывать событие wxEVT_COMMAND_WEBVIEW_NAVIGATING, создаваемое перед попыткой получить ресурс. Это событие можно запретить для предотвращения перехода к этому ресурсу. Обратите внимание, что если в отображаемом HTML-документе имеется несколько фреймов, для каждого из них будет создано одно такое событие.

source: Process a wxEVT_COMMAND_WEBVIEW_NAVIGATED event generated after it was confirmed that a resource would be requested. This event may not be vetoed. Note that if the displayed HTML document has several frames, one such event will be generated per frame.
ru_ru: Обрабатывать событие wxEVT_COMMAND_WEBVIEW_NAVIGATED, создаваемое после подтверждения того, что ресурс будет запрошен. Это событие невозможно запретить. Обратите внимание, что если в отображаемом HTML-документе имеется несколько фреймов, для каждого из них будет создано одно такое событие.

source: Process a wxEVT_COMMAND_WEBVIEW_LOADED event generated when the document is fully loaded and displayed. Note that if the displayed HTML document has several frames, one such event will be generated per frame.
ru_ru: Обрабатывать событие wxEVT_COMMAND_WEBVIEW_LOADED, создаваемое после полной загрузки и отображения документа. Обратите внимание, что если в отображаемом HTML-документе имеется несколько фреймов, для каждого из них будет создано одно такое событие.

source: Process a wxEVT_COMMAND_WEBVIEW_ERROR event generated when a navigation error occurs. The integer associated with this event will be a wxWebNavigationError item. The string associated with this event may contain a backend-specific more precise error message/code
ru_ru: Обрабатывать событие wxEVT_COMMAND_WEBVIEW_ERROR, создаваемое при возникновении ошибки навигации. Целое число, связанное с этим событием, будет представлять собой элемент wxWebNavigationError. Строка, связанная с этим событием, может содержать более точное сообщение об ошибке или код ошибки, относящиеся к серверной части.

source: Process a wxEVT_COMMAND_WEBVIEW_NEWWINDOW event, generated when a new window is created. You must handle this event if you want anything to happen, for example to load the page in a new window or tab.
ru_ru: Обрабатывать событие wxEVT_COMMAND_WEBVIEW_NEWWINDOW event, создаваемое при создании нового окна. Вам следует обработать это событие, если необходимо выполнить какое-либо действие, например, загрузить страницу в новом окне или вкладке.

source: Process a wxEVT_COMMAND_WEBVIEW_TITLE_CHANGED event, generated when the page title changes. Use GetString to get the title.
ru_ru: Обрабатывать событие wxEVT_COMMAND_WEBVIEW_TITLE_CHANGED, создаваемое при изменении заголовка страницы. Используйте GetString для получения заголовка.

source: URL to load by default in the web view. Note that the designer will display about:blank. The preview and generated code will use the actual URL
ru_ru: URL-адрес для загрузки в веб-представлении. Обратите внимание, что в конструкторе отобразится about:blank. В предварительном просмотре и создаваемом коде будет использоваться фактический URL-адрес

source: The page-specific bitmap if different from the global one
ru_ru: Значок страницы, если отличается от глобального

source: Sizer orientation
ru_ru: Ориентация сайзера

source: Number of columns in the grid
ru_ru: Количество столбцов в сетке

source: Number of rows in the grid
ru_ru: Количество строк в сетке

source: Which columns are allowed to grow. Comma separated list
ru_ru: Разделённый запятыми список столбцов, увеличение которых допускается

source: Which rows are allowed to grow. Comma separated list
ru_ru: Разделённый запятыми список строк, увеличение которых допускается

source: The horizontal gap between grid cells
ru_ru: Горизонтальный просвет между ячейками сетки

source: The vertical gap between grid cells
ru_ru: Вертикальный просвет между ячейками сетки

source: When enabled, this sizer is kept as a class member and become accessible
ru_ru: Если включено, этот сайзер остаётся членом класса и становится доступным

source: Initial State
ru_ru: Начальное состояние

source: Standard wxButton
ru_ru: Стандартный wxButton

source: Button ID
ru_ru: Идентификатор кнопки

source: Tooltip text:
ru_ru: Текст подсказки:

source: Select bitmap
ru_ru: Выбрать значок

source: Invalid C++ class name provided!
ru_ru: Указано недопустимое имя класса C++!

source: Please set an include file for this control
ru_ru: Укажите включаемый файл для этого элемента управления

source: Control instantiation code is missing
ru_ru: Отсутствует код создания экземпляра элемента управления

source: Are you sure you want to delete the following custom controls:
ru_ru: Вы действительно хотите удалить следующие пользовательские элементы управления:

source: Showing events for -
ru_ru: Показаны события для:

source: Sample Text
ru_ru: Пример текста

source: You must create a project before you can add new forms
ru_ru: Вам необходимо создать проект перед добавлением новых форм

source: Please enter a file name
ru_ru: Введите имя файла

source: Please enter a class name
ru_ru: Введите имя класса

source: Please select a virtual folder for the generated code
ru_ru: Выберите виртуальную папку для создаваемого кода

source: Enter the new wxCrafter file a name (full path):
ru_ru: Введите имя нового файла wxCrafter (полный путь):

source: Select wxCrafter file
ru_ru: Выбрать файл wxCrafter

source: New wxFrame
ru_ru: Создать wxFrame

source: New wxDialog
ru_ru: Создать wxDialog

source: New wxWizard
ru_ru: Создать wxWizard

source: New wxPanel
ru_ru: Создать wxPanel

source: New wxImageList
ru_ru: Создать wxImageList

source: New wxPopupWindow
ru_ru: Создать wxPopupWindow

source: Add wxPGProperty
ru_ru: Добавить wxPGProperty

source: Add wxPGProperty Child
ru_ru: Добавить дочерний элемент wxPGProperty

source: Add Button
ru_ru: Добавить кнопку

source: Add Bitmap
ru_ru: Добавить значок

source: Add Column
ru_ru: Добавить столбец

source: Add Row
ru_ru: Добавить строку

source: Add Pane
ru_ru: Добавить область

source: Add Tool
ru_ru: Добавить инструмент

source: Add Control
ru_ru: Добавить элемент управления

source: Add Label
ru_ru: Добавить метку

source: Add Spacer
ru_ru: Добавить разделитель

source: Add Stretch Spacer
ru_ru: Добавить растягиваемый разделитель

source: Add Separator
ru_ru: Добавить разделитель

source: Add wxMenu
ru_ru: Добавить wxMenu

source: Add Menu Item
ru_ru: Добавить пункт меню

source: Add Sub Menu
ru_ru: Добавить подменю

source: Add Form
ru_ru: Добавить форму

source: Add Page
ru_ru: Добавить страницу

source: Add Sizer
ru_ru: Добавить сайзер

source: Insert into new Sizer
ru_ru: Вставить в новый сайзер

source: Change wxSizer Type
ru_ru: Изменить тип wxSizer

source: Add wxAuiManager
ru_ru: Добавить wxAuiManager

source: Add Container
ru_ru: Добавить контейнер

source: Add wxRibbonPage
ru_ru: Добавить wxRibbonPage

source: Add wxRibbonPanel
ru_ru: Добавить wxRibbonPanel

source: Add wxRibbonButtonBar
ru_ru: Добавить wxRibbonButtonBar

source: Add wxRibbonToolBar
ru_ru: Добавить wxRibbonToolBar

source: Add wxRibbonGallery
ru_ru: Добавить wxRibbonGallery

source: Add Dropdown Button
ru_ru: Добавить кнопку раскрывающегося списка

source: Add Hybrid Button
ru_ru: Добавить гибридную кнопку

source: Add Toggle Button
ru_ru: Добавить кнопку включения/отключения

source: Add Dropdown Tool
ru_ru: Добавить инструмент раскрывающегося списка

source: Add Hybrid Tool
ru_ru: Добавить гибридный инструмент

source: Add Toggle Tool
ru_ru: Добавить инструмент включения/отключения

source: Add Gallery Item
ru_ru: Добавить элемент коллекции

source: Add Notebook Page
ru_ru: Добавить страницу блокнота

source: Add Sub Page
ru_ru: Добавить подстраницу

source: Add Panel
ru_ru: Добавить панель

source: Add List Column
ru_ru: Добавить столбец списка

source: Generate code...
ru_ru: Создать код…

source: Add wxTimer
ru_ru: Добавить wxTimer

source: Add wxTaskBarIcon
ru_ru: Добавить wxTaskBarIcon

source: Move Left into Higher Sizer
ru_ru: Переместить влево в сайзер верхнего уровня

source: Move Right into Sibling Sizer
ru_ru: Переместить вправо в сайзер того же уровня

source: Duplicate
ru_ru: Дублировать

source: This item can be placed either as a sibling or as a child of the target widget Where should wxCrafter position this widget?
ru_ru: Этот элемент может быть размещён как элемент того же уровня или дочерний элемент целевого виджета. Где wxCrafter следует разместить этот виджет?

source: As a Child
ru_ru: Как дочерний элемент

source: As a Sibling
ru_ru: Как элемент того же уровня

source: Process a wxEVT_KEY_DOWN event (any key has been pressed)
ru_ru: Обрабатывать событие wxEVT_KEY_DOWN (была нажата любая клавиша).

source: Process a wxEVT_KEY_UP event (any key has been released)
ru_ru: Обрабатывать событие wxEVT_KEY_UP (была отпущена любая клавиша).

source: Process a wxEVT_CHAR event
ru_ru: Обрабатывать событие wxEVT_CHAR.

source: A right click (or other context menu command depending on platform) has been detected
ru_ru: Обнаружен щелчок правой кнопкой мыши (или другая команда вызова контекстного меню, зависящая от платформы)

source: Process a wxEVT_LEFT_DOWN event. The handler of this event should normally call event.Skip() to allow the default processing to take place as otherwise the window under mouse wouldn't get the focus.
ru_ru: Обрабатывать событие wxEVT_LEFT_DOWN. Обработчик этого события обычно должен вызвать event.Skip() для выполнения обработки по умолчанию, поскольку в противном случае окно под указателем мыши не получит фокус.

source: Process a wxEVT_LEFT_UP event.
ru_ru: Обрабатывать событие wxEVT_LEFT_UP.

source: Process a wxEVT_LEFT_DCLICK event.
ru_ru: Обрабатывать событие wxEVT_LEFT_DCLICK.

source: Process a wxEVT_MIDDLE_DOWN event
ru_ru: Обрабатывать событие wxEVT_MIDDLE_DOWN.

source: Process a wxEVT_MIDDLE_UP event
ru_ru: Обрабатывать событие wxEVT_MIDDLE_UP.

source: Process a wxEVT_MIDDLE_DCLICK event.
ru_ru: Обрабатывать событие wxEVT_MIDDLE_DCLICK.

source: Process a wxEVT_RIGHT_DOWN event
ru_ru: Обрабатывать событие wxEVT_RIGHT_DOWN.

source: Process a wxEVT_RIGHT_UP event
ru_ru: Обрабатывать событие wxEVT_RIGHT_UP.

source: Process a wxEVT_RIGHT_DCLICK event
ru_ru: Обрабатывать событие wxEVT_RIGHT_DCLICK.

source: Process a wxEVT_MOTION event
ru_ru: Обрабатывать событие wxEVT_MOTION.

source: Process a wxEVT_ENTER_WINDOW event
ru_ru: Обрабатывать событие wxEVT_ENTER_WINDOW.

source: Process a wxEVT_LEAVE_WINDOW event.
ru_ru: Обрабатывать событие wxEVT_LEAVE_WINDOW.

source: Process a wxEVT_MOUSEWHEEL event
ru_ru: Обрабатывать событие wxEVT_MOUSEWHEEL.

source: Process a wxEVT_SET_FOCUS event
ru_ru: Обрабатывать событие wxEVT_SET_FOCUS.

source: Process a wxEVT_KILL_FOCUS event
ru_ru: Обрабатывать событие wxEVT_KILL_FOCUS.

source: Process a wxEVT_PAINT event
ru_ru: Обрабатывать событие wxEVT_PAINT.

source: Process a wxEVT_ERASE_BACKGROUND event.
ru_ru: Обрабатывать событие wxEVT_ERASE_BACKGROUND.

source: Process a wxEVT_SIZE event
ru_ru: Обрабатывать событие wxEVT_SIZE.

source: Process a wxEVT_MOVE event, which is generated when a window is moved.
ru_ru: Обрабатывать событие wxEVT_MOVE, создаваемое при перемещении окна.

source: Process a wxEVT_UPDATE_UI event
ru_ru: Обрабатывать событие wxEVT_UPDATE_UI.

source: Process a wxEVT_IDLE event
ru_ru: Обрабатывать событие wxEVT_IDLE.

source: Event Handlers
ru_ru: Обработчики событий

source: Open Ctrl-O
ru_ru: Открыть Ctrl-O

source: &Save Ctrl-S
ru_ru: &Сохранить Ctrl-S

source: Generate Code Ctrl-G
ru_ru: Создать код Ctrl-G

source: Batch Generate Code... Ctrl-Shift-G
ru_ru: Пакетное создание кода... Ctrl-Shift-G

source: Hide the designer
ru_ru: Скрыть конструктор

source: Show &Preview F5
ru_ru: Предварительный &просмотр F5

source: Delete DEL
ru_ru: Удалить DEL

source: Copy Ctrl-C
ru_ru: Копировать Ctrl-C

source: Paste Ctrl-V
ru_ru: Вставить Ctrl-V

source: Cut Ctrl-X
ru_ru: Вырезать Ctrl-X

source: Undo Ctrl-Z
ru_ru: Отменить Ctrl-Z

source: Redo Ctrl-Y
ru_ru: Повторить Ctrl-Y

source: Set label for current state
ru_ru: Установить метку для текущего состояния

source: Rename F2
ru_ru: Переименовать F2

source: Rename item
ru_ru: Переименовать элемент

source: Find... Ctrl-F
ru_ru: Найти... Ctrl-F

source: Build Active Project F7
ru_ru: Сборка активного проекта F7

source: &Import
ru_ru: &Импорт

source: Import wx&FormBuilder Project
ru_ru: Импорт проекта wx&FormBuilder

source: Import wx&Smith File
ru_ru: Импорт файла wx&Smith

source: Import &XRC File
ru_ru: Импорт файла &XRC

source: Custom Controls
ru_ru: Пользовательские элементы управления

source: New Custom Control...
ru_ru: Создать пользовательский элемент управления...

source: Edit Custom Control...
ru_ru: Изменить пользовательский элемент управления...

source: Delete Custom Control
ru_ru: Удалить пользовательский элемент управления

source: &Help
ru_ru: &Справка

source: Designer
ru_ru: Конструктор

source: Header
ru_ru: Заголовок

source: Properties
ru_ru: Свойства

source: Sizer Flags
ru_ru: Флаги сайзера

source: <Default>
ru_ru: <По умолчанию>

source: Select a standard color from the list below
ru_ru: Выберите стандартный цвет из списка ниже

source: Custom Colour...
ru_ru: Пользовательский цвет...

source: Select custom color...
ru_ru: Выберите пользовательский цвет...

source: Close button minimizes wxCrafter to the tray
ru_ru: Кнопка «Закрыть» сворачивает wxCrafter на панель задач

source: Code Generation:
ru_ru: Создание кода:

source: Format inherited files
ru_ru: Форматировать унаследованные файлы

source: When e.g. a new eventhandler is added, wxCrafter helpfully adds an empty handler to the derived class as well as to the generated base-class. If this box is ticked, the whole of the inherited header and implementation files will be formatted each time this is done.
ru_ru: Когда, например, добавляется новый обработчик событий, wxCrafter добавляет пустой обработчик в производный класс, а также в создаваемый базовый класс. Если этот флажок установлен, то каждый раз будут форматироваться все унаследованные заголовочные файлы и файлы реализации.

source: Duplicating and Pasting:
ru_ru: Дублирование и вставка:

source: What should happen when duplicating or pasting a top-level window, or pasting some contents from one top-level window to another?
ru_ru: Что должно произойти при дублировании или вставке окна верхнего уровня или вставке содержимого из одного окна верхнего уровня в другое?

source: Leave unchanged any user-set names of child controls
ru_ru: Оставлять без изменений заданные пользователем имена дочерних элементов управления

source: You can't have two top-level windows with the same name, but you can have FooBase::m_textEntry and BarBase::m_textEntry. Tick this box if you want to keep such names the same, convenient if you already have Foo code that references them that you want to copy to Bar; but you don't need to keep autogenerated names like m_text153.
ru_ru: Не допускается наличие двух окон верхнего уровня с одинаковым именем, но допускается использовать FooBase::m_textEntry и BarBase::m_textEntry. Установите этот флажок, если вам необходимо оставлять такие имена без изменений, что удобно, если у вас уже есть ссылающийся на них код Foo, который вам нужно скопировать в Bar; но нет необходимости оставлять сгенерированные автоматически имена, такие как m_text153.

source: Leave unchanged the names of all child controls
ru_ru: Оставлять без изменений имена всех дочерних элементов управления

source: You can't have two top-level windows with the same name, but you can have FooBase::m_text123 and BarBase::m_text123. Tick this box if you want to keep such names the same; convenient if you already have Foo code that references them that you want to copy to Bar.
ru_ru: Не допускается наличие двух окон верхнего уровня с одинаковым именем, но допускается использовать FooBase::m_text123 and BarBase::m_text123. Установите этот флажок, если вам необходимо оставлять такие имена без изменений, что удобно, если у вас уже есть ссылающийся на них код Foo, который вам нужно скопировать в Bar.

source: Copy any event-handlers too
ru_ru: Также копировать обработчики событий

source: If the class that you're duplicating has e.g. a wxTextCtrl with a wxEVT_COMMAND_TEXT_ENTER event-handler set, if this box is ticked the textctrl in duplicate class will also have that event-handler.
ru_ru: Если в дублируемом классе есть, например, wxTextCtrl с установленным обработчиком событий wxEVT_COMMAND_TEXT_ENTER, то при установке этого флажка у textctrl в дублируемом классе также будет этот обработчик событий.

source: Enter Text
ru_ru: Введите текст

source: Select Color
ru_ru: Выбрать цвет

source: Select Colour...
ru_ru: Выбрать цвет...

source: wxCrafter Settings
ru_ru: Параметры wxCrafter

source: Choose a wxFormBuilder project to import
ru_ru: Выбрать проект wxFormBuilder для импорта

source: Choose a wxSmith project to import
ru_ru: Выбрать проект wxSmith для импорта
