Repository: eranif/codelite
Catalog: translations/*/LC_MESSAGES/*.po
Languages: ru_ru

source: Import a wxFormBuilder project
ru_ru: Импорт проекта wxFormBuilder

source: Import a wxSmith project
ru_ru: Импорт проекта wxSmith

source: Import an XRC file
ru_ru: Импорт файла XRC

source: Failed to load the file to import
ru_ru: Не удалось загрузить файл для импорта

source: This doesn't seem to be a valid wxFormBuilder project file. Aborting.
ru_ru: Похоже, что этот файл не является допустимым файлом wxFormBuilder. Прерывание.

source: Can't import unknown class %s from wxFB
ru_ru: Не удалось импортировать неизвестный класс %s из wxFB

source: This doesn't seem to be a valid wxSmith file. Aborting.
ru_ru: Похоже, что этот файл не является допустимым файлом wxSmith. Прерывание.

source: Can't import unknown class %s in from wxSmith
ru_ru: Не удалось импортировать неизвестный класс %s из wxSmith

source: This doesn't seem to be a valid XRC file. Aborting.
ru_ru: Похоже, что этот файл не является допустимым файлом XRC. Прерывание.

source: Can't import unknown class %s from XRC
ru_ru: Не удалось импортировать неизвестный класс %s из XRC

source: Back to CodeLite
ru_ru: Вернуться к CodeLite

source: Generate Code
ru_ru: Создать код

source: Create an empty wxCrafter project
ru_ru: Создать пустой проект wxCrafter

source: Could not create resource file '
ru_ru: Не удалось создать файл ресурсов '

source: Open a wxCrafter file
ru_ru: Открыть файл wxCrafter

source: wxCrafter Project Settings
ru_ru: Параметры проекта wxCrafter

source: Output Directory
ru_ru: Выходной каталог

source: The generated files' output directory
ru_ru: Выходной каталог создаваемых файлов

source: The generated files' name. wxCrafter will generate a $(FILE).cpp and $(FILE).hpp
ru_ru: Имя создаваемых файлов. wxCrafter создаст $(FILE).cpp и $(FILE).hpp

source: Additional Include Files
ru_ru: Дополнительные включаемые файлы

source: List of additional include files that should be included in the generated files e.g. my_header.hpp ; string.h
ru_ru: Список дополнительных файлов, включаемых в создаваемые файлы. Например, my_header.hpp; string.h

source: Bitmap Files
ru_ru: Файлы значков

source: Set here the file name for the bitmaps wxCrafter converts all the bitmaps in the project into C++ code and will place them in this file
ru_ru: Укажите здесь имя файла для значков. wxCrafter преобразует все значки в проекте в код C++ и поместит их в этот файл

source: wxWindow ID Generation
ru_ru: Создание идентификатора wxWindow

source: Generate Window ID
ru_ru: Создавать идентификатор окна

source: Auto generate enum in the base class for the wxWindow IDs which are not a stock window ID nor wrapped with the XRCID macro When left unchecked it is up to the user to provide a header file with the wxWindow IDs
ru_ru: Автоматически создавать перечисление в базовом классе для идентификаторов wxWindow, которые не являются стандартными идентификаторами окна и не обёрнуты в макрос XRCID. Если флажок не установлен, то пользователь должен сам указать заголовочный файл с идентификаторами wxWindow

source: First Window ID
ru_ru: Первый идентификатор окна

source: When 'Generate Window ID' is checked, use this as the first enumerator value
ru_ru: Если флажок «Создавать идентификатор окна» установлен, этот идентификатор будет использоваться в качестве первого значения перечислителя

source: Generate Translatable Strings
ru_ru: Создавать переводимые строки

source: When enabled, all generated strings are wrapped with the "_" macro, otherwise allow users to directly enter native text string encapsulated by wxT() macro
ru_ru: Если включено, все создаваемые строки обёртываются в макрос «_», в противном случае пользователи могут напрямую вводить исходную текстовую строку, инкапсулированную макросом wxT()

source: Add wxWidgets Handlers if missing
ru_ru: Добавлять обработчики wxWidgets, если таковые отсутствуют

source: When enabled, wxCrafter will add missing handlers (e.g. wxBitmapXmlHandler)
ru_ru: Если включено, wxCrafter будет добавлять отсутствующие обработчики (например, wxBitmapXmlHandler)

source: A control with this name already exists!
ru_ru: Элемент управления с таким именем уже существует!

source: Construct the Dropdown Menu
ru_ru: Создать раскрывающееся меню

source: Flags
ru_ru: Флаги

source: Proportion
ru_ru: Пропорция

source: Border
ru_ru: Граница

source: ** Click to select different virtual folder **
ru_ru: ** Щёлкните, чтобы выбрать другую виртуальную папку **

source: wxCrafter Project
ru_ru: Проект wxCrafter

source: The control's size. It is recommended to leave it as -1,-1 and let the sizers calculate the best size for the window
ru_ru: Размер элемента управления. Рекомендуется оставить значение -1,-1 и использовать сайзеры для расчёта оптимального размера окна

source: The control's minimum size, to indicate to the sizer layout mechanism that this is the minimum required size
ru_ru: Минимальный размер элемента управления. Указывает механизму компоновки сайзера, что это — минимальный требуемый размер

source: Set the control's background colour
ru_ru: Установить цвет фона элемента управления

source: Set the control's foreground colour
ru_ru: Установить цвет текста элемента управления

source: Set the control's font
ru_ru: Установить шрифт элемента управления

source: Sets the control initial state to 'Hidden'
ru_ru: Устанавливает начальное состояние «Скрыт» для элемента управления

source: Sets the control initial state to 'Disabled'
ru_ru: Устанавливает начальное состояние «Отключён» для элемента управления

source: This control should have keyboard focus
ru_ru: Этот элемент управления должен иметь фокус ввода с клавиатуры

source: Text Editor
ru_ru: Текстовый редактор

source: Use pre-defined font
ru_ru: Использовать предустановленный шрифт

source: Bold
ru_ru: Полужирный

source: Italic
ru_ru: Курсив

source: Underlined
ru_ru: Подчёркнутый

source: Custom font
ru_ru: Пользовательский шрифт

source: Check this to prevent this dialog from showing up again
ru_ru: Установите флажок, чтобы это диалоговое окно больше не появлялось

source: Set the class name
ru_ru: Укажите имя класса

source: Class:
ru_ru: Класс:

source: XRC Preview class:
ru_ru: Класс предварительного просмотра XRC:

source: Set here a standard wxWidgets control for preview purposes
ru_ru: Укажите здесь стандартный элемент управления wxWidgets для целей предварительного просмотра

source: Set here a standard wxWidgets control for preview purposes (optional)
ru_ru: Укажите здесь стандартный элемент управления wxWidgets для целей предварительного просмотра (необязательно)

source: Additional include file
ru_ru: Дополнительный включаемый файл

source: Include file:
ru_ru: Включаемый файл:

source: Place here the include file that this custom control requires e.g. #include <MyCustomControl.hpp>
ru_ru: Укажите здесь включаемый файл, который требуется этому пользовательскому элементу управления. Например, #include <MyCustomControl.hpp>

source: Implementation file content
ru_ru: Содержимое файла реализации

source: You may use here the following macros (the macros expands to the value defined in the designer): $parent - expands to the custom control parent name $name - expands to the C++ member name $id - the control ID Example: $name = new MyControl($parent, $id)
ru_ru: Можно использовать здесь следующие макросы (макрос развёртывается в значение, указанное в конструкторе): $parent — развёртывается в имя родительского элемента пользовательского элемента управления $control parent — развёртывается в имя члена C++ $id — идентификатор элемента управления Пример: $name = new MyControl($parent, $id)

source: Place the instantation code here e.g. $(name) = new MyControl(this);
ru_ru: Укажите здесь код создания экземпляра. Например, $(name) = new MyControl(this);

source: Custom Events
ru_ru: Пользовательские события

source: Define here custom events of the control e.g. 'Event Type' can be something like wxEVT_MY_BUTTON_CLICKED and 'Event Class' can be wxCommandEvent
ru_ru: Укажите здесь пользовательские события элемента управления. Например, «Тип события» может выглядеть как wxEVT_MY_BUTTON_CLICKED, а «Класс события» — как wxCommandEvent

source: Event Type
ru_ru: Тип события

source: Event Class
ru_ru: Класс события

source: Instantiation code:
ru_ru: Код создания экземпляра:

source: Events
ru_ru: События

source: Filepath to import:
ru_ru: Путь к файлу для импорта:

source: Enter the filepath to import
ru_ru: Укажите путь к файлу для импорта

source: Destination Filepath:
ru_ru: Путь к файлу назначения:

source: Enter the name and path for wxCrafter file once it's imported
ru_ru: Введите имя файла wxCrafter и путь к нему после его импорта

source: Add the new wxcp file to the current project
ru_ru: Добавить новый файл wxcp в текущий проект

source: Destination Virtual Folder:
ru_ru: Виртуальная папка назначения:

source: If the resulting .wxcp file is to be added to the current project, it needs to go in a Virtual Folder. Enter the one to use.
ru_ru: Если полученный файл .wxcp будет добавлен в текущий проект, его необходимо поместить в виртуальную папку. Укажите папку, которую следует использовать.

source: Load the .wxcp file when import is completed
ru_ru: Загружать файл .wxcp после завершения импорта

source: Type part of the file and hit ENTER
ru_ru: Введите часть имени файла и нажмите клавишу «Ввод»

source: Select the controls you wish to delete:
ru_ru: Выберите элементы управления, которые следует удалить:

source: Delete the selected control
ru_ru: Удалить выбранный элемент управления

source: Build:
ru_ru: Сборка:

source: Event Type:
ru_ru: Тип события:

source: Set the eventype here e.g. wxEVT_MY_BUTTON_CLICKED
ru_ru: Укажите здесь тип события. Например, wxEVT_MY_BUTTON_CLICKED

source: Event Class:
ru_ru: Класс события:

source: The event class. e.g. wxCommandEvent
ru_ru: Класс события. Например, wxCommandEvent

source: Select bitmap from a file
ru_ru: Выбирать значок из файла

source: Convert the selected path to relative (relative to the wxCrafter project file)
ru_ru: Преобразовать выбранный путь в относительный (относительно файла проекта wxCrafter)

source: Use wxArtProvider
ru_ru: Использовать wxArtProvider

source: This type identifies a specific art object which can be requested to wxArtProvider.
ru_ru: Этот тип определяет конкретный арт-объект, который может быть запрошен для wxArtProvider.

source: This type identifies the client of the art objects requested to wxArtProvider.
ru_ru: Этот тип определяет клиент арт-объектов, запрашиваемых для wxArtProvider.

source: Size Hint:
ru_ru: Подсказка размера:

source: Size of the returned bitmap or wxDefaultSize if size doesn't matter
ru_ru: Размер возвращаемого значка или wxDefaultSize, если размер не имеет значения

source: Control Events
ru_ru: События элемента управления

source: Inherited Events
ru_ru: Унаследованные события

source: The new base-class must have a different name. If you don't enter one, it will be created for you. The inherited fields are optional, but a good idea.
ru_ru: Для нового базового класса следует использовать другое имя. Если вы не укажете имя, то оно будет создано автоматически. Унаследованные поля не являются обязательными, но рекомендуется их использовать.

source: New Base-Class Name:
ru_ru: Имя нового базового класса:

source: e.g. FooBaseDlg
ru_ru: Например, FooBaseDlg

source: New Inherited-Class Name:
ru_ru: Имя нового унаследованного класса:

source: e.g. FooDlg
ru_ru: Например, FooDlg

source: New Inherited-Class Filename:
ru_ru: Имя файла нового унаследованного класса:

source: The basename of the file for the new inherited class e.g. For FooDlg you might choose foodlg
ru_ru: Базовое имя файла для нового унаследованного класса. Например, для FooDlg можно выбрать foodlg

source: Set label:
ru_ru: Метка:

source: Select bitmap:
ru_ru: Значок:

source: Select
ru_ru: Выбрать

source: Font Picker
ru_ru: Выбор шрифта

source: Define Custom Control
ru_ru: Указать пользовательский элемент управления

source: Choose an XRC file to import
ru_ru: Выбрать файл XRC для импорта

source: About wxCrafter...
ru_ru: О модуле wxCrafter…

source: New Custom Event
ru_ru: Создать пользовательское событие

source: Select Bitmap
ru_ru: Выбрать значок

source: Choose names
ru_ru: Выбрать имена

source: Select Bitmap / Text
ru_ru: Выбрать значок или текст

source: Set File and Bitmap
ru_ru: Установить файл и значок

source: Forms
ru_ru: Формы

source: Sizers
ru_ru: Сайзеры

source: A standard wxButton that can be placed in side a wxStdDialogButtonSizer class
ru_ru: Стандартный wxButton, который можно поместить внутри класса wxStdDialogButtonSizer

source: Stretchable spacer
ru_ru: Растягиваемый разделитель

source: Splitter Window Page
ru_ru: Страница окна разделения

source: Notebook Page
ru_ru: Страница блокнота

source: wxCollapsiblePane Pane
ru_ru: Область wxCollapsiblePane

source: Controls
ru_ru: Элементы управления

source: Custom Control
ru_ru: Пользовательский элемент управления

source: Menu / ToolBar
ru_ru: Меню/Панель инструментов

source: Sub Menu
ru_ru: Подменю

source: Toolbar Item
ru_ru: Элемент панели инструментов

source: Toolbar Separator
ru_ru: Разделитель панели инструментов

source: wxRibbonButton (Normal)
ru_ru: wxRibbonButton (обычный)

source: wxRibbonButton (Dropdown)
ru_ru: wxRibbonButton (раскрывающийся список)

source: wxRibbonButton (Hybrid)
ru_ru: wxRibbonButton (гибридный)

source: wxRibbonButton (Toggle)
ru_ru: wxRibbonButton (переключатель)

source: wxRibbonTool (Normal)
ru_ru: wxRibbonTool (обычный)

source: wxRibbonTool (Dropdown)
ru_ru: wxRibbonTool (раскрывающийся список)

source: wxRibbonTool (Hybrid)
ru_ru: wxRibbonTool (гибридный)

source: wxRibbonTool (Toggle)
ru_ru: wxRibbonTool (переключатель)

source: wxRibbonTool (Separator)
ru_ru: wxRibbonTool (разделитель)

source: wxDataViewCtrl (with tree-list custom model)
ru_ru: wxDataViewCtrl (с пользовательской моделью древовидного списка)

source: Add a column...
ru_ru: Добавить столбец…

source: wxInfoBar Button
ru_ru: Кнопка wxInfoBar

source: Select the form type:
ru_ru: Тип формы:

source: Select the form type
ru_ru: Выберите тип формы

source: Set the form title (optional):
ru_ru: Заголовок формы (необязательно):

source: Resource file:
ru_ru: Файл ресурсов:

source: Select the wxcp project in which to put this new form
ru_ru: Выберите проект wxcp, в который следует поместить эту новую форму

source: Create a new wxcp file
ru_ru: Создать новый файл wxcp

source: Base class name:
ru_ru: Имя базового класса:

source: The base class name e.g. FooBase wxCrafter will place all the generated UI code into this class. You will normally derive a class Foo from this class, and put your own code there.
ru_ru: Имя базового класса, например FooBase. wxCrafter будет помещать весь создаваемый код пользовательского интерфейса в этот класс. Обычно вы будете получать класс Foo, производный от этого класса, и помещать туда собственный код.

source: Derived class name:
ru_ru: Имя производного класса:

source: The name of the class derived from 'Base class name' e.g. 'Foo' where the base-class is 'FooBase'.
ru_ru: Имя класса, производного от «Имя базового класса», например «Foo», где базовый класс — «FooBase».

source: Subclass file:
ru_ru: Файл подкласса:

source: The filename in which to store the derived class (no need to add the extension). e.g. for a class Foo, stored in files foo.cpp and foo.hpp, write 'foo' here.
ru_ru: Имя файла для хранения производного класса (добавлять расширение не требуется). Например, чтобы класс Foo хранился в файлах foo.cpp и foo.hpp, введите здесь «foo».

source: Virtual Folder:
ru_ru: Виртуальная папка:

source: Select the virtual folder within the project for the generated files
ru_ru: Выберите в проекте виртуальную папку для создаваемых файлов

source: Create new wxCrafter Form
ru_ru: Создать новую форму wxCrafter

source: wxWidgets GUI Designer
ru_ru: Конструктор графического пользовательского интерфейса wxWidgets

source: Show the designer
ru_ru: Показать конструктор

source: Open wxCrafter project...
ru_ru: Открыть проект wxCrafter...

source: Close wxCrafter project
ru_ru: Закрыть проект wxCrafter

source: Save project
ru_ru: Сохранить проект

source: Import a wxSmith file
ru_ru: Импорт файла wxSmith

source: Import from XRC
ru_ru: Импорт из XRC

source: Define custom control...
ru_ru: Указать пользовательский элемент управления...

source: Edit custom controls...
ru_ru: Изменить пользовательские элементы управления...

source: Delete custom control...
ru_ru: Удалить пользовательский элемент управления...

source: wxCrafter project is modified Do you want to save your changes?
ru_ru: Проект wxCrafter изменён. Сохранить изменения?

source: Could not find target project: '
ru_ru: Не удалось найти целевой проект: '

source: Make sure that the virtual folder entry is valid (it must exist)
ru_ru: Убедитесь, что запись виртуальной папки является допустимой (она должна существовать)

source: Virtual Folder provided was: '
ru_ru: Указанная виртуальная папка: '

source: wxCrafter: code generation completed successfully!
ru_ru: wxCrafter: создание кода успешно завершено!

source: Add wxWidgets UI Form...
ru_ru: Добавить форму пользовательского интерфейса wxWidgets…

source: Could not create virtual folder 'wxcrafter'
ru_ru: Не удалось создать виртуальную папку «wxcrafter»

source: Error while reading file content: '
ru_ru: Ошибка при чтении содержимого файла: '

source: Could not read file content
ru_ru: Не удалось прочитать содержимое файла

source: In order for the change to take place, you need to restart codelite
ru_ru: Чтобы изменения вступили в силу, необходимо перезапустить CodeLite

source: Open with wxCrafter...
ru_ru: Открыть с помощью wxCrafter...

source: Import with wxCrafter...
ru_ru: Импорт с помощью wxCrafter...

source: Re-generate code for project
ru_ru: Повторно создать код для проекта

source: This project does not contain any wxCrafter files
ru_ru: Этот проект не содержит файлы wxCrafter

source: Icon Type:
ru_ru: Тип значка:

source: Bg Colour:
ru_ru: Цвет фона:

source: Fg Colour:
ru_ru: Цвет текста:

source: ID:
ru_ru: Идентификатор:

source: Include File:
ru_ru: Включаемый файл:

source: Style:
ru_ru: Стиль:

source: Hidden
ru_ru: Скрыт

source: Disabled
ru_ru: Отключён

source: Focused
ru_ru: В фокусе

source: Tooltip:
ru_ru: Подсказка:

source: Centre:
ru_ru: Центр:

source: Shortcut:
ru_ru: Комбинация клавиш:

source: Default Button
ru_ru: Кнопка по умолчанию

source: Wrap:
ru_ru: Перенос:

source: # Columns:
ru_ru: Количество столбцов в сетке:

source: Col Label Vertical Align
ru_ru: Выравнивание метки столбца по вертикали

source: Col Label Horizontal Align
ru_ru: Выравнивание метки столбца по горизонтали

source: Rows:
ru_ru: Строки:

source: Row Label Vertical Align
ru_ru: Выравнивание метки строки по вертикали

source: Row Label Horizontal Align
ru_ru: Выравнивание метки строки по горизонтали

source: Use Native Header
ru_ru: Использовать собственный заголовок

source: Use Native Column Labels
ru_ru: Использовать собственные метки столбцов

source: # Rows:
ru_ru: Количество строк в сетке:

source: Growable columns:
ru_ru: Увеличиваемые столбцы:

source: Growable rows:
ru_ru: Увеличиваемые строки:

source: Horizontal gap:
ru_ru: Горизонтальный просвет:

source: Vertical gap:
ru_ru: Вертикальный просвет:

source: Value:
ru_ru: Значение:

source: Max Length:
ru_ru: Максимальная длина:

source: Auto Complete Directories:
ru_ru: Каталоги автодополнения:

source: Auto Complete Files:
ru_ru: Файлы автодополнения:

source: Orientation:
ru_ru: Ориентация:

source: Minimum Size:
ru_ru: Минимальный размер:

source: Bitmap File:
ru_ru: Файл значка:

source: Bitmap File (16x16) :
ru_ru: Файл значка (16x16):

source: Bitmap File (32x32) :
ru_ru: Файл значка (32x32):

source: Bitmap File (64x64) :
ru_ru: Файл значка (64x64):

source: Bitmap File (128x128):
ru_ru: Файл значка (128x128):

source: Bitmap File (256x256):
ru_ru: Файл значка (256x256):

source: Disabled-Bitmap File
ru_ru: Файл значка отключённого элемента управления

source: Choices:
ru_ru: Варианты выбора:

source: ComboBox Choices:
ru_ru: Варианты выбора поля со списком:

source: Selection:
ru_ru: Выбор:

source: Title:
ru_ru: Заголовок:

source: Enable Window Persistency:
ru_ru: Включить сохранение состояния окна:

source: Width:
ru_ru: Ширина:

source: Height:
ru_ru: Высота:

source: Major Dimension:
ru_ru: Основной размер:

source: Min value:
ru_ru: Минимальное значение:

source: Max value:
ru_ru: Максимальное значение:

source: Range:
ru_ru: Диапазон:

source: HTML Code:
ru_ru: HTML-код:

source: Fit Content to Columns
ru_ru: Отображение содержимого в соответствии с размерами столбцов

source: Allow Cell Editing
ru_ru: Разрешить редактирование ячеек

source: Checked
ru_ru: Установлено

source: Show Cancel Button
ru_ru: Показать кнопку «Отмена»

source: Show Search Button
ru_ru: Показать кнопку «Поиск»

source: Message:
ru_ru: Сообщение:

source: Wildcard:
ru_ru: Подстановочный знак

source: Thumbsize:
ru_ru: Размер ползунка:

source: Page Size:
ru_ru: Размер страницы:

source: Normal Colour:
ru_ru: Обычный цвет:

source: Visited Colour:
ru_ru: Цвет посещённых ссылок:

source: Hover Colour:
ru_ru: Цвет при наведении:

source: Default Path:
ru_ru: Путь по умолчанию:

source: Filter Index:
ru_ru: Индекс фильтра:

source: Show Hidden Files:
ru_ru: Показать скрытые файлы:

source: Scroll Rate X:
ru_ru: Скорость горизонтальной прокрутки:

source: Scroll Rate Y:
ru_ru: Скорость вертикальной прокрутки:

source: Expand Node
ru_ru: Развернуть узел

source: Null Page
ru_ru: Пустая страница

source: Split Mode:
ru_ru: Режим разделения:

source: Sash Gravity:
ru_ru: Гравитация управляющего элемента для изменения размера окна:

source: Minimum Pane Size:
ru_ru: Минимальный размер панели:

source: Sash Position:
ru_ru: Положение управляющего элемента для изменения размера окна:

source: Set Splitter Left:
ru_ru: Установить разделитель слева:

source: Cell Position:
ru_ru: Положение ячейки:

source: Cell Span:
ru_ru: Число охватываемых ячеек:

source: Kind:
ru_ru: Вид:

source: Help String:
ru_ru: Строка справки:

source: Margins:
ru_ru: Поля:

source: Bitmap Size:
ru_ru: Размер значка:

source: Field Count:
ru_ru: Количество полей:

source: Padding:
ru_ru: Внутренний отступ:

source: Separator Size:
ru_ru: Размер разделителя:

source: Line Number Margin
ru_ru: Поле номера строки

source: Symbol Margin
ru_ru: Поле символа

source: Fold Margin
ru_ru: Поле свёртываемой области

source: Separator Margin
ru_ru: Поле разделителя

source: Lexer
ru_ru: Лексический анализатор

source: Wrap Text
ru_ru: Перенести текст

source: Indentation Guides
ru_ru: Направляющие отступа

source: Display EOL Markers
ru_ru: Отобразить маркеры конца строки

source: Class Decorator
ru_ru: Декоратор класса

source: Alignment
ru_ru: Выравнивание

source: Generated Model Class Name
ru_ru: Имя создаваемого класса модели

source: Cell Mode
ru_ru: Режим ячейки

source: Column Flags
ru_ru: Флаги столбца

source: Container Item Has Columns
ru_ru: Элемент контейнера имеет столбцы

source: Gradient Start
ru_ru: Начало градиента

source: Gradient End
ru_ru: Конец градиента

source: Note
ru_ru: Примечание

source: Collapsed
ru_ru: Свёрнуто

source: Icon ID
ru_ru: Идентификатор значка

source: Sash Size
ru_ru: Размер управляющего элемента для изменения размера окна

source: Pane Border Size
ru_ru: Размер границы панели

source: Sash Colour
ru_ru: Цвет управляющего элемента для изменения размера окна

source: Caption Colour
ru_ru: Цвет заголовка

source: Caption Gradient Colour
ru_ru: Цвет градиента заголовка

source: Inactive Caption Colour
ru_ru: Цвет заголовка неактивного окна

source: Inactive Caption Gradient Colour
ru_ru: Цвет градиента заголовка неактивного окна

source: Active Caption Text Colour
ru_ru: Цвет текста заголовка активного окна
